{
  "chapters": [
    {
      "chapter 1": [
        {
          "verse number": 1,
          "verse title": "The subject proposed",
          "verse": "अथ योगानुशासनम्",
          "translation": "atha yogānuśāsanam",
          "meaning": "Now, then, the exposition of Concentration (is to be made)",
          "explanation": [
            "The expression 'Now, then,' intimates (that) a (distinct) topic (here commences) ;  and it serves as a benediction (the particle ATHA being regarded as an auspicious one).",
            "The word YOGA, from the root YUJ to keep the mind fixed in abstract meditation,' means such a restraining of the exercise of the mind, or Concentration.",
            "An 'exposition' is that whereby something is expounded, or declared, through its characteristic marks, its nature, & c. An 'exposition of the YOGA,' (such is the meaning of the compound word) YOGANUSASANA. This (viz., the expounding of the nature, & c., of Concentration) is to be understood to be the topic even to the end of this Institute (of PATANJALI'S).",
            "But what is Concentration (YOGA) ?  To this he replies"
          ]
        },
        {
          "verse number": 2,
          "verse title": "Concentration defined",
          "verse": "योगश्चित्तवृत्तिनिरोधः",
          "translation": "yogaścittavṛttinirodhaḥ",
          "meaning": "Concentration (yoga) is the hindering of the modifications of the thinking principle",
          "explanation": [
            "That is to say, Concentration is the hindering, or the preventing of the modifications, to be described hereafter of the Mind internal organ (to which modifications the internal organ is liable when allowed to come into contact with objects, as will be explained further on) ;  and this 'hindering' is a super-sensual species of effort which is the cause of the destruction of these modifications.",
            "But then (a doubt may here occur). It is a tenet both of the SANKHYA and the YOGA that the soul just consists of the knowledge which has as its objects the modifications (in question, the two being united) like fire and the wood (or fuel of the fire) ; on the destruction of the modifications, then, the Soul, too, should be annihilated, as the fire is in the absence of the fuel : and therefore, at the time of Concentration, what is the soul concerned about? with reference to this he declares as follows :"
          ]
        },
        {
          "verse number": 3,
          "verse title": "Condition of the soul during concentration",
          "verse": "तदा द्रष्टुः स्वरूपेऽवस्थानम्",
          "translation": "tadā draṣṭuḥ svarūpe'vasthānam",
          "meaning": "Then (i.e., at the time of concentration) it (the soul) abides in the form of the spectator (without a spectacle.)",
          "explanation": [
            "'Then' ; i.e. at the time.",
            "'In the form of the spectator'; - i.e. of soul in the form of Thought simply (without any object thought of_). 'Its state is' ; such is the force of the term AVASTHANA (rendered 'it abides', & c.)",
            "and so the definition (of Concentration) is this, that concentration is the hindering of the modifications of the internal organ, which (prevention of its being modified) is the cause of abiding in the form of soul simply.",
            "What then is the form of this (Soul) when in a state other than that of Concentration? To this he replies :"
          ]
        },
        {
          "verse number": 4,
          "verse title": "Conditions of the soul at other times",
          "verse": "वृत्तिसारूप्यमितरत्र",
          "translation": "vṛttisārūpyamitaratra",
          "meaning": "At other times (Than that of Concentration) it (The soul) is in the same form as the modifications (of the internal organ)",
          "explanation": [
            "'At other times ;' i.e. at another time than that of Concentration. The 'modification' are those that are to be described. To be 'in the same form' as these, means to consist of these. The meaning (of the whole) is this, that when the internal organ (or Mind), through the senses, is affected (or modified) by the form of some object, the soul also (viewing the object through its organ the Mind) is as it were altered into that form, as the moon (reflected) in the moving ripples of the water, is like as if it were (itself) moving.",
            "Well, then : it was stated that the modifications (of the internal organ) are to be hindered. Of how many kinds, then, are these (modifications), or what are they like? To this he replies :"
          ]
        },
        {
          "verse number": 5,
          "verse title": "The modifications of the thinking principle, how many and what like",
          "verse": "वृत्तयः पञ्चतय्यः क्लिष्टाऽक्लिष्टाः",
          "translation": "vṛttayaḥ pañcatayyaḥ kliṣṭā'kliṣṭāḥ",
          "meaning": "The modifications (of the internal organ) are of five kinds, (and they are either) painful or not painful.",
          "explanation": [
            "'Modifications' : i.e. various altered states of the internal organ. 'Of five kinds, or of five sorts, 'Painful' : invaded by vexations which will be defined in the sequel. 'Not painful' : i.e. the reverse thereof.",
            "Which are those five Modifications ? With reference to this, he states :"
          ]
        },
        {
          "verse number": 6,
          "verse title": "These modifications specified",
          "verse": "प्रमाणविपर्ययविकल्पनिद्रास्मृतयः",
          "translation": "pramāṇaviparyayavikalpanidrāsmṛtayaḥ",
          "meaning": "(The modifications of the internal organ are) Evidence (or right notion), Misconception, Fancy, Sleep, and Memory",
          "explanation": [
            "(All this is) clear.",
            "He defines these (modifications) in their order."
          ]
        },
        {
          "verse number": 7,
          "verse title": "Right notions",
          "verse": "प्रत्यक्षानुमानागमाः प्रमाणानि",
          "translation": "pratyakṣānumānāgamāḥ pramāṇāni",
          "meaning": "The Evidences are Perception, Inference, and Testimony.",
          "explanation": [
            "Here (it will be observed) without stating the definition of the several kinds of evidence, this being so familiarly known, he has only divided them. (Lest, however, reader should require the information, we may remark, in passing, that) the evidence called Perception is that modification of the internal organ which takes the form of assurance in respect of some object not previously apprehended. Inference is the modification of the internal organ produced from a correct notion of a general proposition. & c. (respecting objects previously apprehended, as explained in the works of the Nyaya). and the evidence called Testimony is (what produces) that modification of the internal organ which arises from the words of one worthy (to be received as an authority).",
            "Having thus spoken of the modification of the internal organ which consists in evidence (or, as we should rather say which consists in the correct state of cognition resulting from good evidence), he mentions that which is in the shape of misconceptions."
          ]
        },
        {
          "verse number": 8,
          "verse title": "What is misconception ?",
          "verse": "विपर्ययो मिथ्याज्ञानमतद्रूपप्रतिष्ठम्",
          "translation": "viparyayo mithyājñānamatadrūpapratiṣṭham",
          "meaning": "Misconception is incorrect notion, not staying in the (proper) form of that (in respect whereof the misconception is entertained).",
          "explanation": [
            "(That is to say) misconception is a notion arising in respect of something that is not so and so, that it is so and so ; as, in the case of mother o'pearl, the notion of silver. 'Not staying in the (proper) form of that' ;  that is to say, which does not abide in that form which is the form of that thing (in respect of which the notion is entertained), which amounts to its not revealing the form (or real nature) which belongs to the thing.",
            "(To illustrate this language of our author, we may here state the theory of the Understanding which he adopts, as we find it laid down in the Vedanta Paribhasha. The internal organ is there compared to water, in respect of its readiness to adapt itself to the form of whatever mould it may enter. \"As the water of a reservoir, having issued from an aperture, having entered, by a channel, the basins (or beds with raised edges formed in the fields that require irrigation) becomes four-cornered or otherwise shaped just like these ; so the manifesting internal organ (or Mind), having gone, through the sight or other channel, to where there is an object, for instance a jar, becomes modified by the form of the jar or other object. It is this altered state (of the internal organ) that is called its modification.\" This 'manifesting internal organ,' whilst it is regarded as moulding itself upon the object, is regarded as at the same time manifesting it — or revealing it as a mirror does. To a considerable extent this theory of the Understanding is analogous to the theory of vision entertained by those who regard the retina as reflecting to the intelligent principle those visible forms of which the retina itself is uncognisant ; whilst the intelligent principle itself is cognisant of things visible only inasmuch as they are reflected to it by the retina. 'The modifications' are akin to Locke's 'ideas').",
            "Doubt also — for example whether the object be a man or a post — is incorrect notion, inasmuch as the real nature of the object is not thereby revealed.",
            "In order to declare what modification (of the internal organ) is fancy—he says as follows :—"
          ]
        },
        {
          "verse number": 9,
          "verse title": "What are fanciful notions?",
          "verse": "शब्दज्ञानानुपाती वस्तुशून्यो विकल्पः",
          "translation": "śabdajñānānupātī vastuśūnyo vikalpaḥ",
          "meaning": "A Fancy is (a notion) devoid of a thing (in reality corresponding thereto), following upon knowledge (conveyed) by words",
          "explanation": [
            "'Knowledge produced (or conveyed) by words :' (such is the sense of the compound) sabda-jnana. 'That, the habit whereof is to follow this (verbal information),' is what is so named (viz. fancy). The meaning is — that a fancy is a conception, without a thing (corresponding to it).",
            "Examples of this are such notions as 'The head of Rahu', and 'The soul's Thinking,' — and 'Something like the horns of a hare,' &c. Even after (discovering) the absurdity (involved in such notions), people yet deal with verbal knowledge (as if it were strictly receivable) in such senses, (and it depends upon circumstances whether any serious error is to result from this or not).",
            "(As a hare has no horn, the notion of a hare's horn is a fanciful one, 'devoid of a thing in rerum natura corresponding to the notion.' A person hearing the expression 'The head of Rahu' naturally proceeds to fancy that there is some Rahu to whom this head belongs ; — but Rahu is all head — being a bodiless monster who is held to cause eclipse by swallowing the sun and moon, which emerge from obscuration when they come to the end of his dissevered gullet. The notion, therefore, raised by the expression 'The head of Rahu,' that there is any more of him besides the head, is a fancy — equally with that of the hare's horn — 'devoid of a thing corresponding to the notion.' So again, a person hearing the expression 'The soul's Thinking,' naturally proceeds to fancy that there is some Soul to whom this thinking belongs, — whereas the Soul is nothing besides the Thinking. Although, according to the commentator, such expressions are liable to suggest fancies that have nothing in reality corresponding to them, yet the employment of the expressions does not necessarily mislead if we carefully bear in mind what is the real state of the case. Much on the same principle people in Europe continue to speak of the sun's rising and setting, though, holding the heliocentric theory, they do not really fancy that the sun either rises or sets).",
            "In order to declare what is sleep, he says :"
          ]
        },
        {
          "verse number": 10,
          "verse title": "Definition of sound sleep",
          "verse": "अभावप्रत्ययालम्बना वृत्तिर्निद्रा",
          "translation": "abhāvapratyayālambanā vṛttirnidrā",
          "meaning": "Sleep is that modification (of the internal organ) which depends on the conception of nothing.",
          "explanation": [
            "Of what modification (of the internal organ) the ground is the conception of nothing, this is what is so called (viz. sleep).",
            "This may be (also) sated as follows : Sleep is that modification (of the internal organ) which takes place on the quitting of all objects, through (the quality of) Darkness's getting everywhere the upper hand (to the exclusion of the other two qualities, which, are held to be constituents of the of the phenomenal universe).",
            "And the fact that this (dreamless sleep) is a modification (of the internal organ, and not a mere blank), is (proved) by our seeing that one recollects (on arising from profound and dreamless sleep) that 'I slept pleasantly;' and there could not be a recollection if there had not been a state of consciousness (to furnish the matter of the recollection.)",
            "In order to describe memory, he says—"
          ]
        },
        {
          "verse number": 11,
          "verse title": "Memory defined",
          "verse": "अनुभूतविषयासंप्रमोषः स्मृतिः",
          "translation": "anubhūtaviṣayāsaṃpramoṣaḥ smṛtiḥ",
          "meaning": "Memory is the not letting go of an object that one has been aware of.",
          "explanation": [
            "(That is to say) — memory (or recollection) is the not letting go—or, by means of the self-reproductive quality (of the Soul) the arising, in the understanding, of that which has been cognised through evidence (of the senses, for example;).",
            "waking, sleeping, and dreaming",
            "Of these (modifications of the internal organ, the three following viz.) right notion, misconception and fancy are walking states. When just these (impressions—in the absence of the objects or of what gave rise to them) are sensible, through the force (or vividness) of the impression, then there is dream. But (dreamless) sleep is without any object cognised. And Recollection may take its rise either in a right notion, in a misconception, in a fancy, or in (dreamless) sleep.",
            "Having thus described the modifications (of the internal organ), in order to explain the prevention of these with the means thereof, he says—"
          ]
        },
        {
          "verse number": 12,
          "verse title": "Asceticism and mortification, the means of repelling the transciem",
          "verse": "अभ्यासवैराग्याभ्यां तन्निरोधः",
          "translation": "abhyāsavairāgyābhyāṃ tannirodhaḥ",
          "meaning": "The hindering of these (modifications of the internal organ is to be effected) by means of Exercise and Dispassion.",
          "explanation": [
            "'Exercise and dispassion' will be defined. By these (viz. exercise and dispassion), the repelling of those modifications of the internal organ which (modifications, at different times) have the form of revealing, energising, and obstructing, this is the 'hindering'— (which is to be striven after, and which is tantamount to) the resting (of these modifications), in a potential shape, in their cause, viz ; in the internal organ (without taking an actual shape as products of the internal organ modified).",
            "Of the two (viz. exercise and dispassion,) it is from 'dispassion,' which originates in our discerning the perniciousness of the objective, that a version thereto arises. And, by 'exercise,' confirmed steadfastness (in the indifference towards all objects) is produced. So, by these two, the internal organ is hindered from undergoing modification.",
            "In order to describe 'exercise' he says —"
          ]
        },
        {
          "verse number": 13,
          "verse title": "What is ascetic effort?",
          "verse": "तत्र स्थितौ यत्नोऽभ्यासः",
          "translation": "tatra sthitau yatno'bhyāsaḥ",
          "meaning": "'Excercise is the (repeated) effort that is (viz. the internal organ) shall remain in its (unmodified) state.",
          "explanation": [
            "The condition of the internal organ, when free from modification, existing only in its own (unmodified) form, is what we mean by its (unmodified) state. And what we mean by 'exercise' is the effort, or endeavour, again and again to reduce the internal organ to such a condition (of freedom from modification).",
            "He next mentions a special character of this same exercise, or persevering effort)."
          ]
        },
        {
          "verse number": 14,
          "verse title": "",
          "verse": "स तु दीर्घकालनैरन्तर्यसत्कारासेवितो दृढभूमिः",
          "translation": "sa tu dīrghakālanairantaryasatkārāsevito dṛḍhabhūmiḥ",
          "meaning": "But this (exercise) is a firm position observed out of regard (for the end in view, and perseveringly, adhered to) for a long time unintermittingly.",
          "explanation": [
            "That is to say : it (exercise) is a firm ground (or state of steadfastness) to be firm (we may remark in passing) is to be steadfast, this (state of steadfastness) being assiduously attended to, during a long time unintermittingly, out of the excess of regard (which one entertains for the end to be gained).",
            "He now mentions the definition of 'dispassion'."
          ]
        },
        {
          "verse number": 15,
          "verse title": "Dispassion defined",
          "verse": "दृष्टानुश्रविकविषयवितृष्णस्य वशीकारसंज्ञा वैराग्यम्",
          "translation": "dṛṣṭānuśravikaviṣayavitṛṣṇasya vaśīkārasaṃjñā vairāgyam",
          "meaning": "Dispassion is the consciousness of having overcome (ones's desiers, this consciousness being that) of him who thirsts after neither the objects that are seen (on earth) nor those that are heard of (in scripture).",
          "explanation": [
            "Object is of two kinds — 'seen' (drishta) and 'heard of' (anusravika). One 'seen' is one apprehended here (on earth) — as a Sound (or other object of sense). One 'heard of' means one in the world of the gods or elsewhere (where it cannot be seen by us). The Veda is called anusrava because it is (not first read by the young student, but is) listened to (sruyate) from the mouth of the preceptor (and heard after, or consequently on, the teacher's utterance, — as the prefix anu implies). What (object) comes (to our knowledge) there from (i.e. from the Veda) is what we mean by one 'heard of' (anusravika).",
            "What is called 'dispassion' is the reflection. \"These (objects—whether of this world or of the one beyond) are my subjects;  I am not their slave,\" this 'consciousness of having overcome' entertained by him who, from discerning the insipidity of the results of both of those (classes of objects) has dismissed all eagerness about them.",
            "He next mentions a peculiar aspect of this same (i.e. of 'dispassion.')"
          ]
        },
        {
          "verse number": 16,
          "verse title": "Dispassion carries the length of indifference to all objects",
          "verse": "तत्परं पुरुषख्यातेर्गुणवैतृष्ण्यम्",
          "translation": "tatparaṃ puruṣakhyāterguṇavaitṛṣṇyam",
          "meaning": "This (viz. 'Dispassion,') carried to the utmost is indifference regarding the 'qualities' (i.e., everything else than soul), and this indifference arises from a knowledge of soul (as distinguished from the 'qualities.)",
          "explanation": [
            "'This :' — i.e. 'dispassion,' 'carried to the utmost :' i.e. elevated (to its utmost). The first (degree of 'dispassion,) has regard to (ordinary) objects; but the second, has regard to the 'qualities' (from which, according to the Sankhya, ordinary objects arise). This arises only from familiarity with the distinction between the 'qualities' and Soul (or the objective and subjective). From its extreme conduciveness to abstract meditation (it ranks above the dispassion which has regard only to the grosser objects).",
            "Having thus stated the nature of concentration (Yoga), he (next) mentions the difference between the nature of (meditation, which is of two kinds—viz.) that 'in which there is distinct recognition,' (samprajnata) and that 'in which distinct recognition is lost,' (a-samprajnata)."
          ]
        },
        {
          "verse number": 17,
          "verse title": "Meditation, with an object",
          "verse": "वितर्कविचारानन्दास्मितारूपानुगमात् संप्रज्ञातः",
          "translation": "vitarkavicārānandāsmitārūpānugamāt saṃprajñātaḥ",
          "meaning": "(Meditation—of the kind called) that 'in which there is distinct recognition' (arises, in its fourfold shape,) from the attendance of (1) 'argumentation' (Vitarka), (2) 'Deliberation' (Vichara), (3) 'Beatitude' (Ananda), and (4) 'Egotism' (Asmita).",
          "explanation": [
            "The word 'Meditation' is required to supply the ellipsis in the aphorism.",
            "Meditation 'in which there is distinct recognition' (samprajnata) is a kind of 'pondering' (bhavana) whereby the nature of that which is to be pondered is known thoroughly and well-apart from either doubt or error. This meditation 'in which there is distinct recognition' excludes every modification of the mind (or every idea) other than what is to be pondered : it is, in short, meditation with its seed (i.e. with the object, in the effort to apprehend which exclusively the meditation originates).",
            "This (meditation 'in which there is distinct recognition) through its division into the 'argumentative' &c., is of four kinds, viz. (1) the 'argumentative,' (2) the 'deliberative,' (3) the 'beatific', and (4) the 'egotistical.'",
            "As for 'Pondering', this means the taking into the mind again and again, to the exclusion of all other objects, that which is to be pondered. and that which is (a suitable object) to be pondered is of two kinds, being either the Lord (isvara) or the twenty-five principles. These (twenty-five principles) also are of two kinds, through their distinction as senseless and not senseless. Twenty-four (of the principles, including Earth, &c.), are senseless :— that which is not senseless is Soul.",
            "Among these (objects suitable for being pondered) when, having taken as the obect the Sense and the Elements which are gross (in comparison with the Subtile Elements next to be spoken of), pondering is engaged in, in the shape of the investigation as to which is antecedent and which is consequent (i.e. whether the Senses generate the Elements or the Elements generate the senses)—then the Meditation is (technically said to be) argumentative’ (savitarka). ",
            "When, having taken as the object something subtile, as the Subtile Elements and the Internal Organ, pondering is engaged in, in so far as regards the where and the when thereof—then it (the pondering) is (technically said to be) ‘deliberative (savichara).",
            "But when the ‘pure’ element (sattva) of the Internal Organ, commingled with somewhat of (the two other elements—viz.) ‘passion’ and ‘darkness’ is pondered, then the meditation is (technically termed) ‘beatiﬁc’ (sananda) because the 'pure element’ then pondered, which consists in the manifestation of joy is predominant—inasmuch as the intellectual faculty is then (i.e. in this particular case of pondering) a secondary matter.",
            "After that (pondering of the ‘pure element’ commingled with the two others, the meditation which is engaged in, having, as that on which it rests, the clear ‘pure element’ unaffected by even a little of ‘passion’ or ‘darkness,’ is called ‘egoistical' meditation, because, here, (personal) existence only remains, since the intellectual faculty becomes now predominant inasmuch as the ‘pure element’ which is to be apprehended (as the object of the meditation) is here disregarded (as the mere stepping stone to higher things).",
            "Among these (four kinds of ‘meditation, where there is distinct recognition' of an object) the first, the 'argumentative meditation includes all (that belongs to) the four. The second the 'deliberative,' leaves out the 'argumentation' (of the preceding) : the third, the 'beatific,'  leaves out the deliberation (of the second) : the fourth, consisting in mere self-consciousness leaves out that (beatitude which belongs to the third) : and all these (four) are meditations with something to rest upon (as the object pondered; the soul of the ascetic, like the body of the young swimmer, requiring supports to begin with, which are successively laid aside as power and confidence are gained by practice).",
            "He next tells what is meant by that (meditation) 'in which distinct recognition is lost' (the practised ascetic having parted with every vestige of object, as the practised swimmer with his last cork or bladder)."
          ]
        },
        {
          "verse number": 18,
          "verse title": "Meditation, without an object",
          "verse": "विरामप्रत्ययाभ्यासपूर्वः संस्कारशेषोऽन्यः",
          "translation": "virāmapratyayābhyāsapūrvaḥ saṃskāraśeṣo'nyaḥ",
          "meaning": "The one (kind of meditation just described) is preceded by the exercise of thought in the shape of repose ; the other (independent of any fresh antecedent) is in the shape of the self-reproduction (of thought, after the departure of all objects)",
          "explanation": [
            "by 'repose' (virama) we mean that whereby one is rested, — the abandonment of all anxiety about argumentation, & c. Well — 'thought' in the shape of this 'repose' is what we mean by the compound expression virama-pratyaya ; — what we mean by the 'exercise' (abhyasa) of this, is the reiteratedly dwelling mentally thereon, and constantly rejecting with a negative (as a delusion and an unreality) whatever 'modification' (or idea,) springs up there (to interfere with it) — such is 'the exercise of thought in the shape of repose.' This (as remarked in the first half of the aphorism) produces meditation 'in which there is distinct recognition' (and we have now to consider that kind of meditation which differs from this).",
            "The other (kind of meditation) has nothing left but the self-reproduction of thought. It is different from that (above described); that is to say, it is (as contradistinguished from meditation in which there is distinct recognition,') that 'in which distinct recognition is lost.' Here there is nothing to be thought of or accurately apprehended (as it was necessary that there should be in the former process) ; it is meditation without a seed (i.e. without any object in any effort to confine one's self to the apprehension of which the meditation has been entered upon).",
            "Well, having thus stated the (two) distinctions in the nature of Concentration, and having compendiously mentioned its methods, the author proceeds to speak of these methods more fully, first premising some account of the spurious semblance of concentration."
          ]
        },
        {
          "verse number": 19,
          "verse title": "Spurious semblances of abstract Meditation",
          "verse": "भवप्रत्ययो विदेहप्रकृतिलयानाम्",
          "translation": "bhavapratyayo videhaprakṛtilayānām",
          "meaning": "Of (the meditative state attained to by the two classes of aspirants, technically called) 'the unembodied and resolved into nature,' the world is the cause.",
          "explanation": [
            "By 'the unembodied and resolved into Nature' we mean to speak of (those technically called) 'the enembodied' (as one set), and 'the resolved into Nature' (as another set). Of these the Meditation is caused by the world, — that is to say, it is such that the cause, or instrumental agency on which it depends, is the world — the creation — (the phenomenal — beyond which the vision of these extends not to the discrimination of pure Spirit, and the uncreated energy Nature).",
            "The meaning is this — that, only while the world is manifest, are these men participators in such (inadequate) meditation (as we have described). And this is a mere false semblance of meditation, because these do not discern the ultimate Reality. Hence, by him who desires emancipation, effort is to be made for (attaining to) the knowledge of the ultimate Reality, and for pondering that (instead of the lower things pondered by those of narrower ken, whose vision cannot pierce the phenomenal, and discriminate the spectator Soul, and the natura naturans).",
            "And, of the persons spoken of in the aphorism, those who, having their energies directed to 'beatific' meditation, do not discern any other Reality, in the shape of Nature of Soul, these are they who are meant by the term the 'unembodied' (videha), because their body and their self-consciousness are departed (but they are not further advanced towards emancipation). And those who (going just one step further) are content with the 'egotistic meditation but do not discern the Supreme Soul, and whose intellect has been resolved into (the natura naturans which is) its cause, these are they who are called the 'resolved into nature' (prakritilaya).",
            "But of others than those (whose inadequate style of meditation has been stated in aphorism 19, the meditation is as stated in the aphorism here following)."
          ]
        },
        {
          "verse number": 20,
          "verse title": "The genuine order of abstract Meditation",
          "verse": "श्रद्धावीर्यस्मृतिसमाधिप्रज्ञापूर्वक इतरेषाम्",
          "translation": "śraddhāvīryasmṛtisamādhiprajñāpūrvaka itareṣām",
          "meaning": "(In the practice) of others this (meditation) is preceded by faith, energy, memory, meditation, and discernment.",
          "explanation": [
            "\"Of others\" i.e. of Yogis other than (those called) the 'unembodied\" and the 'resolved into nature.'",
            "\"preceded by Faith, & c.\" To complete the sense, we must supply the word 'Meditation.' 'Preceded by Faith, & c.,\" that is to say, the means antecedent (and conducive) to which are Faith, & c. And these, 'Faith & c.,' acting in the relation of means to an end, constitute the means (or appliances) for Meditation 'in which there is distinct recognition.'",
            "Faith defined",
            "Among these (antecedents enumerated in the Aphorism), 'Faith' (Sraddha) means a mental approval of Concentraion (as a worthy and possible aim).",
            "Energy",
            "Memory",
            "'Memory' (or 'Recollection'—Smriti) has already been explained.",
            "Meditation",
            "'Meditation' (Samadhi) means intentness on a single point.",
            "'Discernment' (Prajna) means through discrimination of that which is to be known.",
            "Reason for this order of statement",
            "Among these (antecedents, to account for the order of statement adopted in the aphorism, we may remark, that) of him who has 'Faith' there arises 'Energy,' he becomes persevering in meditation : and to one thus persevering the 'Memory' of past subjects springs up ; and his mind becomes absorbed in 'Meditation' in consequence of the recollection thereof ;  and he whose mind is absorbed in meditation arrives at a thorough 'Discernment' of the mater pondered.",
            "Such are (according to those whose practice is recorded) the means of that Meditation 'in which there is distinct recognition'. The (still higher step—the) Meditation 'in which distinct recognition is lost' is arrived at through diligent practice of this ('in which there is distinct recognition' of some object pondered), and through extreme 'Dispassion.'",
            "He next mentions the sub-divisions of Yogis, adopting the above-mentioned means, according to the difference of method adopted by them."
          ]
        },
        {
          "verse number": 21,
          "verse title": "Ascetics divisible according to their method of procedure",
          "verse": "तीव्रसंवेगानामासन्नः",
          "translation": "tīvrasaṃvegānāmāsannaḥ",
          "meaning": "The attainment of the state of abstract meditation is speedy in the case of the hotly impetuous.",
          "explanation": [
            "To complete the aphorism, the words 'The attainment of the state of abstract Meditation' require to be supplied.",
            "By 'impetuosity' (Samvega) is meant a more energetic self-reproducing impulse, which is a cause of action. Those persons in whose 'transcendent' methods this (impetuosity) is violent, are close upon the attainment of abstract meditation and the fruits of meditation ; that is to say, this is, in their case, rapidly brought about.",
            "Who are those 'hotly impetuous'? To this he replies."
          ]
        },
        {
          "verse number": 22,
          "verse title": "The nine divisions of ascetics",
          "verse": "मृदुमध्याधिमात्रत्वात् ततोऽपि विशेषः",
          "translation": "mṛdumadhyādhimātratvāt tato'pi viśeṣaḥ",
          "meaning": "Through the 'Mild', the 'Medium,' and the 'Transcendent' (Nature of the methods adopted) there is thence also a distinction (among the ascetics who adopt the methods).",
          "explanation": [
            "Through the diversity of these various methods, viz. the 'mind' & c., there is a distinction of those who employ the methods. The divisions of methods are the 'mild' (MRIDU), the 'medium' (MADHYA), and the 'transcendent' (ADHIMATRA). These are severally threefold from their being severally subdivided into the 'mildly impetuous,' the 'middlingly impetuous,' and the 'transcendently impetuous.' And in accordance with this division there are nine classes of followers of the YOGA. Thus, there is the 'mild method' (the follower of which may be) the 'mildly impetuous,' the 'middlingly impetuous,' or the 'transcendently impetuous.' Then there is the 'medium method (the follower of which may be) the 'mildly impetuous,' the 'middlingly impetuous,' or the 'transcendently impetuous.' And there is the 'transcendent method (the follower of which may be) the 'mildly impetuous,' the 'middlingly impetuous,'  or the 'transcendently impetuous.' And great endeavours ought to be made after the 'transcendent method' and after warm impetuosity (in following out the same). So much for the declaration of the distinctions (among the followers of the YOGA).",
            "By 'mildness' (as we learn from Bhavaganesa) is here meant 'smallness.' The meaning of 'middlingness' is the familiar one. By 'transcendentness' is meant the exceeding of all measure, excessiveness, in short.",
            "Now he mentions a method which differs from these methods in being an easy one."
          ]
        },
        {
          "verse number": 23,
          "verse title": "The devotional method",
          "verse": "ईश्वरप्रणिधानाद्वा",
          "translation": "īśvarapraṇidhānādvā",
          "meaning": "Or by profound devotedness towards the Lord, (the ascetic may attain to the state of abstract meditation).",
          "explanation": [
            "By \"the Lord\" (ISVARA) we mean what will be defined. By \"profound devotedness\" towards Him, we mean a kind of devoted attachment, a peculiar serving of Him, the consigning of all one's actions to Him. The person (under the influence we speak of) desiring no fruit (of his actions) in the shape of enjoyment of sense-objects, or the like, makes over all his actions to Him, the pre-eminent guide. This 'profound devotedness' is a pre-eminent means of abstract Meditation and of the attainment of its fruits.",
            "The devotional method has reference to the 'Lord'",
            "It has been just stated that abstract Meditation may be attained through profound devotedness towards THE LORD. With reference to this, he now proceeds to declare, in order, the nature, the proofs, the pre-eminence, and the name, of the Lord, the order of His worship, and the fruit thereof."
          ]
        },
        {
          "verse number": 24,
          "verse title": "The term 'Lord' defined",
          "verse": "क्लेशकर्मविपाकाशयैरपरामृष्टः पुरुषविशेष ईश्वरः",
          "translation": "kleśakarmavipākāśayairaparāmṛṣṭaḥ puruṣaviśeṣa īśvaraḥ",
          "meaning": "The Lord is a particular spirit (Purusha) untouched by troubles, works, fruits, or deserts.",
          "explanation": [
            "'Troubles,' i.e. things that distress, such as ignorance &c., which will be spoken of (in the 2nd section). 'Works' i.e. (actions involving) merit or demerit. 'Fruits' i.e. what ripen out of works, as birth, life, or whatever is experienced (by mortals as the consequences of their actions). By 'deserts' are meant those self-continuant conditions, or tendencies (leading to their inevitable consequences), which take the name of ASAYA (from the root SI 'to sleep') because they rest on the tablets of the mind until their fruit shall have ripend. (The Lord, to whom no such things are attributable, is declared to be) 'Untouched' by these—i.e. not affected by them during any of the three times, (past, present, or future).",
            "A 'particular Spirit,' i.e. one who is different from other spirits ;  such is the force of the term here rendered 'particular.'",
            "The Lord upholds all things by His mere will",
            "'The Lord' (ISVARA), i.e. (from the root SI 'to possess power) who is accustomed to rule, who is able to uphold the world by his mere will. Such is the nature of 'the Lord.'",
            "Having thus stated the nature of the Lord, he now states the proofs (that such a Being exists)."
          ]
        },
        {
          "verse number": 25,
          "verse title": "Proof that there is such a Being as the Lord",
          "verse": "तत्र निरतिशयं सार्वज्ञबीजम्",
          "translation": "tatra niratiśayaṃ sārvajñabījam",
          "meaning": "In Him does the germ of the omniscient become infinite.",
          "explanation": [
            "'In Him,' i.e. in that diving Being. The germ of omniscience is the less or more of the knowledge of the past, the future &c. This is the germ, because like a germ it is the root (of what springs from it). This (knowledge which in others is less or more) in Him, is infinite, or reaches its extreme limit. (And it is held to be a fair inference that Knowledge reaches the limit of Omniscience SOMEWHERE), for, properties that are capable of degrees, such as Parvitude and Magnitude are (in particular instances) seen to have reached their extreme limits, Parvitude, for example, in an Atom, and pre-eminent Magnitude in the Ether. So too Knowledge and the like, properties of the intellect, are seen admitting of degrees. They reach their extreme limit SOMEWHERE, and He in whom they are infinite is the Lord.",
            "Having thus declared the nature of the Lord, and the proof that such a Being exists, he next declares His pre-eminence."
          ]
        },
        {
          "verse number": 26,
          "verse title": "The pre-eminence of the Lord",
          "verse": "स पूर्वेषामपि गुरुः कालेनानवच्छेदात्",
          "translation": "sa pūrveṣāmapi guruḥ kālenānavacchedāt",
          "meaning": "He is the preceptor even of the first, for he is not limited by time.",
          "explanation": [
            "'Of the first ;'  that is to say, even of the earliest (of created beings), such as Brahma, & c. He (the Lord) is the preceptor, or instructor ;  for He is not bounded by time, since He is without beginning, and these, on the other hand, are limited by time because they had a beginning.",
            "Having thus declared the pre-eminence (of the Lord) he declares His name with a view to its employment in devotion."
          ]
        },
        {
          "verse number": 27,
          "verse title": "The mystical name of the Lord",
          "verse": "तस्य वाचकः प्रणवः",
          "translation": "tasya vācakaḥ praṇavaḥ",
          "meaning": "His name is glory",
          "explanation": [
            "'His,' i.e. of the Lord as thus defined the name, or appellation, is 'Glory' (PRANAVA) (which is the technical term employed in speaking of the mystical name) 'Om'.",
            "And of the two (i.e. of the Lord and this name) the relation, as 'denoted and denoter,' is eternal. It is conventionally declared, but not made by any one. Just in like manner as the actual relation between a father and his son is declared (and not created) by someone who says \"This is that one's father, and that is this one's son.\"",
            "He next speaks of worship."
          ]
        },
        {
          "verse number": 28,
          "verse title": "How the name of the Lord is to be used in worship",
          "verse": "तज्जपस्तदर्थभावनम्",
          "translation": "tajjapastadarthabhāvanam",
          "meaning": "Its repetition (should be made, and also) reflection on its signification.",
          "explanation": [
            "'Its'—i.e. of this mystical name, consisting of three and a half prosodial moments, the repetition, or proper pronunciation ; and reflection on, or re-iterated mental attention to, its signification—viz : the Lord, is a means of concentrating the thoughts ;  therefore it is here stated that the follower of the Yoga ought to repeat the mystical name and to reflect upon its import, with a view to the effecting of abstract Meditation.",
            "He next mentions the fruits of such worship."
          ]
        },
        {
          "verse number": 29,
          "verse title": "The Rightly Intelligent Spirit",
          "verse": "ततः प्रत्यक्चेतनाधिगमोऽप्यन्तरायाभावश्च",
          "translation": "tataḥ pratyakcetanādhigamo'pyantarāyābhāvaśca",
          "meaning": "Thence comes the knowledge of the rightly intelligent (Spirit), and the absence of obstacles.",
          "explanation": [
            "'The rightly intelligent (spirit)' i.e. the Spirit possessed of knowledge, He being an intelligence who rightly knows, i.e. who knows in an opposite, or inverse way, (as contradistinguished from mortals, whose understanding is supposed to flow out and become modified by objects. Such a process of gaining knowledge, being regarded as undesirable in the case of mortals, is not to be imagined to belong to the Lord, who is therefore said to know in some opposite way). There accrues to him (the ascetic) a knowledge, a complete apprehension, of Him.",
            "The obstacles (to the attainment of the end in view) will be mentioned. The absence of these means the exclusion of their power.",
            "Now, which are those OBSTACLES? This being a point in doubt, he proceeds to remark as follows."
          ]
        },
        {
          "verse number": 30,
          "verse title": "The obstacles of the ascetic",
          "verse": "व्याधिस्त्यानसंशयप्रमादालस्याविरति-भ्रान्तिदर्शनालब्धभूमिकत्वानवस्थितत्वानि चित्तविक्षेपास्तेऽन्तरायाः",
          "translation": "vyādhistyānasaṃśayapramādālasyāvirati- bhrāntidarśanālabdhabhūmikatvānavasthitatvāni cittavikṣepāste'ntarāyāḥ",
          "meaning": "Sickness, Languor, Doubt, Carelessness, Laziness, Addition to Objects (of Sense), Erroneous Perception, Failure to attain any stage (or Abstraction), and Instability (in the state when attained), — These distractions of the mind are obstacles (in the way of the ascetic).",
          "explanation": [
            "These nine, prevailing through the power of the passionate and dark qualities (the two which are opposed to the element of pure or good in the phenomenal world) become distractions of the mind : that is to say, the mind is distracted by these which are opposed to the mind's concentrating itself on any point.",
            "Sickness",
            "Among these, 'Sickness,' is a fever, or the like, caused by disorder of the humours.",
            "Languor",
            "'Languor' is the mind's inactivity.",
            "Doubt",
            "'Doubt' is a (sort of) notion that leans to both alternatives. As, for example, (where one hesitates) \"Is the YOGA practicable (e.g. for me the doubter), or is it not?\"",
            "Carelessness",
            "'Carelessness' is a habit of inattention,—a listlessness about the effecting of abstract meditation.",
            "Laziness",
            "'Laziness' is a heaviness of the body and mind, which causes a want of exertion in the department of abstract meditation.",
            "Addiction to objects",
            "'Addiction to objects' (AVIRATI) is a greediness consisting in attachment of the mind to objects of sense.",
            "Erroneous perception",
            "'Erroneous perception' is a mistaken notion such as the notion that the thing is silver when it is mother o'pearl.",
            "Failure to attain any stage of abstraction",
            "By 'failure to attain any stage' we mean the failing, for some reason or another, to attain to, or arrive at, the state of abstract meditation.",
            "Instability",
            "'Instability' is, even when the state of abstract meditation has been reached, the mind's not continuing steadily therein.",
            "These* are called 'obstacles' because, as they present themselves, they oppose concentration or meditation.",
            "In order to declare other obstacles also, which cause distraction of mind, he says :"
          ]
        },
        {
          "verse number": 31,
          "verse title": "Other Obstacles",
          "verse": "दुःखदौर्मनस्याङ्गमेजयत्वश्वासप्रश्वासा विक्षेपसहभुवः",
          "translation": "duḥkhadaurmanasyāṅgamejayatvaśvāsapraśvāsā vikṣepasahabhuvaḥ",
          "meaning": "Grief, Distress, Trembling, and Sighing, are accompaniments of the distractions.",
          "explanation": [
            "When, from whatever cause, distractions have arisen, then these, viz. Grief come on.",
            "Grief",
            "Among these 'Grief' is a modification of mind, resulting from (other) mental affections and characterised by annoyance, in consequence of which annoyance sentient creatures exert themselves for its removal.",
            "Distress",
            "Distress' is a tremulousness of mind, arising either from external or internal causes.",
            "Trembling",
            "'Trembling' (ANGAMEJAYATVA) is a shaking of the whole body which prevents steadiness either in prescribed postures or in mind.",
            "Sighing",
            "'Sighing' (SVASA) is an excessive entrance of air into the body. An excessive expiration of air from the body, is what is meant by PRASVASA.",
            "These, prevailing along with the distractions, are to be excluded by means of 'exercise' and 'dispassion' as aforesaid ; and therefore it is that they are mentioned here.",
            "He now mentions another method for the prevention of the obstacles together with their supervenients."
          ]
        },
        {
          "verse number": 32,
          "verse title": "Means of combating distractions",
          "verse": "तत्प्रतिषेधार्थमेकतत्त्वाभ्यासः",
          "translation": "tatpratiṣedhārthamekatattvābhyāsaḥ",
          "meaning": "For the prevention thereof let one truth be dwelt upon.",
          "explanation": [
            "For the prevention, or hindrance, of these distractions, one should dwell upon, or again and again confine the attention, to one truth — some accepted truth — by force of which, when concentration on one point has taken place, the distractions subside.",
            "He next states another method, premising some mention of purifying processes which conduce to the perfecting of the mind."
          ]
        },
        {
          "verse number": 33,
          "verse title": "Amiable habits recommended",
          "verse": "मैत्रीकरुणामुदितोपेक्षाणां सुखदुःखपुण्यापुण्यविषयाणां\nभावनातश्चित्तप्रसादनम्",
          "translation": "maitrīkaruṇāmuditopekṣāṇāṃ sukhaduḥkhapuṇyāpuṇyaviṣayāṇāṃ bhāvanātaścittaprasādanam",
          "meaning": "Through the practising of benevolence, tenderness, complacency, and disregard towards objects (i.e. persons who are respectively in possession) of happiness, grief, virtue, and vice, the mind becomes purified.",
          "explanation": [
            "'Benevolence' is good-heartedness ; 'tenderness' is compassion ; 'complacency' is sympathetic joy ; 'disregard' is indifference. He should exercise these, respectively, towards the happy, the grieved, the virtuous, and the vicious. That is to say, when people are happy, he should show benevolence, saying, \"Blessings on their joy !\", and not (show) envy. When people are grieved, he should show tenderness, saying \"By what means, verily can they be freed from their grief?\"— and not (show) a disposition to stand aloof. And when people are virtuous, he should exhibit complacency, by sympathetically rejoicing in their virtue,— and not (show) aversion by saying, \"What ! — are those forsooth virtuous?\" And in regard to the vicious he should practise simply indifference, showing neither sympathy nor aversion.",
            "In the aphorism, by the words, 'happiness,' 'grief,' & c., are denoted those to whom these belong. So, in this manner, by the purifying influences of friendliness, & c., the mind being rendered cheerful, the production of abstract meditation takes place readily.",
            "This purifying process is an external one (and not an intimate portion of the Yoga itself.) As, in arithmetic, in effecting the calculations of questions of Allegation,  &c., the operations of Addition & c., are valuable (not so much in themselves, but) as aids in effecting the important matter, so by exercising benevolence & c., which are (moods of mind) opposed to aversion and covetousness, the mind, in which composure has (thereby) been produced, becomes fitted for meditation—that 'in which there is distinct recognition of an object' & c. Covetousness and aversion are the very chief raisers of distractions :— if therefore these be radically extirpated, then, through its composure (and freedom from distraction), the mind (the more readily) becomes concentrated on one point.",
            "He mentions another expedient."
          ]
        },
        {
          "verse number": 34,
          "verse title": "Another expedient for combating distraction",
          "verse": "प्रच्छर्दनविधारणाभ्यां वा प्राणस्य",
          "translation": "pracchardanavidhāraṇābhyāṃ vā prāṇasya",
          "meaning": "(Or, He may combat distractions) by forcibly expelling and by restraining the breath.",
          "explanation": [
            "Regulation of the breath",
            "The 'expelling' of breath is the vomiting or emitting it (by a slow but complete expiration). The 'restraining' it, is the stopping it (by shutting the mouth and closing both nostrils with fingers of the right hand). And this, we mean to say, takes place after inhalation (though mentioned in the aphorism as if immediately following expiration), because, after expelling the breath, it is impossible to restrain it without (having made a previous) inhalation. Thus, then, the regulation of the breath (pranayama), being of three descriptions according to the distinction of 'expiration' (RECHAKA), 'inspiration' (PURAKA), and 'restraining' (KUMBHAKA), causes steadiness of the mind, and its concentration in a single direction.",
            "He states another means of steadiness."
          ]
        },
        {
          "verse number": 35,
          "verse title": "Another expedient",
          "verse": "विषयवती वा प्रवृत्तिरुत्पन्ना मनसः स्थितिनिबन्धिनी",
          "translation": "viṣayavatī vā pravṛttirutpannā manasaḥ sthitinibandhinī",
          "meaning": "Or a sensuous immediate cognition, being produced, may serve as a cause of the steadiness (of the mind).",
          "explanation": [
            "To complete the sentence, we must supply 'of the mind.'",
            "Objects of sense are ordour, savour, colour, touch, and sound. Wherever these exist as fruits, that case of perception, or especially immediate cognition, is sensuous : and this, when it is excited, causes fixation of the mind.",
            "Mystical sense-perception",
            "To explain : in the case of him who fixes his mind on the tip of his nose, there arises a perception of celestial odour. (If he fix his mind) on the tip of the tongue, in like manner, there is a perception of savour ; on the fore-part of the palate, a perception of colour ; on the middle of the tongue, a perception of the touch ; on the root of the tongue, a perception of the sound. Thus, then, through this or that organ, the perception arising of this or that celestial sense-object becomes a cause of the mind's concentration in one direction.",
            "He mentions another expedient of the like description."
          ]
        },
        {
          "verse number": 36,
          "verse title": "Another expedien",
          "verse": "विशोका वा ज्योतिष्मती",
          "translation": "viśokā vā jyotiṣmatī",
          "meaning": "Or a luminous (immediate cognition, being produced) free from sorrow (may serve as a cause of the steadiness of the mind).",
          "explanation": [
            "To complete the aphorism, we must supply 'an immediate cognition, being produced, may serve as a cause of the steadiness of the mind.'",
            "Here, by the word 'lumen' (JYOTIS) is meant the light that consists of the Pure element (out of the three elementary qualities that constitute the phenomenal). A luminous immediate cognition is that in which this (Pure element) is excellent, abundant, exceeding.",
            "'Free from sorrow,'— that is to say, that cause of the steadiness of the mind in respect of which (agency) all sorrow, which is a modification of the Passionate (or foul element of the phenomenal universe), is removed by virtue of the exercise of the 'beatific' (degree of meditation where the ascetic, not yet liberated from the phenomenal, is nearly freed from the two coarser of its three chains.)",
            "Dwelling on the inner light of the heart",
            "The meaning is this, that on the disappearance of all modifications through the beholding of perfect knowledge, steadiness takes place in the mind of him who, in the midst of the lotus-cup of his heart, broods on the Pure element of thought (spread out in the heart) like the milky ocean when its waves are stilled.",
            "By means of exhibiting another expedient, he declares an object (worthy of being meditated) in the meditation 'in which there is distinct recognition of an object'."
          ]
        },
        {
          "verse number": 37,
          "verse title": "Dwelling on admirable examples",
          "verse": "वीतरागविषयं वा चित्तम्",
          "translation": "vītarāgaviṣayaṃ vā cittam",
          "meaning": "Or the thought, taking as its object someone devoid of passion, (may find what will serve as a cause of the steadiness of the mind).",
          "explanation": [
            "To complete the aphorism we must supply 'may (find what will) serve as a cause of the steadiness of the mind.'",
            "'Devoid of passion', i.e., who has abandoned all desire for objects of sense, like Sanaka and others. (The mind, we repeat, may be steadied by the expedients previously mentioned,) or the thoughts of the Yogi, directed to this (i.e. to one devoid of passion of Sanaka was), becomes fixed ; that is to say, the unimpassioned thought becomes more firmly steady through reflecting on one whose thoughts are devoid of passion.",
            "He mentions another expedient of this description."
          ]
        },
        {
          "verse number": 38,
          "verse title": "Recourse had to dreaming and sleeping",
          "verse": "स्वप्ननिद्राज्ञानालम्बनं वा",
          "translation": "svapnanidrājñānālambanaṃ vā",
          "meaning": "Or the dwelling on knowledge (that presents itself) in dream, or in sleep, (may serve as a cause of the steadiness of the mind)",
          "explanation": [
            "Dreaming defined",
            "'Dream' is that wherein the soul is affected through the mind alone, when modifications of the external organs of sense have departed.",
            "'Sleep' has already been defined.",
            "(We say, then, that) knowledge dependent on dream, or dependent on sleep, when dwelt upon, causes steadiness of mind, (there being in either case nothing to distract the attention.)",
            "Since (different) men have different tastes, on whatever thing the Yogi places his faith by meditating on that same thing he may attain what he wants (viz. steadiness of mind) : In order to declare this, he states as follows."
          ]
        },
        {
          "verse number": 39,
          "verse title": "Anything you please may be dwelt upon to steady the mind",
          "verse": "यथाभिमतध्यानाद्वा",
          "translation": "yathābhimatadhyānādvā",
          "meaning": "Or (the steadying of the mind may be effected) by pondering anything that one approves.",
          "explanation": [
            "(That is to say) the mind becomes steadied when any object that one prefers is pondered, whether external, as the Moon or the like, or internal, as a congeries of arteries or the like.",
            "The fruit of meditation",
            "Having, thus exhibited the means (of accomplishing meditation), in order to exhibit the fruits, he proceeds to remark."
          ]
        },
        {
          "verse number": 40,
          "verse title": "To apprehend the infinitely small or great",
          "verse": "परमाणु परममहत्त्वान्तोऽस्य वशीकारः",
          "translation": "paramāṇu paramamahattvānto'sya vaśīkāraḥ",
          "meaning": "His mastery extends to the atomic and to the infinite",
          "explanation": [
            "The ascetic, effecting, by these methods, steadiness of mind, obtains, through meditation on subtile objects, unresisted mastery as far as the Atom ; that is to say, his mind, in (dealing with) subtile objects, even as far as the Atoms (which elude the cognizance of ordinary perspicacity), is nowhere baffled. In like manner no mental obstacle arises anywhere to him meditating the gross, even to the extent of infinite magnitude, as the Ether, for example ; but everywhere he is uncontrolled, such is the meaning.",
            "Of the mind thus by these methods rectified, what is the aspect (or actual condition) ? To this he replies."
          ]
        },
        {
          "verse number": 41,
          "verse title": "The state of the mind properly intent on a single object",
          "verse": "क्षीणवृत्तेरभिजातस्येव मणेर्ग्रहीतृग्रहणग्राह्येषु\nतत्स्थतदञ्जनता समापत्तिः",
          "translation": "kṣīṇavṛtterabhijātasyeva maṇergrahītṛgrahaṇagrāhyeṣu tatsthatadañjanatā samāpattiḥ",
          "meaning": "To that (Mind whose 'modifications' all sae that there remains someone object of meditation) have disappeared, there occurs, as (occurs) to a noble gem (e.g. rock-crystal, when brought into conjunction with a coloured substance), when intent on any one out of these —viz.—the perceiver, the perception, and the perceivable, a tinging thereby.",
          "explanation": [
            "That is to say — to that (mind) whose 'modifications' have disappeared, which has repelled all modifications except that which has to be pondered, which has accomplished that concentration 'in which there is distinct recognition' (of a single object to the exclusion of all others.)",
            "'Out of (the three viz.) the perceiver, the perception, and the perceivable', i.e. Soul, the organs of sense, and the (five) elements.",
            "'To it (the thought) intent on anyone (of these) there occurs a 'tinging thereby.' By 'being intent thereon' we mean attending to that alone. 'A tinging thereby,' i.e. the (thought's) coming to consist thereof (by taking the colour or character of the object as its own); — the coming to be of the same description ;  that is to say, it (the thought) becomes modified into the aspect of that (which is thought upon).",
            "He mentions an illustration. To the noble i.e. pure (transparent and colourless) gem, such a gem as rock-crystal or the like, there occurs this or that colour in consequence of its being the receptacle of this or that colour, (as when the red or other colour of flowers has place within a crystal vase). In like manner, to the stainless pure element of thought there occurs the hue of this or that, through the adjacent hue of this or that thing which is meditated upon.",
            "'The perceived, the perception, and the perceiver'—such is the inverse order in which these are to be understood (instead of the order adopted in the aphorism), because it is on 'the perceived' (the external or objective) that meditation is first fixed.",
            "He now states (in three aphorisms) a fourfold division of the abovementioned change (of the mind into the likeness of what it ponders)."
          ]
        },
        {
          "verse number": 42,
          "verse title": "The first state of the mind properly intent",
          "verse": "तत्र शब्दार्थज्ञानविकल्पैः संकीर्णा सवितर्का समापत्तिः",
          "translation": "tatra śabdārthajñānavikalpaiḥ saṃkīrṇā savitarkā samāpattiḥ",
          "meaning": "This (change of the mind into the likeness of what is pondered,) when mixed up of the fancy of the 'word' the 'meaning,' and the 'knowledge,' is (technically termed) the 'argumentative.'",
          "explanation": [
            "A 'Word,' is what is apprehended by the organ of hearing, or (in the technical language of the grammarians) a manifestation (SPHOTA).",
            "The 'Meaning' i.e. the thing meant by a sound or word is a genus (such as 'cow,' 'horse,') &c.",
            "'Knowledge,' is a modification of the understanding where the quality of Purity prevails (to the suppression of the elements of Passion and Darkness).",
            "a 'Fancy' has been already defined.",
            "'Mixed up of these'—i.e. in which the three—viz. the 'Word,' &c., by mutually commingling, appear in an (ambigous and) fanciful shape, in the shape (at once) of the WORD 'cow,' (for example), the THING 'COW,' and the NOTION 'COW,' this is what is called (technically) 'the argumentative' (SAVITARKA) change (of the mind reflecting a mixed object of thought—while the attention is divided among the sound, the thing signified, and the knowledge of the thing.)",
            "He now mentions that non-argumentative' (affection of the mind) which is the opposite of the one just defined."
          ]
        },
        {
          "verse number": 43,
          "verse title": "The second stage of the mind properly intent",
          "verse": "स्मृतिपरिशुद्धौ स्वरूपशून्येवार्थमात्रनिर्भासा निर्वितर्का",
          "translation": "smṛtipariśuddhau svarūpaśūnyevārthamātranirbhāsā nirvitarkā",
          "meaning": "On the clearing off the memory (of the word and the sense attached to it by convetion), the (mental) display only of the thing itself as if of something indefinite (and no longer referred to any term — No longer regarded as being what is meant by the word 'cow,' or what is meant by the word 'horse,' etc.), this (affection of the mind which no longer reflects a mixed object of thought) is that which is called (technically the 'non-argumentative.'",
          "explanation": [
            "'Of the memory' i.e. of the memory of the convention as to the sense of the word. 'The clearing off' i.e. the departure when this takes place, the change (of the mind) when it reveals the thing itself alone, as if devoid of any character (which would suggest a term as applicable to it) when it (the mind in its changed state) is employed about the object to be pondered alone (without regard to its having any name,) and thus clear of 'fancy' (nothing being pondered but the actual thing itself), is what is called the 'non-argumentative' (affection of the mind); such is the meaning.",
            "In order to declare another division, he says :"
          ]
        },
        {
          "verse number": 44,
          "verse title": "The third and fourth stages of the mind properly intent",
          "verse": "एतयैव सविचारा निर्विचारा च सूक्ष्मविषया व्याख्याता",
          "translation": "etayaiva savicārā nirvicārā ca sūkṣmaviṣayā vyākhyātā",
          "meaning": "Just by this that which is (technically termed) 'deliberative' (SA-VICHARA), and (that termed) 'non-deliberative' (NIR-VICHARA), where the object (pondered, instead of being gross as in these two preceding cases) is 'subtile,' has been (sufficiently) explained; (the distinction between this pair, out of the four referred to at section 41F., being the same as that between the C, her pair.)",
          "explanation": [
            "Just by this mental affection, in the shape of the 'argumentative' and the non-argumentative, where the object is a 'gross' one (as contradistinguished from the 'subtile' objects) the pair of mental affections also, in the shape of the 'deliberative' and the 'non'deliberative,' where the object is 'subtile,' has been explained.",
            "What sort (of mental affection) is that where the object is SUBTILE? That (mental affection) is so called, the object whereof, such as the 'subtile elements' or the 'organs' is subtile. By this (mention that the object, in the case of the latter pair, as 'subtile') it is declared that in the former (pair) the object is 'gross,' for (in truth) it is on the gross elements that it (the  former pair) is dependent. That is (called) the 'deliberative' in which the 'subtile object' appears whether as the object of a question as to the name, the meaning, and the notion or apart from any such question, but yet as qualified by the characters of space and time, &c. That (on the other hand) is (called) the non-deliberative in which the 'subtile object,' in the shape of the Subtile Elements or the Organs, independently of the properties of space and time, &c., is presented simply as the thing itself. It is of this (pair of mental modifications) alone that the objects are 'subtile' (and not of the other pair).",
            "In reply to the question how far (the term) 'where the object is subtile' (extends), he says :"
          ]
        },
        {
          "verse number": 45,
          "verse title": "The limits of analysis",
          "verse": "सूक्ष्मविषयत्वं चालिङ्गपर्यवसानम्",
          "translation": "sūkṣmaviṣayatvaṃ cāliṅgaparyavasānam",
          "meaning": "And 'The having a subtile object' ends with the indissoluble.",
          "explanation": [
            "This fact that has been mentioned of the 'deliberative' and the 'non-deliberative' mental affections that their object is a 'subtile one ends with the Indissoluble, meaning, by the 'Indissoluble,' Nature, (that primordial principle) which is nowhere resolved (into anything underlying it), or which (to take another etymological explanation) declares or suggests nothing. It is at this point that 'the having a subtile object' ceases (seeing that, beyond this, there exists nothing more subtile lying further back.)",
            "To explain : in the modification of the Qualities there arise four divisions (1) that which has a diversified character, (2) that which has an undiversified character, (3) that which merely has a character, and (4) that which has not a character, (By) 'that which has a diversified character' (VISISHTA-LINGA) (is meant) the (gross) elements,' (By) 'that which has an undiversified character' (AVISISHTA-LINGA) is meant the subtile elements and the organs. (By) 'that which merely has a character, (LINGA-MATRA) is meant Intellect. (By) 'that which has not a characteristic attribute'  (ALINGA) is meant the First Principle beyond which there is nothing subtile (underlying or originating it.)",
            "He next mentions, as the topic presents itself, the motive for (valuing) these mental affections (or tingers.)"
          ]
        },
        {
          "verse number": 46,
          "verse title": "What the aforesaid mental affections constitute",
          "verse": "ता एव सबीजः समाधिः",
          "translation": "tā eva sabījaḥ samādhiḥ",
          "meaning": "These themselves constitute 'Meditation with its seed'.",
          "explanation": [
            "'These themselves,' i.e. the mental affections above described. Meditation 'in which there is distinct recognition, is called (meditation) 'with its seed', i.e. that which is with a seed or with something to rest upon, because all these (varieties of mental affection which we have been treating of) have something to rest upon (which, must evetually be deserted).",
            "Now he states the fruit of the 'non-deliberative' (mental affection), seeing that, of the other mental affections, this 'non-deliberative' one is the fruit."
          ]
        },
        {
          "verse number": 47,
          "verse title": "The fruit of this",
          "verse": "निर्विचारवैशारद्येऽध्यात्मप्रसादः",
          "translation": "nirvicāravaiśāradye'dhyātmaprasādaḥ",
          "meaning": "When wisdom has come, through the 'non-deliberative' (mental affection), there is spiritual clearness.",
          "explanation": [
            "What we mean by 'non-deliberative' has been already explained.",
            "'Wisdom'  here stands for purity",
            "In comparison with the ('argumentative' mental affection), when the object is a gross one, the 'non-argumentative' is the superior. In respect of that too the 'deliberative,' whose object is a subtile one, (is the superior). In respect of this again the 'non-deliberative' (where the object is subtile, is the superior). And when, in virtue of pre-eminent practice of this there has arisen wisdom, or purity, then there is spiritual clearness. By 'spiritual' we mean what resides in the soul, or in the understanding. Such clearness (viz., spiritual clearness) arises (from the 'non-deliberative' mental affection with a subtile object). And it is just this spiritual clearness which we mean by the firm steadfastness (attained on the removal of distractions.)",
            "(Well), this having been attained, what next? To this he replies."
          ]
        },
        {
          "verse number": 48,
          "verse title": "From spiritual clearness comes right knowledge",
          "verse": "ऋतम्भरा तत्र प्रज्ञा",
          "translation": "ṛtambharā tatra prajñā",
          "meaning": "In that case there is knowledge which holds to the truth",
          "explanation": [
            "By 'knowledge which holds to the truth' we mean that knowledge which is never overshadowed by error, which holds to the truth, i.e. to the real.",
            "'In that case' — i.e. when SPIRITUAL CLEARNESS has been attained, this (true knowledge) takes place.",
            "And, through this rightly intelligent view, regarding everything as it really is, the YOGI attains to pre-eminent Concentration.",
            "He now states the distinction of this from other (forms of) correct knowledge."
          ]
        },
        {
          "verse number": 49,
          "verse title": "This knowledge differs from ordinary knowledge",
          "verse": "श्रुतानुमानप्रज्ञाभ्यामन्यविषया विशेषार्थत्वात्",
          "translation": "śrutānumānaprajñābhyāmanyaviṣayā viśeṣārthatvāt",
          "meaning": "(This kind of knowledge differs) From the knowledge due to testimony and inference because the object of these two is not particulars but generals.",
          "explanation": [
            "By 'testimony' we mean scriptural information. By 'inference' we mean what has been already defined. The knowledge which arises from these two (sources of knowledge) has generals (and not individuals) as its object; for, neither testimony nor a (logical) sign (TEKUNPIOV) is able, like a sense-organ, to convey a knowledge of particularities (meaning thereby the ultimate and no further explicable distinctions that exist between individuals generically similar and numerically different.",
            "On the other hand this meditative knowledge, that associated with the clearness which comes through the 'non-deliberative' (mental affection) differs from these two kinds of knowledge, in its having individualities as its object; that is to say, (it differs from them) because its object is the individual 'subtile element' or the individual Soul itself. (And so this knowledge, since its object is the particular, has an object other than that which belongs to testimony or inference.)",
            "Moreover, when this has been attained, one can discern with one's ordinary organs even minute things, hidden or very far off.",
            "He states the (especial) fruit of this correct knowledge."
          ]
        },
        {
          "verse number": 50,
          "verse title": "One train of thought with one object, is to put an end to all other trains",
          "verse": "तज्जः संस्कारोऽन्यसंस्कारप्रतिबन्धी",
          "translation": "tajjaḥ saṃskāro'nyasaṃskārapratibandhī",
          "meaning": "The train (of self-reproductive thought) resulting from this puts a stop to other trains.",
          "explanation": [
            "The (self-reproductive) continuous flow (of thought) produced by this (meditative) knowledge prevents other trains, whether they arise during relaxation or concentration ;  is to say, it makes them incapable of producing their effects. It is for this reason that it is directed that one should addict himself to this kind of knowledge alone.",
            "Having thus described Meditation where there is distinct recognition (of an object), in order to declare that in which the distinct recognition is dropped, he says :"
          ]
        },
        {
          "verse number": 51,
          "verse title": "Finally this last train of thought is to drop its object",
          "verse": "तस्यापि निरोधे सर्वनिरोधान्निर्बीजः समाधिः",
          "translation": "tasyāpi nirodhe sarvanirodhānnirbījaḥ samādhiḥ",
          "meaning": "On the removal of this also, since there is removal of all (the mental modifications), the meditation is 'without a seed.'",
          "explanation": [
            "On the removal, i.e. on the dissolution, of this, also, i.e. of the meditation where there is distinct recognition of an object when all the modifications of the mind have been resolved into their causes (or sources, as a jar, when broken, is resolved into the earth which it was made of) so that there arises merely a continuous trains (of thought self-reproductive), thereupon, as there is nothing but the negation 'This is not' 'This is not', meditation appears with relinquishment of the seed; on which taking place, the Soul is said to abide in its own nature, pure, alone, emancipated.",
            "Recapitulation",
            "Well then (to recapitulate briefly), having set forth the definition of Concentration' which is the subject of the work the explanation of the terms 'Modification of the mind' and the 'Prevention thereof the definition of 'Exercise and 'Dispassion' and having thus stated the nature of and the difference between these two expedients ;  then having stated the division of Concentration, into principal and secondary, by distinguishing it as 'Meditation in which there is distinct recognition, (and that 'in which distinct recognition is lost,) then having exhibited diffusively the expedients (for attaining to concentration), after premising an exposure of the 'Spurious semblance of concentration,' then, with a view to exhibiting an EASY method, having determined the nature of the Lord, the proof of His existence, His pre-eminence, His name, the order of His worship and the fruits thereof; then having described the distractions of the mind and their supervenients, grief &c., and diffusively, the means of combating these, viz. the dwelling upon someone truth, the practice of benevolence &c., the regulation of the breath, and other such means, viz. 'sensuous immediate cognitions' &c., as are conducive to Meditation with or without distinct recognition of an object; having declared the mental affections, with an eye to the winding up, with their definition, their fruits, and their objects, then by finally summing up, in regard to the Meditation with distinct recognition and that without distinct recognition of an object in words to the effect that Meditation without a seed is preceded by that which has a seed, the chapter on Concentration has been expounded (by Patanjali.)",
            "Thus is completed the First Book—that on Meditation. of the commentary, composed by the illustrious great kind and governor King Bhojaraja, on the Aphorisms of Patanjali's System of the Yoga.",
            "Remarks",
            "The commentator, it will be observed, justifies Patanjali's undertaking to expound the YOGA, by citing a passage from the Veda, recommendatory of the YOGA. the YOGA therefore, under the name, was recognised antecedently to Patanjali, and is not to be regarded as an invention of his.",
            "The term YOGA, we are told, implies the hindering of the modifications of the thinking principle. all the six Hindu systems agree in regarding the distinction between Subject and Object as the most momentous of facts, and the emancipation of the former from all entanglement with the latter as the one desirable end. In their treatment of the Objective the systems differ, at least in appearance, more widely than in their treatment of the Subjective. The Vedanta denies reality—or most grudgingly allows anything of reality—to the Objective. The Nyaya accords to it a reality co-ordinate with that of the Subject, giving impartially the name of Substance to both. The Sankhya steers a middle course between these two. It treats the Objective as an aggregate of QUALITIES, which exist as SUCH but not as substances. In this respect, the Sankhya comes even nearer than the Vedanta to Bishop Berkeley. Yoga, as far as we have seen, concurs with the Sankhya on this point. While the systems thus. differ in regard to the Objective or Material, they all agree, on the other hand, regarding the Subject (ATMAN), call it Soul, or Spirit. as a self-dependant reality. The only dispute here is, whether Soul, or Spirit. is one or manifold. The Vedanta holds that it is one ; the other systems, so far as we have yet seen, that it is manifold. It is to be observed that nowhere in any of the systems does the notion of a CREATED Spirit present itself. The Vedanta, availing itself of a sufficiently loose analogy, speaks of one Soul pervading all bodies as one thread might pervade a necklace of golden, silver, and earthen, beads ; while the Sankhya urges the objection that if Soul were but one, then all would be happy when one is happy, all would die, when one died, and so on, which is contrary to experience. But. whether Soul be one or manifold, every one of the systems holds it to be self-dependant. Soul is the substance, beneath which there stands nothing ; and the pity, in the estimation of Hindu philosophy, is, that anything should stand ABOVE it, any more than beneath it. It ought to stand alone, apart from everything phenomenal.",
            "In order to repel the transient or phenomenal, according to the YOGA, we must have recourse to exercise and dispassion, or asceticism and mortification.",
            "By means of ascetic exercises and the mortification of all desires, the mind is supposed to attain to a state of undisturbed Meditation,180 where some one single object is pondered, to the exclusion of all others. But as the practised swimmer parts with his last -cork or bladder, so the soul of the ascetic must in due course part with every object, and atlen8th meditate without any object at all. To effect this being a manner of difficulty, devotion to THE LORD, is recommended as a comparatively easy method. In admitting the existence of a Divine Being (ISVARA) in whom the good qualities belonging to man leach their limit, the Yoga, hence named the SESVARA SANKHYA differs from the Sankhya of Kapila, which is known as the NIRISVARA.",
            "As the ascetic is exposed to obstacles, these are discussed by Patanjali, and means for combating them are indicated.",
            "When all obstacles have been thus removed, the mind is supposed to be as free from all contamination of the phenomenal as the Pure crystal is free from the red colour which SEEMS to belong to it while a rose is seen athwart it."
          ]
        }
      ]
    },
    {
      "chapter 2": [
        {
          "verse number": 1,
          "verse title": "Practices Conductive to Concentration",
          "verse": "तपःस्वाध्यायेश्वरप्रणिधानानि क्रियायोगः",
          "translation": "tapaḥsvādhyāyeśvarapraṇidhānāni kriyāyogaḥ",
          "meaning": "The practical (part of) concentration is mortification (Tapas), muttering (Svadhyaya), and resignation (Pramdhana) to the Lord.",
          "explanation": [
            "The penances and fastings enjoined in another institute (viz. DHARMA-SASTRA), are what are meant by 'mortification.' 'Muttering' is the muttered repitition of formula; preceded by the mystic name of the deity.' 'Resignation to the Lord' is the consigning to Him, the Supremely Venerable, without regard to fruit, all one's works. These are what are called the practical (part of) Concentration (KRIYA-YOGA).",
            "For what purpose is this ? He replies :"
          ]
        },
        {
          "verse number": 2,
          "verse title": "The purpose of such practices",
          "verse": "समाधिभावनार्थः क्लेशतनूकरणार्थश्च",
          "translation": "samādhibhāvanārthaḥ kleśatanūkaraṇārthaśca",
          "meaning": "It is for the purpose of establishing meditation, And for The purpose of extenuating afflictions.",
          "explanation": [
            "The 'afflictions' (KLESA) will be mentioned.' The 'extenuating' of them, is the opposing their producing their effects. 'Meditation' is what has been already defined.' The 'establishing' of it, is the repeatedly taking into one's thoughts (the thing to be meditated upon). That the purpose, or motive, of which is this, is what is so called (i.e. is what is spoken of in the aphorism).",
            "That is to say, these, viz., penance, &c., being practised, rendering inert the 'Ignorance' and the other amictions4 that assail the mind, sustain the part of subservients to Meditation. Therefore it is to the practical (part of) Concentration that the YOGI should first direct his attention.",
            "'For the purpose of extenuating affliction,' this has been stated what are here meant by afflictions? He replies."
          ]
        },
        {
          "verse number": 3,
          "verse title": "Afflictions to be alleviated by such practices",
          "verse": "अविद्यास्मितारागद्वेषाभिनिवेशाः क्लेशाः",
          "translation": "avidyāsmitārāgadveṣābhiniveśāḥ kleśāḥ",
          "meaning": "The afflictions are ignorance, egotism, desire, aversion, and tenacity (of mundane existence",
          "explanation": [
            "And the 'afflictions,' Ignorance and the rest, the definitions  of which will be stated (in the sequel), are five ; and these,  giving rise to distress, the characteristic of which is its being obstructive (to what we miserable mortals wish), are called 'afflictions,' because they, operating in the mind, consolidate that modification of the (three) Qualities which is recognised as mundane existence (the state of existence which it is the aim of the Yogi to eschew.)",
            "Although these are all equal in respect of being afflictions, yet, in order to declare that 'Ignorance' (AVIDYA), from its being the root, is the principal one, he says."
          ]
        },
        {
          "verse number": 4,
          "verse title": "The source of the afflictions",
          "verse": "अविद्या क्षेत्रमुत्तरेषां प्रसुप्ततनुविच्छिन्नोदाराणाम्",
          "translation": "avidyā kṣetramuttareṣāṃ prasuptatanuvicchinnodārāṇām",
          "meaning": "Ignorance is the field of the others, whether they be Dormant, extenuated, intercepted, or simple.",
          "explanation": [
            "'Ignorance' means delusion ; the notion, in short, that what is NOT Soul IS Soul. This is the 'field,' the place of origin, of the others, viz., 'Egotism,' &c., which are severally fourfold through the division into 'dormant,' &c. Therefore where Ignorance, in the shape of a mistaken notion (that what is not soul is soul), becomes inoperative, there the springing up of the  'afflictions' is not seen ; but, since, where this mistaken notion really exists, they ARE seen spring up, it is quite settled that it is Ignorance that is the source.",
            "'The dormant, extenuated, intercepted, and simple:' among these, those 'afflictions' are called 'dormant,' which, deposited in the site of the mind, do not give rise to their effects for want of something to wake them up, as in the state of childhood ; for the child's 'afflictions,' though present in the shape of mental deposits, are not developed for want of something to assist in awakening them.",
            "Those (afflictions)  are the 'extenuated,' which through one's meditating something that is opposed to each severally, their power of producing their effect having been rendered inert, abiding in the mind as a species of mental deposit, are incapable of giving rise to their effects without an ample apparatus (of auxiliaries) ; for example (such are the 'afflictions') of the ascetic YOGI.",
            "Those ('afflictions') are the 'intercepted,' which abide with their power overpowered by some strong 'affliction,' as desire (is overpowered and 'intercepted') when there is the condition of aversion, or aversion when there is the condition of (an overpowering) desire ; for those two, mutually opposite, cannot simultaneously coexist.",
            "Those ('afflictions') are the 'simple,' which operate their several effects when the things with which they co-operate are beside them ; (such are,) for example, the things adverse to Concentration at all times during the state of non-abstraction.",
            "'Ignorance,' though standing moreover as the ROOT of these four kinds (of 'afflictions') severally, is recognised as (also) ATTENDING them ; for nowhere is there found the nature of 'afflictions' having the character of being irrespective of the attendance of error ; and when that, being a falsity, is removed, by right knowledge, these ('afflictions') like burnt seeds, never spring up again ; hence it is ascertained that Ignorance is their cause and Ignorance is their attendant. Therefore they all partake of the name of Ignorance ; and, since all the 'afflictions' cause distraction of mind, the YOGI must cut these off at the very outset.",
            "He defines 'Ignorance.'"
          ]
        },
        {
          "verse number": 5,
          "verse title": "Ignorance defined",
          "verse": "अनित्याशुचिदुःखानात्मसु नित्यशुचिसुखात्मख्यातिरविद्या",
          "translation": "anityāśuciduḥkhānātmasu nityaśucisukhātmakhyātiravidyā",
          "meaning": "Ignorance (avidya) is the notion that the uneternal, the impure, evil, and what is not soul, are (severally) Eternal, pure, joy, and soul.",
          "explanation": [
            "The definition of ignorance, in general, is this, that Ignorance is the notion that what is NOT this is this. The declaration of the varieties of that same (is made in the aphorism). The notion that there is eternalness in things uneternal, such as water-jars, is called 'Ignorance!. So too the notion that things impure, such as the body, are pure ; and the notion that objects which are evils are joy ; and the notion that the body, which is not the soul, is the soul, (as when a bumpkin fancies that his eye SEES, or a phrenologist that his brain THINKS). This explains the mistake of vice for virtue, and of the useless for the useful.",
            "In order to define 'Egotism,' he says :"
          ]
        },
        {
          "verse number": 6,
          "verse title": "'Egotism' defined",
          "verse": "दृग्दर्शनशक्त्योरेकात्मतेवास्मिता",
          "translation": "dṛgdarśanaśaktyorekātmatevāsmitā",
          "meaning": "Egotism (Asmita) is the identifying of the power that  sees with the power of seeing.",
          "explanation": [
            "The 'power that sees' is Soul. The 'power of seeing' is a modification of the Quality of 'Purity'', unobstructed by 'Passion' and 'Darkness,' in the shape of the internal organ (or Mind). What is called 'Egotism' is the notion that these two things, entirely different as being the experienced and the experiencer, the unintelligent and the NOT unintelligent,—are one and the same. For example,—Nature, though really neither agent nor experiencer, fancies, \"I am agent, I am experiencer \" this blunder is the 'affliction' called 'Egotism'.",
            "He states the definition of 'Desire' (RAGA)."
          ]
        },
        {
          "verse number": 7,
          "verse title": "Desire defined",
          "verse": "सुखानुशयी रागः",
          "translation": "sukhānuśayī rāgaḥ",
          "meaning": "Desire is what dwells on pleasure.",
          "explanation": [
            "'Dwells on pleasure', i.e. reposes on (or is the affection of the mind when the thought rests on) joy. This 'affliction,' named 'Desire,' is a longing, in the shape of a thirst, for the means of enjoyment, preceded by (or, in other words, consequent on) the remembrance of enjoyment, on the part of him who has known joy",
            "He states the definition of 'Aversion' (DVESHA)."
          ]
        },
        {
          "verse number": 8,
          "verse title": "Aversion defined",
          "verse": "दुःखानुशयी द्वेषः",
          "translation": "duḥkhānuśayī dveṣaḥ",
          "meaning": "Aversion is what dwells on pain.",
          "explanation": [
            "'Pain' is what has been already defined.' Of him who has known it, disliking what things occasion it, in consequence of his remembrance of it, the feeling of disapproval is the 'affliction' called 'aversion.'",
            "He states what is 'tenacity of life', (ABHINIVESA)."
          ]
        },
        {
          "verse number": 9,
          "verse title": "The clinging to mundane existence",
          "verse": "स्वरसवाही विदुषोऽपि तथारूढोऽभिनिवेशः",
          "translation": "svarasavāhī viduṣo'pi tathārūḍho'bhiniveśaḥ",
          "meaning": "Continuant through its self-reproductive property, even on the part of the wise, attachment to the body is 'tenacity of life'.",
          "explanation": [
            "Continuant 'through its self-reproductive property ;' that is to say, it flows on by reason of its own nature, just by reason of its being self-continuant. The 'affliction' called 'tenacity of life' is what prevails in the case of everyone, from the worm up to Brahma, without any concomitant cause (in addition to its own self-continuant property), in the shape of the constant clinging (which expresses itself in such terms as), \"May I not be separated from the body and things sensible, &c.\" —this springing up in the shape of dread, through the force of the impression from the experience of the pain of a death that took place in a previous life.",
            "Since thus, then, non-abstraction is made up of the 'afflictions,' the 'afflictions' are at the outset to be removed by the practice of intentness on a single point ; such is the import.",
            "And not without their being known can these be removed ; therefore having, with a view to the knowledge of them, declared their name, source, division, and characteristic, he now states the division of the methods for the removal of these bipartitely gross and subtile."
          ]
        },
        {
          "verse number": 10,
          "verse title": "How to Evade Subtile 'afflictions'",
          "verse": "ते प्रतिप्रसवहेयाः सूक्ष्माः",
          "translation": "te pratiprasavaheyāḥ sūkṣmāḥ",
          "meaning": "These, when subtile, are to be evaded by an antagonistic production.",
          "explanation": [
            "These subtile 'afflictions,' which, abiding in the form of mental deposits, do not occasion any change, in the shape of a 'modification',8 stored in the mind, like Locke's 'ideas' while not objects of attention, these are 'to be evaded,' to be avoided, 'by an antagonistic production,' by an alteration adverse to them. When the understanding, with its deposits, having done its work, lapses into its cause, viz., egotism, then how should these ('afflictions,') being deprived of their root, possibly continue ?",
            "He now mentions the method for the removal of the 'gross' ones."
          ]
        },
        {
          "verse number": 11,
          "verse title": "How to get rid of the gross 'afflictions'",
          "verse": "ध्यानहेयास्तद्वृत्तयः",
          "translation": "dhyānaheyāstadvṛttayaḥ",
          "meaning": "Their 'modifications' (when the ,afflictions' modify the mind by pressing themselves upon the attention) are to be got rid of by meditation.",
          "explanation": [
            "The 'modifications' in the shape of pleasure, pain, of indifference, which consist of these 'afflictions' that have set in operation their effects, 'THESE are 'to be got rid of,' to be quitted, by means of meditation, i.e., by intentness of the mind on a single point ; such is the meaning.",
            "These 'from their being gross,' can be removed by the mere practice of what purifies the mind,' as the coarse gross dirt on clothes and the like is removed by mere washing ; but that subtile (impurity) which is in them can be removed only by such (more recondite) expedients as bleaching, &c.",
            "Having thus mentioned what the 'afflictions' are he remarks as follows, with the view of mentioning the stock of works (that stands at each man's credit or discredit)"
          ]
        },
        {
          "verse number": 12,
          "verse title": "Ones merits and demerits",
          "verse": "क्लेशमूलः कर्माशयो दृष्टादृष्टजन्मवेदनीयः",
          "translation": "kleśamūlaḥ karmāśayo dṛṣṭādṛṣṭajanmavedanīyaḥ",
          "meaning": "The stock of works, whose root is the afflictions; is what is to be had fruition of in this visible state, or in that unseen.",
          "explanation": [
            "By 'the stock of works' the nature of this (that he is speaking of) is set forth, for works exist only in the shape of mental deposits.",
            "By 'whose root is the afflictions' the CAUSE is set forth, since the 'afflictions' alone are the cause of acts.",
            "By 'what is to be had fruition of in this visible state, or in that unseen,' the fruit is declared. What is to be experienced in this present state, is 'what is to be had fruition of in this visible state'. What is to be experienced in another life, is 'what is to be had fruition of in that unseen.'",
            "Thus some meritorious acts, such as the worship of the gods, performed with excessive impetuosity,\" bestow, even in this life, fruit in The shape of rank, years, and enjoyment, as distinguished rank (that of a remi-god), &c., accrued, even in this life, to Nandisvara, through the force of his worship of the divine Mahesvara. So to others, as Visvamitra, (who, according to the RAMAYANA, from being a KSHATRIYA was raised to the rank of a BRAHMAN), through the efficacy of penance, rank and long life (have accrued). To others (has accrued change of) rank only, as the change to another rank, &c., of those doing wicked acts with hot impetuosity, such as Nahusha (who was changed to a snake), and Urvasi (the nymph who was punished) by her metamorphosis into a creeper in the grove of Kartikeya. In this way is the rule to be applied, according to circumstances, distributively or collectively, (each well-deserving or ill-deserving person being understood to receive rank, or years, or enjoyment, one or more of them, or all of them, or none of them, and so on through the string of permutations and combinations possible).",
            "Now he mentions the fruit of the stock of works divided according to its divisions (into merit and demerit.)"
          ]
        },
        {
          "verse number": 13,
          "verse title": "The fruit of works",
          "verse": "सति मूले तद्विपाको जात्यायुर्भोगाः",
          "translation": "sati mūle tadvipāko jātyāyurbhogāḥ",
          "meaning": "While there is the root, fructification is rank, years, and enjoyment.",
          "explanation": [
            "The 'afflictions' above-mentioned are the 'root;' whilst these remain unsubdued, of these acts, virtuous or vicious, 'rank, years, and enjoyment,' are the 'fructification' i.e., the fruit. 'Rank' means the being a man (or a god, or a beast,) or the like. 'Years' mean abiding for a long time in the body. 'Enjoyments' mean sense-objects, the senses, and the aggregate of pleasures and pains, because the word BHOGA (here rendered 'enjoyment') is formed (from the root BHUJ) so as to denote the object, the instrument, or the state (of enjoyment).",
            "The gist of this is this, that the mental deposits of works, collected, from time without beginning, in the ground of the mind, as they by degrees arrive at maturation, so do they, existing in lesser or greater measure (the sum of the merit being lesser than that of the demerit, or conversely), lead to their effects in the shape of rank (raised or lowered), years, and enjoyment (or experience of good or ill).",
            "In respect of the 'rank,' &c., that have been declared to be the fruit of acts, he states, according to the works that are the cause of each, which is the efficient of which effect."
          ]
        },
        {
          "verse number": 14,
          "verse title": "What works have what fruits",
          "verse": "ते ह्लादपरितापफलाः पुण्यापुण्यहेतुत्वात्",
          "translation": "te hlādaparitāpaphalāḥ puṇyāpuṇyahetutvāt",
          "meaning": "These have joy or suffering as itir.ir fruits, accordingly as the cause is virtue or vice.",
          "explanation": [
            "'Joy' means pleasure ; 'suffering' means pain. Those the fruit of which are joy and suffering, are what are so named (i.e. are what are denoted in the aphorism by the compound term here analysed). By 'virtue' (PUNYA) is meant any good deed ; by 'vice,' its opposite. Of what things these two, viz., virtue and vice, are the causes the nature of these things (is what is meant by the compound term PUNYAPUNYAHETUKATVA ; and it is) thereby (or accordingly as the cause is virtue or vice, that the effect is joy or suffering).",
            "What is asserted is this, that the rank, years, and enjoyment, originating in good works, are pleasant fruits ; and what originate in evil acts are painful fruits.",
            "This twofold character (of the fruit of works) is in respect of mortals simply ; but to the Yogi ALL (mundane experience) is sorrow, as he proceeds to state."
          ]
        },
        {
          "verse number": 15,
          "verse title": "Pleasure and pain alike vexations to the Yogi",
          "verse": "परिणामतापसंस्कारदुःखैर्गुणवृत्तिविरोधाच्च\nदुःखमेव सर्वं विवेकिनः",
          "translation": "pariṇāmatāpasaṃskāraduḥkhairguṇavṛttivirodhācca duḥkhameva sarvaṃ vivekinaḥ",
          "meaning": "And, to the discriminating, all is grief simply, since the modifications due to the qualities are adverse (to the summum bonum) through the vexations of the various forms (of nature), and of anxiety and of impressions self-continuant.",
          "explanation": [
            "That is to say, (in the opinion) of him who understands discriminatively the 'affections,' &c., EVERY instrument of experience (whether of pleasure or of pain) that comes under his view, is, like food with poison in it, a grief, only, something felt to be against the grain.",
            "Since the Yogi who has become a complete adept is distressed even by the slighest pain, as the eye-ball, and no other member, experiences great pain from the mere touch of a thread of wool, so the discriminating (votary of Quietude) is averse to the adherence of even a very little pain ; How is it (that he shrinks from such pain)? To this he replies, `through the vexations of the various forms, and of anxiety, and of impressions self-continuant.",
            "Since there is increase of desire in proportion as more objects are enjoyed, and since these (objects) are causes of other pains occasioned by their non-attainment, they are really nothing else than griefs according to the principle that the nature of the cause is not other than the nature of the product ; thus is it the various forms (of Nature presented to us in the shape of objects) are sorrow.",
            "While the means of enjoyment are being enjoyed, since there must ever exist an aversion towards what is hostile to that (enjoyment, so that thus ever \"surgit amari aliquid medio defonte leporum\"), even at the time of experiencing pleasure, the pain of distress is hard to be got rid of, such is what constitutes the pain (called)) anxiety.",
            "As for the fact that 'impressions self-continuant' are griefs, the sense of enjoyment, and the sense of suffering, that arises on the contact of objects which one desires or does not desire, originates in one's (mental) field a corresponding self-continuant impression. Again we (thence) experience sensations of the same sort, so that, since, through the emergence of innumerable self-continuant impressions, the mundane state is never cut short, everything whatever is a grief.",
            "'And since the modifications due to the Qualities are adverse.' Of the Qualities, viz. Purity, Passion, and Darkness, the modifications (or psychical influences) which arise in the shape of Pleasure, Pain, and Indifference, are opposed to one another, since they reciprocally are overpowered or do overpower. These are but griefs, since they are, in absolutely every instance, 'le cause of grief (grief continuing while the mundane state due to the Qualities continues).",
            "What is asserted is this, that to the discriminating one, who desires entire and complete cessation of suffering, the whole quaternion (enumerated in the aphorism) are causes of the alleged description (i.e., causes of grief). Hence, since all objects exhibit themselves in the shape of vexations, therefore the harvest of all works is in the shape of vexations alone.",
            "This, that, since the aforesaid fund of 'afflictions', the harvest of (each one's) stock of works, takes its rise in Ignorance, and since Ignorance, as being in the shape of false know-ledge, is to be expelled by correct knowledge, and since correct knowledge consists in the ascertainment of what is to be rejected and what to be accepted, with the means (of rejection, &c.), in order (I repeat,) to declare this, he says :"
          ]
        },
        {
          "verse number": 16,
          "verse title": "What is to be shunned",
          "verse": "हेयं दुःखमनागतम्",
          "translation": "heyaṃ duḥkhamanāgatam",
          "meaning": "What is to be shunned is pain not yet come.",
          "explanation": [
            "Since what HAs been is past, and what is BEING experienced is incapable of being shunned (WHILST being experieeced), it is only mundane pain not yet arrived that is to be shunned, such is what is here asserted.",
            "He states the cause of that which is to be shunned."
          ]
        },
        {
          "verse number": 17,
          "verse title": "The origin of evil",
          "verse": "द्रष्टृदृश्ययोः संयोगो हेयहेतुः",
          "translation": "draṣṭṛdṛśyayoḥ saṃyogo heyahetuḥ",
          "meaning": "The cause of what is to be shunned is the conjunction of the seer with the visual.",
          "explanation": [
            "The 'seer', in the shape of Thought. The 'visual' means the principle of understanding (which does not itself see, but is Thought's organ). The conjunction of these two, occasioned by the absence of discriminative knowledge, their contact as the experienced (for all that seems external is developed out of the principle of the understanding,) and the experiencer, Tins is the cause or reason 'of what is to be shunned,' of pain, of the world in the shape of a modification of the Qualities ; because when THIS surceases, the mundane state surceases, such is the meaning.",
            "We have spoken of 'the conjunction of the seer with the visual.' Among these things, of the 'visual' he states the nature, the products, and the motive."
          ]
        },
        {
          "verse number": 18,
          "verse title": "The nature and purpose of the visible",
          "verse": "प्रकाशक्रियास्थितिशीलं भूतेन्द्रियात्मकं\nभोगापवर्गार्थं दृश्यम्",
          "translation": "prakāśakriyāsthitiśīlaṃ bhūtendriyātmakaṃ bhogāpavargārthaṃ dṛśyam",
          "meaning": "The visual (including the visible) whose habit is illumination, action, and rest, and which consists of the elements and the organs, is for the sake of experience and emancipation.",
          "explanation": [
            "\"Illumination' is the property of 'Purity.' Action,' the shape of exertion, is that of Passion.\"Rest, in the shape of fixation, is that of 'Darkness.' Of which these—illumination, action, and rest—are the habit, or the essential nature THAT is what is so described (i.e., described in the aphorism by the compound epithet here analysed). Thus has its nature beer set forth.",
            "'Consisting of the Elements and the Organs.' The 'Elements,' according to their division into the Gross and the \" Subtile, are Earth, &c., and the rudiments of Odour ; &c. The 'Organs,' according to their division into the organs of knowing, the organs of action, and the internal organ, are of three sorts. Of which this two-fold character of percept and perception is 'what it consists of,' a modification not other than itself, THAT is what is so described (i.e., described as 'consisting of the Elements and the Organs'). Thus have its products (which are not other than Nature herself) been stated.",
            "'Experience' means what has been already defined.\" 'Emancipation' is the surcease, occasioned by discriminative knowledge, of the mundane state. Of which these two, experience and emancipation, are the motive or purpose, THAT is what is so described (i.e. described by the compound epithet now analysed), that is to say 'the visual (including the visible.')",
            "And since this, the 'visible,' which consists of modifications in the shape of various conditions, requires to be known as what is to be shunned in order to declare its conditions. he says :"
          ]
        },
        {
          "verse number": 19,
          "verse title": "The aspects of the Qualities",
          "verse": "विशेषाविशेषलिङ्गमात्रालिङ्गानि गुणपर्वाणि",
          "translation": "viśeṣāviśeṣaliṅgamātrāliṅgāni guṇaparvāṇi",
          "meaning": "The divisions (of condition) of the qualities are (1) the diverse, (2) the non-diverse, (3) the merely (once) resolvable, and (4) the irresolvable.",
          "explanation": [
            "The divisions, i.e. the several conditions, of the Qualities are to be understood to be four, such is what we are here informed of. Among these, the 'diverse' are the gross elements and the organs ; the 'non-diverse' are the subtile elements and the internal organ ; the 'merely (once) resolvable' is intellect (which is resolvable into the Undiscrete but not further) ; the 'irresolvable' is the Undiscrete (or Nature) ; thus has it been declared.",
            "The four conditions (of development) of the Qualities are set forth as necessarily requiring to be known at the time of Concentration, because we recognise the Undiscrete, which consists of the three Qualities, as being present everywhere that these are, (so that if we did not know these, then the Undiscrete, the cause of bondage, might be present undetected).",
            "Since the visible requires first to be known as that which is to be shunned, having thus explained it, with its conditions. in order now to explain what is to be accepted (and not to be got rid of, viz.) the 'seer,' he says :"
          ]
        },
        {
          "verse number": 20,
          "verse title": "Soul defined",
          "verse": "द्रष्टा दृशिमात्रः शुद्धोऽपि प्रत्ययानुपश्यः",
          "translation": "draṣṭā dṛśimātraḥ śuddho'pi pratyayānupaśyaḥ",
          "meaning": "The 'seer' (soul) is vision simply, though pure, looking directly on ideas.",
          "explanation": [
            "The 'seer', i.e., Soul, is 'vision simply,' i.e., mere Thought. This 'though pure,' i.e. though abiding as itself, without becoming modified, or the like. 'Looking directly on ideas' : 'ideas' are thought coloured by objects ; it looks 'directly on' these, immediately, without the intervention of successive stages, or the like. What is asserted is this, that, whilst it is only the intellect that becomes coloured by the object, Soul is spectator merely through proximity.",
            "It alone is the experiencer : so he says :"
          ]
        },
        {
          "verse number": 21,
          "verse title": "Soul is the experiencer",
          "verse": "तदर्थ एव दृश्यस्यात्मा",
          "translation": "tadartha eva dṛśyasyātmā",
          "meaning": "For the sake of it alone is the entity of the visible.",
          "explanation": [
            "The 'entity,' the self, of the 'visible' which has been already defined,\"—this is 'for the sake of IT'—the bringing about that 'IT,' the Soul, shall be an experiencer, is its aim, to the exclusion in short of any selfish end. For Nature, energizing, energizes not with a view to any purpose of her own, but with the design \"Let me bring about Soul's experience.\"",
            "If thus the motive be only the effecting of Soul's experience, then, when this has been effected, it should cease striving for that in the absence of a motive ; and, when it is free from alteration, since it is pure (exhibiting neither the Qualities of Passion nor of Darkness when all three are in calm equipoise), all souls should be freed from bondage, and the mundane state should be cut short. Having pondered this doubt, he says:"
          ]
        },
        {
          "verse number": 22,
          "verse title": "The emancipation of one ........... not that of others",
          "verse": "कृतार्थं प्रति नष्टमप्यनष्टं तदन्यसाधारणत्वात्",
          "translation": "kṛtārthaṃ prati naṣṭamapyanaṣṭaṃ tadanyasādhāraṇatvāt",
          "meaning": "Though it have ceased to be in respect of him who has effected what is required, it has not ceased (in regard to all), because it is common to others besides him.",
          "explanation": [
            "Although, since it causes experience just till there is discriminative knowledge, it ceases to be, i.e., desists from acting, in respect of some soul which has effected the end (of discerning discriminatively), still, since it is common to all souls, it continues, as regards others, with its operations undestroyed. Therefore, since Nature is common to all experiencers, it never ceases ; nor does the emancipation of one involve the emancipation of all ; such is what is asserted.",
            "Having explained the 'visible' and the 'seer,' in order to explain their conjunction, he says :"
          ]
        },
        {
          "verse number": 23,
          "verse title": "What is the conjunction of soul and nature?",
          "verse": "स्वस्वामिशक्त्योः स्वरूपोपलब्धिहेतुः संयोगः",
          "translation": "svasvāmiśaktyoḥ svarūpopalabdhihetuḥ saṃyogaḥ",
          "meaning": "The conjunction is the cause of the apprehension of the actual condition of the natures of the possessed and the prossessor.",
          "explanation": [
            "He characterises this through its effect (telling us not what the conjunction is, but what it is the cause of).",
            "'The nature of the possessed' is the nature of the visible. 'The nature of the possessor' is the nature of the 'seer.' Moreover, the apprehension of the nature of these two, correlated as the known and the knower, that which is the cause of Tins is the conjunction (here spoken of) ; and this is none other than the nature of their cognate habit as the experienced and the experiencer. Because, of these two, which are from everlasting and all-pervading, there is no conjunction other than their essential character. That the experienced's character as something experienced and the experiencer's character as an experiencer, has existed from everlasting, this alone is the con-junction (or relation between the two).",
            "Moreover he states the cause thereof."
          ]
        },
        {
          "verse number": 24,
          "verse title": "The cause of the conjunction",
          "verse": "तस्य हेतुरविद्या",
          "translation": "tasya heturavidyā",
          "meaning": "The cause thereof is 'to be quitted—viz., ignorance.",
          "explanation": [
            "That which has been already described\" as Ignorance, in the shape of delusion, consisting in the confounding of the unreal with the real, is declared to be of that conjunction in the shape of the absence of discriminative knowledge, the cause, what is to be quitted the (grammatical) object of the act of `quitting.'",
            "What, again, is the 'quitting' thereof ? To this he replies."
          ]
        },
        {
          "verse number": 25,
          "verse title": "What is the quitting of conjunction?",
          "verse": "तदभावात् संयोगाभावो हानं तद्दृशेः कैवल्यम्",
          "translation": "tadabhāvāt saṃyogābhāvo hānaṃ taddṛśeḥ kaivalyam",
          "meaning": "The 'quitting consists in the surcease of the conjunction, on that (ignorance) ; this is the isolation of the soul.",
          "explanation": [
            "'Of that,' i.e., of Ignorance, eradicated by its essential opposite, viz., right knowledge, 'the surcease,' when this takes place, the surcease also of its effect, viz., of the conjunction, is what is called the 'quitting' of it.",
            "What is meant is as follows ; abandonment does not apply in the case of this as in that of a circumscribed body (from which you may disjoin yourself by moving away into a portion of peace unoccupied by it) ; but, when discriminative knowledge has been produced, the conjunction, which was due to the absence of discriminative knowledge, ceases quite of its own accord ; such is the 'quitting' of it. And, moreover, that quitting which there is of conjunction (with Nature), being for all eternity, is what is called the isolation (KAIVALYA) Of the soul (thereafter existing entirely) ALONE (KEVALA).",
            "Thus have the nature, the cause„ and the effect of the conjunction (of soul with Nature) been declared.",
            "Now, by means of declaring the means of 'quitting' (what ought to be quitted), he states  by implication) the cause (the attainment of) what (condition) ought to be accepted (as the most desirable possible)."
          ]
        },
        {
          "verse number": 26,
          "verse title": "The means of quitting the conjunction",
          "verse": "विवेकख्यातिरविप्लवा हानोपायः",
          "translation": "vivekakhyātiraviplavā hānopāyaḥ",
          "meaning": "The means of quitting (the state of bondage) is discriminative knowledge not discontinuous.",
          "explanation": [
            "The 'knowledge,' the perfect cognizance, of the distinction, in this shape, viz., that the Qualities are one thing and Soul is another thing, is 'the means,' the cause, of 'quitting,' i.e. of abandoning, the visible (or phenomenal). WHAT sort of (knowledge) ? 'Not discontinuous.' That (knowledge) is 'not discontinuous,' in respect of which there is no skipping, no breaks between and between, in the shape of non-abstraction (or re-conjunction of soul with the things of sense).",
            "The import here is this, that, when Ignorance is dissolved by force of meditating on what is opposed to it, that advent which there is of a reflection, in the soul, of the introspective intellect, where the conceit of being knower or agent has been laid aside, and when it is unoppressed by the filth of Passion and Darkness, is what is called discriminative know-ledge, (or the knowledge of the non-identity of soul and Nature). And when this prevails permanently, there simply becomes, through the cessation of the rule of the visible, ISOLATION.",
            "While telling of what description is the discernment of that soul in which discriminative knowledge has taken place, lie declares (by implication) the nature of discriminative knowledge itself."
          ]
        },
        {
          "verse number": 27,
          "verse title": "Discriminative knowledge of what nature",
          "verse": "तस्य सप्तधा प्रान्तभूमिः प्रज्ञा",
          "translation": "tasya saptadhā prāntabhūmiḥ prajñā",
          "meaning": "Of that (enlightened soul) the perfect knowledge, up to the ground of the limit, is of seven kinds.",
          "explanation": [
            "'Of that' (soul) in which discriminative knowledge has sprung up ; 'the perfect knowledge' in the shape of the discrimination which it behoves us to understand ; `up to the ground of the limit,' i.e., as far as is the extent of all the meditation that has a support\" is of seven sorts.",
            "Among these (seven), that which consists in liberation from the products (of mind) is of four sorts, (1) \"That which is to be known is known by me ;\" (2) \"There is nothing that ought to be known ;\" (3) \"My 'afflictions' are destroyed, there is nothing of mine requiring to be destroyed ;\" (4) \"Knowledge has been attained by me, discriminative knowledge has been attained by me ;\" and so, by the abandonment of all other impressions, in that state of thing, just such perfect knowledge takes place (as is spoken of in the aphorism). Such perfect knowledge, being pure knowledge the object of which is some product (of mind)> is what is called liberation from the products.'",
            "'Liberation from the mind' is of three sorts, (1) \"My mind has done its office (in enabling me to discern the distinction of soul and nature) ;\" (2) \"And the Qualities have lost their influence (over me), like stones that have fallen from u mountain-peak they will not again resume their place; for why should these, when tending towards resolution into their cause, spring up again in the absence of the fundamental reason (for their springing up) which is called 'delusion,' and in the absence of a motive ?\" (3) \"And my meditation is such as has become one with soul ; such being the case, I exist in my real nature.\" Such is the threefold 'liberation from mind.'",
            "So then, when there has sprung up such a sevenfold perfect knowledge, reckoning as far as to the limit (where meditation ceases to rest upon an object), we say that soul is ALONE (KEVALA, or in the desiderated state of KAIVALYA.",
            "It has been stated\" that discriminative knowledge is the cause of the removal of the Conjunction (between soul and nature) ; but what is the cause of THAT ? To this he replies."
          ]
        },
        {
          "verse number": 28,
          "verse title": "Ascetic practices clear the way to discriminative knowledge",
          "verse": "योगाङ्गानुष्ठानादशुद्धिक्षये ज्ञानदीप्तिरा विवेकख्यातेः",
          "translation": "yogāṅgānuṣṭhānādaśuddhikṣaye jñānadīptirā vivekakhyāteḥ",
          "meaning": "Till there is discriminative knowledge, there is, from the practice of the things subservient to the Yoga, an illumination (more or less brilliant) of Knowledge (which is operative) in the removal of Impurity.",
          "explanation": [
            "The 'things subservient to the YOGA' are what will be mentioned.\" From the 'practice' of these, i.e., from the practice of them preceded by a knowledge of them, 'till there is discriminative knowledge,' that 'illumination of knowledge' which, more or less, as a modification of the pure (or enlightening) principle, is (operative) 'in the removal of impurity'—in the removal of impurity in the shape of the 'afflictions' whose characteristic is their hiding the light of the pure principle of the mind, until discriminative knowledge (takes place), THAT is the cause of this knowledge of the distinction between soul and nature) ; such is the meaning.",
            "'From the practice of the things subservient to the YOGA, in the removal of impurity,' has been said : what, then, are those 'things subservient to the Yoga' ? So he enunciates them."
          ]
        },
        {
          "verse number": 29,
          "verse title": "The eight subservients of Concentration",
          "verse": "यमनियमासनप्राणायामप्रत्याहारधारणाध्यानसमाधयोऽष्टावङ्गानि",
          "translation": "yamaniyamāsanaprāṇāyāmapratyāhāradhāraṇādhyānasamādhayo'ṣṭāvaṅgāni",
          "meaning": "The eight things subservient (to concentration) are (1) forbearance, (2) religious observance, (3) postures, (4) suppression of the breath, (5) restraint, (6) attention, (7) contemplation, and (8) meditation.",
          "explanation": [
            "Some of these, as 'attention, &c., are immediately sub¬servient, since they are directly conducive to meditation. Some, as 'forbearance,' religious observance,' &c., conduce to medita¬tation by means of their eradicating (all hesitation about things opposed to it, such as killing, &c.) Of 'postures,' and the rest (in the list,) the conduciveness is successive, it being, e.g., when one has succeeded in regard to 'posture,' that there is steadiness in 'suppression of breath and so it is to be inferred also in respect of the others (in succession).",
            "He describes these in their order."
          ]
        },
        {
          "verse number": 30,
          "verse title": "What is forbearance ?",
          "verse": "अहिंसासत्यास्तेयब्रह्मचर्यापरिग्रहा यमाः",
          "translation": "ahiṃsāsatyāsteyabrahmacaryāparigrahā yamāḥ",
          "meaning": "'Forbearance' (Yama) consists of not killing, veracity, not stealing, continence, and not coveting.",
          "explanation": [
            "Among these (to speak first of the first), 'killing' is acting for the purpose of removing life; and this is a cause of all evils. The absence of this is what is meant by 'not killing.' Since 'killing' must be abstained from at ALL times, its opposite 'not killing' is set down first (in the list).",
            "'Veracity' means conformity, in speech and mind, to fact. Its opposite is falsehood. 'Theft' is the taking away another's property. Its absence is 'not stealing.' 'Continence' is the subjection of one's members 'Not coveting' means not desiring for one's self means of enjoyment.",
            "These five, 'not killing,' &c., which are meant by the word 'forbearance,' are laid down as things conducive to Concentration.",
            "He states a peculiarity of these."
          ]
        },
        {
          "verse number": 31,
          "verse title": "Honestly independent of circumstances",
          "verse": "जातिदेशकालसमयानवच्छिन्नाः सार्वभौमा महाव्रतम्",
          "translation": "jātideśakālasamayānavacchinnāḥ sārvabhaumā mahāvratam",
          "meaning": "These, without respect to rank, place, time, 0r com-pact, are the universal great duty.",
          "explanation": [
            "'Rank' means Brahmanhood, &c. 'Place' means a place of pilgrimage, &c., 'Time' means the fourteenth of the month, or other (date which may affect the meritoriousness  or otherwise of this or that otherwise perhaps indifferent act). 'Compact' means that a Brahman, for example,     is the motive (of our doing or leaving undone). The aforesaid 'forbearances,' viz., 'not killing,' &c., without respect to these four (considerations) abiding in all places i.e. (as the moral law written on the heart, in all) understandings are what are called 'the great duty.'",
            "To explain: 'I will not kill a Brahman,' 'I will not. kill any one at a place of pilgrimage,' 'I will not kill anyone on the fourteenth of the month,' 'I will not kill, except for the benefit of a god, a Brahman, or the like,. (well, the 'forbearances' must be) without this fourfold qualification, unqualified, thus 'I will not kill anyone, anywhere, at any time, or for any purpose whatever.' And the same holds in respect of truth' and the rest, mutatis mutandis. It is these thus unqualified, and acted upon in their full generality, that are called 'the great duty'.",
            "He states what are 'religious observances' (NIYAMA)."
          ]
        },
        {
          "verse number": 32,
          "verse title": "Religious Observances",
          "verse": "शौचसंतोषतपःस्वाध्यायेश्वरप्रणिधानानि नियमाः",
          "translation": "śaucasaṃtoṣatapaḥsvādhyāyeśvarapraṇidhānāni niyamāḥ",
          "meaning": "Religious observances (Niyama) are (1) purification. (2) contentment, (3) austerity, (4) inaudible mutterings, and (5) persevering devotion to the lord.",
          "explanation": [
            "'Purification' (SAUCHA) is of two sorts. external, and internal, The external is the cleansing of the body by earth, water, &c. The internal is the washing away the impurity of the mind by means of benevolence, &c.",
            "'Contentment' (SANTOSHA) means contentedness. The rest have been already described. These, viz., 'purification,' and the rest, are what are meant by the term 'religious Observances.'",
            "'HOW are these Subservient to Concentration? To this he replies :"
          ]
        },
        {
          "verse number": 33,
          "verse title": "How these things are of use",
          "verse": "वितर्कबाधने प्रतिपक्षभावनम्",
          "translation": "vitarkabādhane pratipakṣabhāvanam",
          "meaning": "in excluding things questionable, the calling up something opposite (is serviceable).",
          "explanation": [
            "'Killing,' &c, as Opponents of Concentration, are 'things questionable] because they are doubted about (it being questionable what real good they can do). If these are excluded when things Opposed to them are called up, then concentration is facilitated. Hence 'forbearance' and 'religious observances' really are subservient to Concentration",
            "Now he states, in order, the nature, the divisions, the kind, the cause, and the fruit, of the 'things questionable' (VITARKA)."
          ]
        },
        {
          "verse number": 34,
          "verse title": "Account of objectionable things",
          "verse": "वितर्का हिंसादयः कृतकारितानुमोदिता लोभक्रोधमोहपूर्वका\nमृदुमध्याधिमात्रा दुःखाज्ञानानन्तफला इति प्रतिपक्षभावनम्",
          "translation": "vitarkā hiṃsādayaḥ kṛtakāritānumoditā lobhakrodhamohapūrvakā mṛdumadhyādhimātrā duḥkhājñānānantaphalā  iti pratipakṣabhāvanam",
          "meaning": "The 'things questionable,' killing, &c., ,- whether done, caused to be done or approved of , whether resulting from covetousness, anger, or delusion; whether slight, of intermediate character, or beyond measure; have no end of fruits (in the shape of) pain and ignorance,' hence the calling up of something opposite (is in every way advisable).",
          "explanation": [
            "These the 'killing,' &c., aforesaid are first divided tri-partitely through the difference of 'done,' 'caused to be done,' and 'approved of.' Among these, those are 'done,' which are carried into effect by one's self. Those are 'caused to be done,' which are brought about by the employment of the incentive expression 'Do it, do it.' Those are 'approved, which, when being done by another, are consented to by the expression 'Well done. well done.' And this threefold character is mentioned in order to debar hallucination in regard to these respectively; otherwise some dull-witted one might reflect thus, \"The killing was not done by me myself, therefore the blame iv not mine.\"",
            "In order to declare the causes of these ('questionable things') he says, 'resulting from covetousness, anger. or delusion.'",
            "Although 'covetousness' is the one first specified, yet, since the source of ALL the 'afflictions' is delusion, whose mark is the conceit that what is NOT soul is soul, THIS we must be sure is the root, because, when IT takes place, 'covetousness,' 'anger' and the rest arise in consequence of there having gone before the division of SELF and OTHER ONE (but for the existence of which delusive division there would have been no room for either covetousness or anger). We mean, then, that every class of evils results from delusion.",
            "'Covetousness' is a thirst. 'Anger' is an inflamed condition of the mind, which uproots ail discrimination between What ought to be done and what ought not to be done.",
            "\"Killing,' &c., moreover, which are severally three-fold through the distinction between 'done,' &c.,\" are divided tri-partitely through their having as their cause 'delusion,' &c. He mentions, of these again, a threefold character, through their difference of state, as slight, of intermediate character, and beyond measure. The 'slight,' or slow, are those that are neither fierce no middling. Those 'of intermediate    character,' are what are neither slow nor fierce. Those that are 'beyond measure' are what are vehement, neither middling nor slight. Thus the nine divisions, since there is thus a further threefold character, become twenty-seven.",
            "The 'slight,' &c., moreover severally may be of three sorts through the distinction of slight, intermediate, and excessive. These are to be combined accordingly as they can combine. For example, the 'slightly slight,' the 'slightly intermediate,' the 'slightly excessive,' and so on.",
            "He mentions their fruit, saying, 'having no end of fruits (in the shape of) pain and ignorance.' 'Pain' is a state of mind, dependent on the Quality of passion, exhibiting itself as something repugnant. 'ignorance' false knowledge, in the shape of doubt or error. Those ('questionable things') of which the endless, or unlimited, fruits are these two, viz., pain and ignorance, are what are so spoken of (i.e. spoken of by the compound epithet here analysed).",
            "Thus it is enjoined, that the Yogi, by meditating on 'something opposite' is to get rid of these (questionable things') which he has understood by means of the division of natures, causes, &c., (that has been now set forth).",
            "With a view to declare. in order, how perfections arise, consequent on these ('forbearance,' &c.). when, by practice, they have reached their highest degree. he says."
          ]
        },
        {
          "verse number": 35,
          "verse title": "Influence of the Yogi that is harmless",
          "verse": "अहिंसाप्रतिष्ठायां तत्सन्निधौ वैरत्यागः",
          "translation": "ahiṃsāpratiṣṭhāyāṃ tatsannidhau vairatyāgaḥ",
          "meaning": "When harmlessness is complete, near mu, man is abandonment or enmity.",
          "explanation": [
            "When the harmlessness of him that practises harmlessness is complete, even natural enemies, as the snake and the mongoose, abandon (when near him) their enmity. and abide in amity; that is to say, those that delight in destroying, leave off their destructiveness.",
            "What happens in respect of him that practises veracity? To this he replies."
          ]
        },
        {
          "verse number": 36,
          "verse title": "Influence of veracity",
          "verse": "सत्यप्रतिष्ठायां क्रियाफलाश्रयत्वम्",
          "translation": "satyapratiṣṭhāyāṃ kriyāphalāśrayatvam",
          "meaning": "When veracity is complete, He is run receptacle on the fruit or works.",
          "explanation": [
            "For works, such as sacrifices, being performed. give fruits, such as Paradise. But of that Yogi who practises veracity. the veracity rises to such a degree that the Yogi receives the fruit even without the works being performed. At his bidding, the fruit of works accrues to any one soever, even though not perforating the work : such is the meaning.",
            "He states the fruit accruing to him that practises abstinence from theft."
          ]
        },
        {
          "verse number": 37,
          "verse title": "The reward of not thieving",
          "verse": "अस्तेयप्रतिष्ठायां सर्वरत्नोपस्थानम्",
          "translation": "asteyapratiṣṭhāyāṃ sarvaratnopasthānam",
          "meaning": "When abstinence from theft is complete, all jewels come near Him.",
          "explanation": [
            "When he practises  abstinence from theft, then, on its reaching its highest degree, the jewels that exist in every quarter come to him even though he covet them not.",
            "He states the fruit of the practice of continence."
          ]
        },
        {
          "verse number": 38,
          "verse title": "The reward of continence",
          "verse": "ब्रह्मचर्यप्रतिष्ठायां वीर्यलाभः",
          "translation": "brahmacaryapratiṣṭhāyāṃ vīryalābhaḥ",
          "meaning": "When continence is complete, there is gain or strength.",
          "explanation": [
            "He, indeed, that practises continence, when 'it is complete, there is revealed in him excessive strength, or power. For continence is the preserving of one's manly vigour; and from this (continence) being of a high degree, vigour in body, organs, and, mind, attains a high degree.",
            "He states the fruit of the practice of non-covetousness."
          ]
        },
        {
          "verse number": 39,
          "verse title": "The reward of non-covetousness",
          "verse": "अपरिग्रहस्थैर्ये जन्मकथंतासम्बोधः",
          "translation": "aparigrahasthairye janmakathaṃtāsambodhaḥ",
          "meaning": "When non-covetousness is established, there is knowledge or all about (former) states or existence.",
          "explanation": [
            "'All about it' means the condition how (KATHANTA being the abstract of the indeclinable KATHAM). 'All about states of existence,' such is the meaning of JANMAKATHANTA. The 'knowledge' thereof, the perfect understanding. That is to say. he knows perfectly everything in regard to the question 'Who was I in a former state of existence? What sort of person? The doer of what actions?'",
            "It is not merely the coveting of the means of enjoyment that is (here meant by) covetousness. Covetousness is (meant) even as far as the soul's coveting a body.  Since a body is an instrument of enjoyment whilst IT exists, from its association with desires, our enery being directed to the external, no real knowledge reveals itself. When, again, without regard to coveting a body, &c., one betakes one's self to indifference, then, since one abandons desire, &c., the acquaintance with past and future states of existence becomes indeed a cause of right knowledge to the indifferent (person, who thus discerns how little there is deserving of a wise man's regard in any mundane condition whatever).",
            "The fruits of the ('forbearances') have been stated. Now he mentions (those of) the 'religious observance.'"
          ]
        },
        {
          "verse number": 40,
          "verse title": "Mental result of purifications",
          "verse": "शौचात् स्वाङ्गजुगुप्सा परैरसंसर्गः",
          "translation": "śaucāt svāṅgajugupsā parairasaṃsargaḥ",
          "meaning": "From 'purification,' loathing for one's own members,  and non-intercourse with others.",
          "explanation": [
            "He who practises 'purification,' to him there springs up a loathing, an aversion, even for his own members, through his thoroughly discerning the cause and nature (of a body) ; \"this body is impure ; any fondness for it is not to be entertained ;\" and so for the same reason, there is 'non-intercourse; the absence of intercourse, the avoidance of intercourse, 'with others,' with other possessors also of bodies' ; such is the meaning. For whoso loathes his own body, through his discernment of this or that fault, how must he judge of intercourse with the similar bodies of others ?"
          ]
        },
        {
          "verse number": 41,
          "verse title": "Other reams of purifications",
          "verse": "सत्त्वशुद्धिसौमनस्यैकाग्र्येन्द्रियजयात्मदर्शन-योग्यत्वानि च",
          "translation": "sattvaśuddhisaumanasyaikāgryendriyajayātmadarśana-yogyatvāni ca",
          "meaning": "And purity in the quality of goodness, complacency, intentness, subjugation of the senses, and fitness  for the beholding of soul, (are fruits of 'purification').",
          "explanation": [
            "'Are' is required to complete the sentence.",
            "The 'Quality of goodness' is what consists of light, joy. &c.;\" its 'purity' is its not being oppressed by Passion and Darkness. 'Complacency' is mental joy, from there not being the oppression of distress. 'Intentness' is steadiness of the mind on an object to which the senses are confined. 'Subjugation of the senses' is the abiding in themselves of the senses averted from objects. The 'fitness' of the mind means its power of beholding soul, (this 'beholding' being in the shape of the knowledge of the distinctness (of soul from Nature).",
            "These, 'purity in the Quality of Goodness,' and the rest, manifest themselves in succession, in the case of him that practises purifications. That is to say, from 'purification' comes 'purity in the Quality of Goodness,' from purity in the Quality of Goodness, 'complacency' ; from 'complacency,' intentness' ; horn 'intentness, 'subjugation 01 the senses,' and from 'subjugation of the senses,' fitness for the beholding of soul.'",
            "He states the fruit of the practice of contentment."
          ]
        },
        {
          "verse number": 42,
          "verse title": "The fruit of contentment",
          "verse": "संतोषादनुत्तमसुखलाभः",
          "translation": "saṃtoṣādanuttamasukhalābhaḥ",
          "meaning": "From contentment there is acquired superlative felicity.",
          "explanation": [
            "From contentment's reaching its highest degree, there is revealed to the Yogi such an inward joy that the external enjoyment of objects is not equal to a hundredth part of it",
            "He states the fruit of 'austerity' (TAPAS)."
          ]
        },
        {
          "verse number": 43,
          "verse title": "The fruit of austerity",
          "verse": "कायेन्द्रियसिद्धिरशुद्धिक्षयात् तपसः",
          "translation": "kāyendriyasiddhiraśuddhikṣayāt tapasaḥ",
          "meaning": "The perfection of the bodily senses, by the removal of impurity, (is the fruit) of austerity.",
          "explanation": [
            "'Austerity,' when thoroughly practised, brings 'perfection,' i.e., a heightening, of the bodily senses, through the removal of the impurity, consisting in the 'afflictions,' &c., of the mind.",
            "What is meant is this ; by the CHANDRAYANA (species of fast), and the like, there is the removal of the 'afflictions\" of the mind. By the removal of these there is developed, in the senses, the power of, for example, discerning the subtile, the hidden, and the infinite ; and, in the body. (the power of assuming) at will either an atomic or an enormous bulk, &c.",
            "He states the fruit of 'inaudible muttering' (SVADHYAYA.)"
          ]
        },
        {
          "verse number": 44,
          "verse title": "The fruit of inaudible muttering",
          "verse": "स्वाध्यायाद् इष्टदेवतासंप्रयोगः",
          "translation": "svādhyāyād iṣṭadevatāsaṃprayogaḥ",
          "meaning": "Through inaudible muttering there is a meeting with one's favourite deity.",
          "explanation": [
            "When 'inaudible muttering,' in the shape of charms and spells directed (to some or other), is at its height, there takes place, in the case of the Yogi, a meeting with the 'favourite' deity, i.e. with the one to whom this (inaudible muttering) was directed. That is to say, the deity becomes visible (and most probably says \"Ask a boon\").",
            "He states the fruit of 'persevering devotion to the Lord' (ISVARA-PRANIDHANA)."
          ]
        },
        {
          "verse number": 45,
          "verse title": "The fruit of persevering devotion to the Lord",
          "verse": "स्वाध्यायाद् इष्टदेवतासंप्रयोगः",
          "translation": "samādhisiddhirīśvarapraṇidhānāt",
          "meaning": "Perfection in meditation comes from persevering devotion to the lord.",
          "explanation": [
            "As for this species of faith in the Lord, there is developed there from Meditation, which has been already described, because that Divine Lord, being pleased, having removed the obstructive 'afflictions,' elicits meditation.",
            "Having spoken of the 'forbearances' and the 'religious observances\"' he speaks of the 'postures' (ASANA)."
          ]
        },
        {
          "verse number": 46,
          "verse title": "What are postures?",
          "verse": "स्थिरसुखम् आसनम्",
          "translation": "sthirasukham āsanam",
          "meaning": "A 'posture' is what is steady and pleasant.",
          "explanation": [
            "A 'posture' means what one sets one's self in, such as the PADMA, the DANDA, the SVASTIKA, &c., (With the precise character of which we are not at present concerned). When this is 'steady,' not wavering, and 'pleasant,' not uncomfortable, then this serves as a subservient to Concentration.",
            "He mentions a plan for producing steadiness and pleasantness in this same."
          ]
        },
        {
          "verse number": 47,
          "verse title": "'Postures'—how managed",
          "verse": "प्रयत्नशैथिल्यानन्तसमापत्तिभ्याम्",
          "translation": "prayatnaśaithilyānantasamāpattibhyām",
          "meaning": "Through slightness of effort and through attaining to the infinite (do 'postures,' become steady and pleasant).",
          "explanation": [
            "The construction (with the preceding aphorisms) is this, that, viz., 'posture,' becomes steady and pleasant through slight-less of effort and through attaining to the infinite.",
            "When; he forms the wish, \"Let me establish (myself in such and such) a posture,\" that 'posture' is effected with slight effort, with little trouble ; and when the mind attains to the boundlessness that belongs to space, i.e. when in thought one has identified one's self with it, then, from there being neither body nor self-consciousness, the 'posture' is no cause of pain ; when THIS command over the 'postures' has been attained, the trembling, &c.,\" which are obstacles to meditation, no longer prevail.",
            "He mentions a fruit of this same when accomplished"
          ]
        },
        {
          "verse number": 48,
          "verse title": "Fruit of the 'postures'",
          "verse": "ततो द्वन्द्वानभिघातः",
          "translation": "tato dvandvānabhighātaḥ",
          "meaning": "Thence there is no assault by the pairs.",
          "explanation": [
            "When this command of the 'postures' has been attained, the Yogi is not assailed by 'the pairs,' cold and heat, hunger and thirst, &c., such is the meaning.",
            "Next after the mastering of the 'postures,' he speaks of the 'regulation of the breath' (PRANAYAMA)."
          ]
        },
        {
          "verse number": 49,
          "verse title": "Regulation of the breath",
          "verse": "तस्मिन्सति श्वासप्रश्वासयोर्गतिविच्छेदः प्राणायामः",
          "translation": "tasminsati śvāsapraśvāsayorgativicchedaḥ prāṇāyāmaḥ",
          "meaning": "When this has taken place, there is regulation of the breath, a cutting short of the motion of inspiration and expiration.",
          "explanation": [
            "When steadiness in a 'posture' has taken place, that species of auxiliary of Concentration. viz., 'regulation of the breath,' to which this (steadiness of posture) is conducive, is to be practised. Of what sort is this ? In the shape of 'a mating short of the motion of inspiration and expiration.'",
            "'Inspiration and expiration' are what have been described. What is called 'regulation of the breath,' is the 'cutting short,' or restraining, 'of the motion,' or flow, in the places, external or. internal,\" of these two by means of the threefold process of (regulated) expiration, retention, and inspiration.",
            "In order that this same may be easily understood he states the nature of it, with its divisions."
          ]
        },
        {
          "verse number": 50,
          "verse title": "This explained",
          "verse": "बाह्याभ्यन्तरस्तम्भवृत्तिर्देशकालसंख्याभिः\nपरिदृष्टो दीर्घसूक्ष्मः",
          "translation": "bāhyābhyantarastambhavṛttirdeśakālasaṃkhyābhiḥ paridṛṣṭo dīrghasūkṣmaḥ",
          "meaning": "Put this, which is (1) outer, (2) inner, and (3) steady, peculiarised by place, time, and number, is long or short.",
          "explanation": [
            "'That which is outer' is the expiration, or expelling ; 'that which is inner, is the inspiration, or filling ; 'that which abides steady.' within, is called KUMBHAKA. It is called KUMBHAKA because, when it takes place, the vital spirits rest motionless like water in a jar (KUMBHA).",
            "This threefold regulation of the breath, further peculiarised by place, time, and number, is termed 'long or short.' Peculiarised by place,' e.g., (see the direction). \"As regards beginning and end, twelve from the nose,\" that is to say as far as twelve inches, beginning from the nose 'Peculiarised by time,' a, \"Fors the duration of thirty-six MATRAS,\" &c. Peculiarised by number,' e.g. the first UDVATA is made by so many inspirations and expirations, so many times ; and the employment of number is had recourse to in order that this Ray be known (by substituting the definite number for the indefinite 'so many'). By UDVATA is meant the impinging of the air sent t upwards, in speaking), from the pit of the stomach, on the head, (from which it is supposed to be reflected down again, to passing out of the mouth.)",
            "Having mentioned three regulations of the breath, in oiler to declare a fourth one, he says ‘."
          ]
        },
        {
          "verse number": 51,
          "verse title": "A special variety",
          "verse": "बाह्याभ्यन्तरविषयाक्षेपी चतुर्थः",
          "translation": "bāhyābhyantaraviṣayākṣepī caturthaḥ",
          "meaning": "The fourth recognises both the outer and the inner spheres.",
          "explanation": [
            "The 'outer sphere' of the breath is that (space) from beginning to end (reckoning from the nose) of twelve (inches).\" The 'inner sphere' is the heart, the navel, the plexus, &c. The fourth regulation of the breath is that which, in the shape of motionlessness, is a cutting off of the motion (of the breath), recognising, i.e., having an eye upon, both those two spheres.",
            "The distinction between this and the third one, viz., (the KUMBHAKA), is this : That one (the KUMBHAKA) without paying any regard to the two spheres, the outer and the inner suddenly, like a lotus dropped upon a heated stone, at once arrives at the condition of rigidity ; but THIS one is a restrainment that has respect to the two spheres.",
            "This also, like the former,\" is to be regarded as being peculiarised by time, space, and number.",
            "Of this (regulation of the breath) which is of four descriptions, he mentions the fruit."
          ]
        },
        {
          "verse number": 52,
          "verse title": "The fruit of the regulation of the breath",
          "verse": "ततः क्षीयते प्रकाशावरणम्",
          "translation": "tataḥ kṣīyate prakāśāvaraṇam",
          "meaning": "Thereby is removed the obscuration of the light.",
          "explanation": [
            "'Thereby,' i.e. by that regulation of the 'breath' there is 'removed.' or destroyed, that 'obstruction' which, in the shape of the 'afflictions,'\" there is 'of the light,' that belongs to the Pure Quality of the mind ; such is the meaning.",
            "He mentions another result."
          ]
        },
        {
          "verse number": 53,
          "verse title": "A further result",
          "verse": "धारणासु च योग्यता मनसः",
          "translation": "dhāraṇāsu ca yogyatā manasaḥ",
          "meaning": "And the mind becomes fit for acts of attention.",
          "explanation": [
            "'Acts of attention' are what will be spoken of (in the sequel). The mind, freed from its defects by the several kinds of regulation of the breath, wherever it is directed to, there it remains fixed, and does not suffer distraction.",
            "'Inspiration and expiration' are what have been described. What is called 'regulation of the breath,' is the 'cutting short,' or restraining, 'of the motion,' or flow, in the places, external or. internal,\" of these two by means of the threefold process of (regulated) expiration, retention, and inspiration.",
            "He defines 'restraint' (PRATYAHARA)."
          ]
        },
        {
          "verse number": 54,
          "verse title": "What is 'restraint'",
          "verse": "स्वविषयासंप्रयोगे चित्तस्वरूपानुकार इवेन्द्रियाणां प्रत्याहारः",
          "translation": "svaviṣayāsaṃprayoge cittasvarūpānukāra ivendriyāṇāṃ pratyāhāraḥ",
          "meaning": "'Restraint' is as it were the accommodation of the senses to the nature of the mind in the absence of concernment with each one's own object.",
          "explanation": [
            "It is called 'restraint,' because, when it exists, the senses are restrained, are withheld, from their respective objects. And how is this effected ? He replies, 'of the senses,' Sight, &c., there is 'each one's own object,' as Colour, &c. : 'concernment' therewith is any energizing with respect thereto, the 'absence' of this is the abiding in their mere nature after having abandoned all regard to such things. When this takes place, the senses simply accommodate themselves to the nature of the mind ; for, all the senses are observed to follow obsequiously the mind, as the bees their leader. Hence, when the mind is restrained (from the exercise of its functions), these (senses), are restrained ; and their accommodation to the nature thereof (under such circumstances) is what is called 'restraint.'",
            "He states the fruit."
          ]
        },
        {
          "verse number": 55,
          "verse title": "The fruit of restraint",
          "verse": "ततः परमा वश्यतेन्द्रियाणाम्",
          "translation": "tataḥ paramā vaśyatendriyāṇām",
          "meaning": "There from is there complete subjection of the senses.",
          "explanation": [
            "For, when 'restraint is practised, the senses become so subjected, so subdued, that, even when attracted towards external objects, they will not go ; such is the meaning.",
            "Recapitulation",
            "Thus, then, (to recapitulate briefly) of Concentration, which was defined in the First Book, having declared that appendage, viz., the 'Practical (part of) Concentration'3° the fruit of which is the alleviating of the afflictions',\" having mentions the names of the 'afflictions,' their cause and source,\" their nature and fruit, having stated also the division, cause, nature, and fruit, of works,\" the nature and cause of fructification are set forth.\" Then, since the 'afflictions,' &c., are to be got rid of, and since it is impossible to get rid of them, without knowing what they are, and since knowledge is dependent on instruction, and since the instruction assumes four aspects, as it respects (1) what is to be got rid of. (2) what is not (desired) to be got rid of, (3) what is constituted by the cause, and (4) what is the cause constitutive, and since, without (an explanation of what is meant by the expression) 'getting rid of,' the nature of 'what is to be got rid of cannot be explained, (therefore) having set forth the fourfold arrangement, with (an explanation of what is meant by) 'getting rid of,' and with (an account of) the cause of each thing severally ;\" having explained, along with the fruits, the nature of those appliances, (forbearance,' &c., which stand in the relation of causes, immediate or mediate, in respect of the constitutive cause (of emancipation), viz., 'discriminative knowledge';\" having exhibited the 'postures,' &c., as far as 'attention,' arranged according to their mutual relation as conduced to and conducers, their fruits, along with the respective characters thereof, have been set forth.\"",
            "Thus this 'Concentration,' having through 'forbearance,' religious observances,' &c., attained to the condition of a seed, and having sprouted by means of the 'postures' and 'regulation of the breath,' and having blossomed by means of 'self-restraint,' will fructify by means of 'attention,' contemplation,' and 'meditation'. Thus has the Book on the Means been explained.",
            "'Thus has been completed the Second Book—that on the Means—of the commentary called the RAJA MARTANDA, com-posed by the illustrious great king and governor, king Bhoja Raja, on the Aphorisms of Patanjali's System of the Yoga."
          ]
        }
      ]
    },
    {
      "chapter 3": [
        {
          "verse number": 1,
          "verse title": "Dharana defined",
          "verse": "देशबन्धश्चित्तस्य धारणा",
          "translation": "deśabandhaścittasya dhāraṇā",
          "meaning": "Fixing the internal organ ( Chitta ) on a place is dharana ( attention ).",
          "explanation": [
            "\"On a place\" i.e. at the circle of the navel, &c. The fixing of the internal organ, by abstracting it from all other objects, is called Dharana ( attention ) of the internal organ, ( Chitta ).",
            "Having defined Dharana, he ( Patanjali ) proceeds to state Dhyana ( contemplation )."
          ]
        },
        {
          "verse number": 2,
          "verse title": "Dhyana defined",
          "verse": "तत्र प्रत्ययैकतानता ध्यानम्",
          "translation": "tatra pratyayaikatānatā dhyānam",
          "meaning": "A course of uniform ( fixed on only one object) modification of knowledge at that place ( where the  internal organ is fixed in dharana) is dhyana (contemplation ).",
          "explanation": [
            "A course of uniform modification of knowledge at that place where the internal organ is fixed in attention by avoiding the otherwise ( not uniform ) modification of knowledge, is called Dhyana ( contemplation ).",
            "( It is to be observed here that in this philosophy the usual tenet is, that knowledge in the shape of Dhyana does not take place unless it has recourse to a certain place. Therefore, the definition speaks of a course of uniform modification of knowledge at that place, where the internal organ is fixed in attention, ( Dharana ).",
            "He explains ( now ) Samadhi, the last of the Yogangas, ( things subservient to the Yoga )."
          ]
        },
        {
          "verse number": 3,
          "verse title": "Samadhi defined",
          "verse": "तदेवार्थमात्रनिर्भासं स्वरूपशून्यमिव समाधिः",
          "translation": "tadevārthamātranirbhāsaṃ svarūpaśūnyamiva samādhiḥ",
          "meaning": "The same ( contemplation) when it arises only about a material substance or object of sense, ( and therefore) is ( then) like a non-existence of itself ( that is like ignorance) is Samadhi ( meditation ).",
          "explanation": [
            "( The true meaning of this aphorism is this, that knowledge in the shape of contemplation always takes place about the following three, i.e. the material substance whether it be animate or inanimate, such, as a cow, a jar &c., the term cow, a jar &c., and the knowledge itself ; but when it takes place only about the material substance and not about the latter two, then, such a knowledge in the shape of contemplation is called Samadhi. )",
            "The term Samadhi means literally that state ( of knowledge ) in which the mind, having avoided the obstacles, is well fixed on, or confined to one object only."
          ]
        },
        {
          "verse number": 4,
          "verse title": "Sanyama defined",
          "verse": "त्रयमेकत्र संयमः",
          "translation": "trayamekatra saṃyamaḥ",
          "meaning": "These three ( when they operate only) on one object, constitute Sanyama",
          "explanation": [
            "In order to give a technical term for the use of the three Yogangas just defined, he says.",
            "The three which are characterised as Contemplation, Attention and Meditation, when they operate on only one object are called in this philosophy by the appellation of Sanyama.",
            "He explains the fruit ( result ) of Sanyama."
          ]
        },
        {
          "verse number": 5,
          "verse title": "The fruit produced by Sanyama",
          "verse": "तज्जयात्प्रज्ञालोकः",
          "translation": "tajjayātprajñālokaḥ",
          "meaning": "By subduing sanyama, a discerning principle is developed.",
          "explanation": [
            "\"By subduing Sanyama\" i.e. by rendering it natural (easily attainable) through endeavours, a principle, distinguishing things from others, is developed ; that is to say, the intellect well apprehends a thing to be known."
          ]
        },
        {
          "verse number": 6,
          "verse title": "The use of Sanyama",
          "verse": "तज्जयात्प्रज्ञालोकः",
          "translation": "tasya bhūmiṣu viniyogaḥ",
          "meaning": "Sanyama is to be used in the modifications ( of the internal organ, Chitta ).",
          "explanation": [
            "He explains the use of Sanyama.",
            "\"In the modifications ( of the internal organ )\" in the shapes characterised by the rough ( Sthula ) and fine ( Sukshma ) objects, Sanyama is to be used, that is, to make the modifications fit, by Sanyama, for the future fruit just defined. When it is known that the lower modifications of the internal organs are subdued, Sanyama is then to be used in the superior modifications to subdue them, because, the Soul would never gain the fruit ( aimed at ) without subduing the lower modifications, though attempting to subdue the superior ones by Sanyama. [ The meaning of the whole is this, that a man should proceed towards concentration by gradually acquiring control over the modification of the internal organ, in the shapes of rough and fine objects. When the superhuman faculties Anima &c., attainable by the conquest of the respective modifications of the internal organ, are at his disposal, he is to know that those modifications are subdued, and then he should proceed further to subdue the other ones, otherwise, he is not to expect to gain access to Concentration ( Yoga )]."
          ]
        },
        {
          "verse number": 7,
          "verse title": "The three Yogangas interior to the meditation called Samprainata-samadhi",
          "verse": "त्रयमन्तरङ्गं पूर्वे",
          "translation": "tasya bhūmiṣu viniyogaḥ",
          "meaning": "The three yogangas ( i.e. Attention, contemplation, and meditation) are more interior i.e. ( immediately subservient to that kind of meditation) in which there is distinct recognition, i.e. Samprajnatasamadhi, 4 than the first ( five yogangas, forbearance &c.).",
          "explanation": [
            "In ( the Second Book called ) Sadhanapada, he having enunciated the eight Yogangas—things subservient to concentration,' has defined ( only ) five ( of them, i.e. forbearance, Yama &c. ) ; but why has he not ( there ) defined the last three, attention &c ? With reference to this, he declares as follows.",
            "The first ( five ) Yagangas, forbearance (Yama) ) &c., are not immediately subservient to that kind of meditation in which there is distinct recognition ( i.e. Samprajnatasamadhi ) but as the three ( Yogangas, attention &c. ) are immediately subservient to accomplish its nature, these three therefore, are more interior, Antaranga, to it than the first five."
          ]
        },
        {
          "verse number": 8,
          "verse title": "Those very three are exterior to the meditation called Asamprajnatsamadhi",
          "verse": "तदपि बहिरङ्गं निर्बीजस्य",
          "translation": "tadapi bahiraṅgaṃ nirbījasya",
          "meaning": "Those three also are exterior to the meditation  without a seed ( Nirbija ).",
          "explanation": [
            "He declares ( now ) that these three ( Yogangas ) also are exterior ( Bahiranga ) to the other kind of meditation in which distinct recognition is lost ( i.e. Asamprajnatasamadhi. )",
            "\"Nirbija\" i.e. that which has no support to depend on. that is to say, that kind of meditation in which recognition of an object is lost. To this kind of meditation, these three - Yogangas are not immediately subservient, and therefore these also are exterior ( Bahiranga ) to this kind of meditation."
          ]
        },
        {
          "verse number": 9,
          "verse title": "The modification in the shape of Nirodha defined",
          "verse": "व्युत्थाननिरोधसंस्कारयोरभिभवप्रादुर्भावौ निरोधक्षणचित्तान्वयो निरोधपरिणामः",
          "translation": "vyutthānanirodhasaṃskārayorabhibhavaprādurbhāvau nirodhakṣaṇacittānvayo nirodhapariṇāmaḥ",
          "meaning": "Out of the two trains of self-reproductive thought, resulting from the Vyutthana and the Nirodha, when the former is subdued and the latter is manifested and, at that moment of manifestation, the internal organ ( Chitta ) is concerned in both of the trains, then, such modification of the internal organ is the modification in the shape of Nirodha.",
          "explanation": [
            "Now, being desirous to explain the Siddhis ( Superhuman faculties which arise from the Yogangas ); to bring under discussion the particular circumstances of Sanyama ( which has been defined before,6 ) he declares the three modifications ( of the internal organ ) successively.",
            "\"Vyutthana\" consists of the three modifications of the internal organ in the shape of Kshipta ( cast ), Mudha ( darkened ) and Vikshipta ( better than Kshipta ) : ( That is the first is that modification of the internal organ in which it, by passion, is entirely cast in, i.e. engaged in the thought of an object ; the second is that in which it, by darkness, takes the shape of sleep ; and the third is that in which it is better than Kshipta, i.e. in which, though it is inclined towards concentration„ still it, every now and then, becomes engaged with other objects, ( see the sentence, given below, of the Commentary on the Yogabhashya, by Vijnanabhikshu \"Nirodha is that modification in which the internal organ has only a pure element ( Sattva ) as an object of thought. From these two, result the two trains of self-reproductive thought, out of which, in succession, when the former is overcome, i.e. become incapable of producing any effect on account of its being hidden, and the latter is manifested, i.e. come in view in the present way and at that moment of Nirodha ( just expounded ), the connection of the internal organ with both of the trains is called the modification ( of the internal organ ) in the shape of Nirodha. The meaning is this, that when the quality in the shape of the train resulting from the Vyutthana has disappeared, and that in the shape of the train resulting from the Nirodha becomes manifest, and the internal organ appears to be connected with both of the trains, then, such modification of the internal organ is ( technically ) termed Nirodhaparinama. Though the internal organ is not fixed ( because it consists of ) the three principles of existence i.e. Sattya ( truth or existence ), Rajas ( passion or foulness ) and Tamas, ( darkness or ignorance ) which always vary ( according to the technicality of the Yoga and Sankhya Philisophies ), still this modification of the internal organ is called the fixed-modification ( of it )."
          ]
        },
        {
          "verse number": 10,
          "verse title": "The fruit resulting from the Nirodhaparinama",
          "verse": "तस्य प्रशान्तवाहिता संस्कारात्",
          "translation": "nirodhakṣaṇacittānvayo nirodhapariṇāmaḥ",
          "meaning": "A uniform flow ( of modifications of the internal organ aises ) from the ( aforesaid) train of self-reproductive thought.",
          "explanation": [
            "He states the ( special ) fruit of it.",
            "\"A uniform flow &c.\" that is to say, the internal organ takes a uniform shape on account of its being deprived of the obstacles ( Vikshepas or Antarayas, sickness, languor &c. )."
          ]
        },
        {
          "verse number": 11,
          "verse title": "The modification in the shape of Samadhi (meditation) defined",
          "verse": "सर्वार्थतैकाग्रतयोः क्षयोदयौ चित्तस्य समाधिपरिणामः",
          "translation": "sarvārthataikāgratayoḥ kṣayodayau cittasya samādhipariṇāmaḥ",
          "meaning": "Out of the two ( properties) of the internal organ Chitta—which consist of Sarvarthata ( that is its comprehension of several objects 1 and Ekagrata ( i.e. Its intentness on a single point) ; ( when) the first  is utterly destroyed and the second is manifested-( at that time the connection of the internal organ with both of the properties or the state in which it exists as Dharmi, i.e. Endowed with the two properties) is the modification of the internal organ in the shape of Samadhi ( meditation ).",
          "explanation": [
            "Having described the modification in the shape of Nirodha ( hindrance ) he declares ( now ), the modification in the shape of Samadhi ( meditation ).",
            "\"Sarvarthata\" i.e. that property, in the shape of an obstacle, of the internal organ, Chitta, which consists of its comprehension of several 'objects on account of its being changeable \"Ekagrata\" (literally means intentness on a single point, bu here it ) means a uniform modification of the internal organ having its support on only one object. This also is a property of the internal organ. Out of these two, ( when ) the destruction ( of the first ) and the manifestation ( of the 2nd ) i.e. the destruction or an utter conquest of the first property characterised as Sarvarthata and the manifestation or development of the 2nd one distinguished as Ekagrata, take place successively, ( at that time ), the connection or me internal organ, which has (then an abundance of the principle Sattva, truth, with both of the properties or its existence as Anvayi ( or Dharmi i.e. endowed with the two properties just mentioned ) is technically called the modification in the shape of Samadhi, meditation. This modification differs from the former one only in this respect that, there, the subjugation and manifestation of the Sanskaras, trains of self-reproductive thought, that is, the subjugation of the former train of ,self-reproductive thought, resulting from Vyutthana, before defined, and the manifestation or the state of not being subdued, of the latter one, resulting from Nirodha, hindrance, are to take place. But here, ( i.e. in the modification in the shape of Samadhi, meditation ) the destruction and manifestation of the properties, Dharmas ( and not of the Sanskaras ), that is, the destruction or entering the past way, on account of utter negligence, of the property of an obstacle in the shape of Sarvarthata and the production or manifestation, in the present way, of the property characterised as Ekagrata, ( are to take place)."
          ]
        },
        {
          "verse number": 12,
          "verse title": "The third modification in the shape of intentness on a single point defined",
          "verse": "ततः पुनः शान्तोदितौ तुल्यप्रत्ययौ चित्तस्यैकाग्रतापरिणामः",
          "translation": "tataḥ punaḥ śāntoditau tulyapratyayau cittasyaikāgratāpariṇāmaḥ",
          "meaning": "(When) the two particular states or modifications Pratyayas) the one tranquil ( Santa ) and the other risen ( Udita ), of the internal organ become equal, then its connection with both of the states is (its) modification in the shape of an intentness on a single point ( Ekagrata ).",
          "explanation": [
            "(He) declares (now) the third modification of the internal organ ( in the shape of) intentness on a single point (Ekagrata ).",
            "The one particular state of the obstructed internal organ is tranquil ( Santa ) i.e. entered the past way ; and the other risen i.e. agitated in the present way. (When) ) both of these states also become equal or similar ; as the internal organ, being abstracted from all other objects, has only one object, as its support, to contemplate with ( then ) the abiding (Avasthana of the internal organ in both the states as Anvayi, i.e. connected  with both of them, is called the modification ( of the internal organ ) in the shape of intentness on a single point ( Ekagrata )."
          ]
        },
        {
          "verse number": 13,
          "verse title": "The modifications of the Elements and organs explained",
          "verse": "एतेन भूतेन्द्रियेषु धर्मलक्षणावस्थापरिणामा व्याख्याताः",
          "translation": "etena bhūtendriyeṣu dharmalakṣaṇāvasthāpariṇāmā  vyākhyātāḥ",
          "meaning": "By this ( exposition of the modifications of the internal organs) the ( three) modifications in the shape of property ( Dharma ), indication ( Lakshana ) and position ( Avastha ) in ( or of) the elements and organs, have been ( sufficiently) explained.",
          "explanation": [
            "To explain the ( same ) nature ( of the modifications ) about other things, as has been stated as to those of the internal organ, ( he ) says (as follows )",
            "\"By this (exposition )\" of the three fold modification of the internal organ' the three modifications under the distinction of property, indication and position, have been explained or are to be understood, in ( or of ) the gross ( Sthula ) and subtle ( Sukshma ) Elements and both the organs i.e. those of perception and action as they are characterised. ( Now, the commentator explains these three successively.)",
            "( When) a Dharmi ( i.e. that which is endowed with a property ) taken into consideration, leaving its former property, embraces another one, ( then) this is embracing of another property is the modification ( of it ) in the shape of property. As for example. ( Take a lump of clay which is called Dharmi, as it is endowed with a property in the shape of lumpiness ). ( When ) the Dharmi clay ( as it is called ) by quitting the property in the shape of lumpiness, assumes another one in the shape of jarhood ( then ) tins modification ( which the clay has now undergone ) is called the modification of property.",
            "The modification in the shape of indication is as follows, ( when ) the same jar, by leaving the way called Vartamana ( present ) and, again by quitting it when it takes the way called Atita ( past ), ( then ), this sort of modification is called the modification in the shape of indication. ( The following example will sufficiently illustrate this. A stone has a statue already hidden in it and the sculptor only removes the outer parts of it to make it apparent. In the same manner, the jar exists already in the lump of clay and it only becomes visible when the potter removes the superfluous parts from it ; therefore, according to the technicality of this Philosophy, the jar is said to exist in the Anagata way, before it becomes visible. On its being visible, it is said to be in the present way and when it is destroyed it is said to be in the way called Atita—past. ).",
            "The modification in the shape of position is as follows. In any two similar—i.e. belonging to the present way—moments, the same jar exists ( and hence it is said ) to be Anvayi ( to the moments i.e. connected with both of them, but not without being changed, because. comparatively speaking, the jar was new in the first moment and became old in the next one), for the three visible principles of existence ( Guna ) cannot exist even in a single moment without being changed. (This kind of modification which the jar, existing in the present way, undergoes every moment, is called the modification in the shape of position )."
          ]
        },
        {
          "verse number": 14,
          "verse title": "What is Dharmi?",
          "verse": "शान्तोदिताव्यपदेश्यधर्मानुपाती धर्मी",
          "translation": "śāntoditāvyapadeśyadharmānupātī dharmī",
          "meaning": "A Dharmi is that which follows upon ( or has) the properties in the shape of Santa ( tranquil ), Udita  (risen) and Avyapadesya (incapable of denomination).",
          "explanation": [
            "Well then, what is a Dharmi ? With reference to this query, he declares the definition of Dharmi.",
            "\"Santas\" are those ( properties) which have done their respective functions, i.e. entered the past ( Atita ) way ; \"risen\" are those ( properties ) which having abandoned the way not come in view ( Anagata ) perform their own functions, and \"incapable of denomination\" are those ( properties ) which exist in the shape of Sakti ( literally power, but here the Anagata way as the word is used here according to the technicality of the Mimansa Philosophy and consequently ) these cannot be particularly denominated. As for example, ( these are those properties which stand in this form ) \"all consists of all\" &c. ( It will be clear from the following tenet of this Philosophy that \"all things are eventually dissolved into nature—Prakriti ; and consequently a jar can easily be denominated a cloth and conversely. So, in short, it can be said that all consists of all and hence they cannot be particularly named, as jar, cloth &c. ). By the word Dharma ( property ) is meant here a power itself limited, as being capable of doing a fixed action. ( Thus ) a Dharmi is that which follows, upon ( at different times ) or has, being Anvayi ( i.e. connected with them ), all the three properties ( just defined ). As for example, gold in the form of a Ruchaka, ( chain ) has a property in the shape of a chain and by quitting that property assumes another one in the shape of Svastika ( a particular kind of ornament. ) Then, though the properties ( in question ) differ from each other in some way, still the gold follows when it is commonly taken in the shape of Dharmi ; but when it is particularly taken in the shape of Dharma ( property ) it appears then to follow as a distinct one, ( because everybody can easily perceive that a garland differs from Svastika, though both of them are nothing but gold )."
          ]
        },
        {
          "verse number": 15,
          "verse title": "An indication of the various modifications of the same Dharmi",
          "verse": "शान्तोदिताव्यपदेश्यधर्मानुपाती धर्मी",
          "translation": "kramānyatvaṃ pariṇāmānyatve hetuḥ",
          "meaning": "The altered state of the order ( of the 'threefold modification just defined) is indicative of the variety of the modifications ( which the same Dharmi is to undergo ).",
          "explanation": [
            "To remove the doubt how the same Dharmi is to undergo the various modifications, ( he ) declares ( as follows ).",
            "The apparent state, changeable in every moment, of the order ( of the modifications) of the properties defined before, is indicative of the variety of the modifications. The meaning is this, that the apparent order ( of the modifications of the properties) that a lump of clay ( is produced ) from the powder of earth, thence the several parts of the jar and then the jar, indicates the state of the variety of the modifications. By the same argument, the order of the modifications of the indication and position, is also to be understood indicative of the variety of the modifications of the same Dharmi ( i.e. as a jar ). ( In this manner) all things appear to undergo a certain change according to a fixed order. and hence it is proved that the variety of the modifications ( of the same Dharmi ) is indicated by that of the order ( just explained ). Some of the properties of the internal organ and all of its objects &c., are apprehended by perception ( Pratyaksha ) as happiness &c., and position and others ( respectively ) and some are understood only by inference ( Anumana ) as property, train of self-reproductive thought, the way not come in view &c. It is always to be observed that Dharmi differs and does not differ from itself ( accordingly as it is connected with the modifications of the position and the way not come in view—as the compound word Anagatadhva means )."
          ]
        },
        {
          "verse number": 16,
          "verse title": "The superhuman faculty which consists in a knowledge of past and future events",
          "verse": "परिणामत्रयसंयमाद् अतीतानागतज्ञानम्",
          "translation": "pariṇāmatrayasaṃyamād atītānāgatajñānam",
          "meaning": "A knowledge of past and future events ( come, to an ascetic) from ( his rendering) Sanyama-restraint-about the three modifications oust explained).",
          "explanation": [
            "Now, in order to explain the Siddhis, Superhuman faculties, by showing ( first ) the particular circumstances of the before-mentioned Sanyama, restraint ( i.e. the circumstances where Sanyama is to be used to attain to the Siddhis, ) he declares ( as follows ).",
            "\"From rendering Sanyama about the three modifications ( j-:st explained )\" in the shape of property, indication and position ( i.e. from acquiring control over them from rendering Sanyama regarding them ) an ascetic knows well - the past and future events. The true meaning is this that this ( particular ) property is in this Dharmi, this is the way which it belongs to, and this is the position it possesses. Moreover, on its coming from the Anagatadva—the way not come in view, it has performed its respective function in the present way and entered now the past way. When all this the ascetic ( clearly perceives ) by getting rid of the obstacles from Sanyama, restraint, then he knows whatever is past and whatever is to come or arise ( in future ) because the capacity of the internal organ to comprehend all objects, on account of its consisting of the manifestation of the. pure truth ( Sattva ) is taken away by ( i.e. is hidden under) the obstacle ignorance ( Avidya ) &c., and when these obstacles are removed by ( adopting) special measures, then the capacity of holding all objects, is manifested in the internal organ ( which then becomes like a cleared mirror by the force of intentness on a single point ( Ekagrata )."
          ]
        },
        {
          "verse number": 17,
          "verse title": "The superhuman faculty which consists in a knowledge of the speech of all living beings",
          "verse": "शब्दार्थप्रत्ययानामितरेतराध्यासात् सङ्करस्तत्प्रविभागसंयमात्सर्वभूतरुतज्ञानम्",
          "translation": "śabdārthapratyayānāmitaretarādhyāsāt saṅkarastatpravibhāgasaṃyamātsarvabhūtarutajñānam",
          "meaning": "A confusedness of Sabda ( an uttered sound or a word ), Artha i.e. ( class, quality, action &c. ) and Pratyaya ( Knowledge) arises from comprehending these three indiscriminately. ( but when an ascetic views these separately by performing Sanyama, restraint, with regard to them, a Knowledge ( is produced in him) of the speech of all living beings ( i.e. He has a power of understanding their speech ).",
          "explanation": [
            "(He) declares (now) another Siddhi.",
            "\"Sabda\" is that ( uttered sound ) which is cognizable by the organ of hearing ; it consists of letters whose order is fixed and it is productive of knowledge of a fixed object. ( This definition of Sabda is given here according to the technicality of the Nyaya Philosophy and according to that of the grammarians it is as follows. ) Sabda is ( that sound in the utterance of which ) no order of its constituent letters is to be conceivable and ( hence ) which is Sphotatma ( i.e. from which, class, quality, action &c. become plain at once ) and which can ( only 1 be understood by a mind cultivated by science. According to both of these technicalities, it ( Sabda ) consists of term and sentence, because these two can indicate their own fixed objects. \"Arth\" ( means literally sense, but here it means ) class, quality, &c., \"Pratyaya\" ( means ) knowledge, i.e a modification of the internal organ, in the form of an object. A confusedness ( arises ) by forming the same notion of them or supposing the Sabda, Artha and Pratyaya ( just expounded ) to be identical though they are different from each other, in their use. An illustration of this is as follows. ( Suppose ) when a person is asked to bring a cow, he then comprehends indiscriminately these three, i.e., the material substance indicated by the term cow, possessed of the dewlap &c., and possessing the characteristic implied by the term cow, its indicatory term cow and the knowledge by which the material substance is conceived : but he does not perceive them so discriminately that the term cow is indicatory of this ( material substance ) ; that this is to be declared by the term cow, and that this is the knowledge by which the two former are conceived. Thus, when he is asked what is this term and what is this knowledge, he then gives the same answer \"cow\" to all these questions. If he does not conceive the identity of these three, how does he give the same answer to all these questions ? In this state, he who, having made this distinction that indicativeness is the essential nature of Sabda ( term ), that the state of having to be declared is the essential nature of Artha ( before defined ), and that luminousness is the essential nature of Jnana ( knowledge ), performs Sanyama, restraint ; acquires the knowledge of or understands the speech or language of all living beings, i.e., of animals, wild and domestic, birds, reptiles &c., that is whatever cry or whatever word ( is uttered ) he knows it all viz., that the sound was uttered with such and such a motive."
          ]
        },
        {
          "verse number": 18,
          "verse title": "The superhuman !acuity which consists in a knowledge of the class etc. experienced in the former birth",
          "verse": "संस्कारसाक्षात्करणात्पूर्वजातिज्ञानम्",
          "translation": "saṃskārasākṣātkaraṇātpūrvajātijñānam",
          "meaning": "A knowledge of the class ( &c., experienced) in a former birth ( arises) from presenting to our mind (Sakshatkarna )-the trains of self-reproductive thought-sanskaras ( of the internal organ ).",
          "explanation": [
            "(He) mentions another Siddhi.",
            "Sanskaras—the trains of self-reproductive thought which consists of the present consciousness of past perceptions of the internal organ are twofold. Some of these produce only a memory ( of the events formerly experienced ) and others are the causes of the modifications in the shape of class, age, and experience of pleasure and distress as they are called virtue and vice. When (an ascetic ) performs Sanyama ( restraint ) with regard to the Sankaras ( just illustrated ) ; that is, when he remembers only through an abstract meditation and without any exciting cause, all that is past, reflecting that he has experieinced such and such thing ; this is the result of the former set of the Sanskaras ; and that he has performed such and such action, then he clearly sees the class &c., experienced in the former birth when the trains of self-reproductive thought are thus gradually awakened."
          ]
        },
        {
          "verse number": 19,
          "verse title": "The superhuman faculty which consists in the penetration of the mind of other persons",
          "verse": "प्रत्ययस्य परचित्तज्ञानम्",
          "translation": "pratyayasya paracittajñānam",
          "meaning": "The mind of other persons becomes known 10 (an ascetic) when he performs Sanyama ( restraint) with regard to the Pratyaya-knowledge-( contained in  it, i .e . in the mind of other persons ).",
          "explanation": [
            "( He ) explains ( now ) another Siddhi.",
            "When (an asceic ) performs Sanyma with regard to the Pratyaya—knowledge—obtained by any characteristic such as complexion of the face ; then he knows the mind of another person, that is, (he) knows even the qualities which have entered into the mind of others, whether their mind is impassioned ( Saraga ) or dispassionate ( Viraga )."
          ]
        },
        {
          "verse number": 20,
          "verse title": "The mind of other persons is comprehended without its object",
          "verse": "न च तत्सालम्बनं तस्याविषयीभूतत्वात्",
          "translation": "na ca tatsālambanaṃ tasyāviṣayībhūtatvāt",
          "meaning": "It, i.e. ( the mind of other persons) is not comprehended with its Alambana-support, i.e., object ( to an ascetic) because it was not the object ( of Sanyama which he, the ascetic, made use of in comprehending the mind ).",
          "explanation": [
            "(He now) declares a peculiarity of this same knowledge of the mind of other persons.",
            "The mind of other persons cannot be understood together with its Alambana ( support ) i.e. object, because it is not recognized by any characteristic. For by the characteristic the mind only of others is understood, but it is not known what is its object and whether it be blue or yellow. It cannot be known what that object is because Sanyama cannot be performed with regard to it since it is not recognized. Hence the mind of others is not comprehended together with its Alambana ( object ) as it is not recognized. But the properties of the internal organ (Chitta, i.e. mind ) are comprehended. When an ascetic performs Pranidhana, i.e. Sanyama with a view of discovering what mind has for its object, then a knowledge of that object also arises in him by that Sanyama ( restraint )."
          ]
        },
        {
          "verse number": 21,
          "verse title": "The superhuman faculty which consists in the disappearing of an ascetic",
          "verse": "कायरूपसंयमात्तद्ग्राह्यशक्तिस्तम्भे कायरूपसंयमात्तद्ग्राह्यशक्तिस्तम्भे",
          "translation": "kāyarūpasaṃyamāttadgrāhyaśaktistambhe cakṣuḥprakāśāsaṃprayoge'ntardhānam",
          "meaning": "By performing Sanyama ( restraint) about form ( the property) of body, its power of being apprehended ( by the organ of sight) being checked, and luminousness, the property of the organ of sight having no connection ( with its object, i.e. The form, the result) is the disappearance of the ascetic.",
          "explanation": [
            "( He now ) states another Siddhi.",
            "The form ( Rupa ) of the body (Kaya ) is a property to be apprehended by the organ of sight. By performing Sanyama with the reflection \"Form consists in this body\" ( and nowhere else ) the power belonging to that form of being apprehended by the organ of sight is arrested through being subjected to that notion. On the cessation of the connection of the organ of sight with luminousness, luminousness being a property of SATTVA, ( that is to say ) when there is no function of apprehending that ( form ), the disappearance of the ascetic takes place, i.e., he is not seen by anybody."
          ]
        },
        {
          "verse number": 22,
          "verse title": "Concealment of speech off",
          "verse": "एतेन शब्दाद्घन्तर्धानमुक्तम",
          "translation": "",
          "meaning": "By this, a concealment ( Antardhana ) of speech (Sabda) &c. is also stated.",
          "explanation": [
            "\"By this,\" i.e. by explaining the means of disappearance of form, ( See the preceding Aph. ) a concealment of speech ( Sabda ) &c. cognizable by the organ of hearing and other organs is ( also ) to be understood as stated. ( That is to say that the speech of an ascetic cannot be heard by anybody if he performs Sanyama ( restraint ) about it, and this is the case with all other qualities of the organs of perception. ) ( It is to be observed here that Bhojaraja, the commentator of this work, maintains that this Aphorism belongs to the text and consequently gives a comment upon it ; but this is not the case because, Vijnana Bhikshu the expositor of the Bhashya, says that the author of the Bhashya removes the deficiency of Patanjali by stating the following sentence ( Aph. 22) in his Bhashya. Therefore it is not one of the Aphorisms of the text but a sentence of the Bhashya. )"
          ]
        },
        {
          "verse number": 23,
          "verse title": "The superhuman faculty which consists in a foreknowledge of death",
          "verse": "सोपक्रमं निरुपक्रमं च कर्म  तत्संयमादपरान्तज्ञानमरिष्टेभ्यो वा",
          "translation": "sopakramaṃ nirupakramaṃ ca karma tatsaṃyamādaparāntajñānamariṣṭebhyo vā",
          "meaning": "An action ( karma) is two-fold : one accompanied by anticipation of consequences ( Sopakrama ) and other destitute of it ( Nirupakrama ) : —from performing Sanyama ( restraint) with regard to this two-fold action, a knowledge ( arises in an ascetic) of the separation from ( his) body ( Aparanta ) ( i.e. death ) or ( the time of death is known) from portents ( Arishta ).",
          "explanation": [
            "(He now) states another Siddhi.",
            "The action, performed before ( i.e. in the former birth ) the consequence of which is years ( Ayes) is twofold, Sopakrama and Nirupakrama. Of these, Sopakrama is that which has an inclination to produce a fruit or anticipate consequences. As, for example, a wet cloth, spread in a warm place dries quickly ( This action is called Sopakrama ). Nirupakrama is the converse of it. as the same cloth folded and ( put ) in a cold place dries after a long time. A knowledge of the separation of body ( Aparanta ) i.e. death, arises in him who performs Sanyama in ( the above-mentioned ) two-fold action, so that he discovers which action anticipates consequences quickly and whit after a long time, from steadfastness of contemplation (Dhyana). ( That is to say ) he knows undoubtedly that he shall be deprived of his body ( in other words that he shall die ) at such and such time and such and such place. \"Or from portents,\" which are three-fold according to the distinction of Adhyatmika, Adhibhautika, and Adhidaivika. Of these, the Adhyatmikas are such as ( when a man ) shutting his ears does not hear the sound of the vital air ( diffused ) throughout his body &c. Adhibhautikas are such as a sudden appearance of a deformed person &c. and Adhidaivikas are such as seeing unexpectedly such things as paradise ( Svarga ) &c. which are incapable of being seen. From these ( i.e. from seeing these, a man ) knows di, time of separation from his body ( Aparanta ) i.e., death. Though the persons who are not ascetic know for the most part ( the time of their death ) from (seeing) ) the portents ; still they know it generally ( and not particularly and consequently their knowledge of it ) is doubtful. But ascetics know it ( i.e., their death ) invariably like a thing before their eyes ( Pratyaksha ) on account of ( their knowing) the fixed time and place ( i.e. they know certainly when and at what place they will die.)"
          ]
        },
        {
          "verse number": 24,
          "verse title": "Superhuman faculties about benevolence, etc.",
          "verse": "मैत्र्यादिषु बलानि",
          "translation": "maitryādiṣu balāni",
          "meaning": "( Superhuman) faculties ( are manifested in an ascetic by performing restraint) in benevolence, &c.",
          "explanation": [
            "He know proceeds to declare the Siddhis resulting from the purifying processes.\"",
            "By performing restraint in benevolence, tenderness, complacency, and disregard ( towards objects ) the faculties of Sanyama about them are manifested ( in an ascetic). He has such an excellent command over benevolence, tenderness, complacency, and disregard, that he can contract friendship &c. with all (persons)."
          ]
        },
        {
          "verse number": 25,
          "verse title": "Faculties manifested by restraint",
          "verse": "बलेषु हस्तिबलादीनि",
          "translation": "baleṣu hastibalādīni",
          "meaning": "The faculties of an elephant &c. ( are manifested in an ascetic by performing restraint) in these faculties.",
          "explanation": [
            "(He) declares (now) another Siddhi.",
            "The ascetic who performs restraint in the faculties of an elephant &c. gets these manifested in him. That is to say, every faculty whether of an elephant, wind, or of a lion, in which he performs restraint by paying close attention, is manifested in him on account of his having command over every one of them."
          ]
        },
        {
          "verse number": 26,
          "verse title": "Expedient for the knowledge of minute, concealed and distant objects",
          "verse": "प्रवृत्त्यालोकन्यासात्सूक्ष्मव्यवहितविप्रकृष्टज्ञानम्",
          "translation": "pravṛttyālokanyāsātsūkṣmavyavahitaviprakṛṣṭajñānam",
          "meaning": "A knowledge of the minute, concealed and distant ( object's of sense arises in an ascetic) by his throwing the light of immediate cognition—Pravritti ( on them ).",
          "explanation": [
            "Pravritti, the immediate cognition which is sensuous and luminous, as it is stated before\" by placing the spreading light of the pure element—Sattva which exists in immediate cognition, i.e., by brooding on the objects of sense modified in the spreading light of the pure element of immediate cognition, the organs of sense and the mind ( of an ascetic ) acquire a particular power ( and then ), a knowledge arises ( in him ) of minute objects, atoms. &c., concealed objects, wealth hidden in a certain place &c., and distant objects, the life-prolonging medicine or elixir—Rasayana, &c.",
            "He (now) ) states another Siddhi."
          ]
        },
        {
          "verse number": 27,
          "verse title": "Knowledge of (seven) worlds how arises",
          "verse": "भुवनज्ञानं सूर्ये संयमात्",
          "translation": "bhuvanajñānaṃ sūrye saṃyamāt",
          "meaning": "A knowledge of ( seven) worlds ( arises in an ascetic) by his performing restraint in regard to the ( luminous body) the sun.",
          "explanation": [
            "He (now) ) states another Siddhi.",
            "He, who performs restraint with regard to the luminous sun, knows exactly about the cities consisting of the seven worlds which are Bhur-loka, the earth ; Bhuvar-loka, the space between the earth and the sun ; Svarga-loka, the heaven of Indra and others. In the preceding aphorism, the light of pure element (is to be understood ) as stated as a support ( for fixation of the mind ) and in this the elemental light. This is the difference only."
          ]
        },
        {
          "verse number": 28,
          "verse title": "An expedient",
          "verse": "चन्द्रे ताराव्यूहज्ञानम्",
          "translation": "candre tārāvyūhajñānam",
          "meaning": "A knowledge of forms of the asterisms ( arises in an ascetic) when he performs restraint with regard to the moon.",
          "explanation": [
            "He states another Siddhi through the very support of the elemental light.",
            "\"Forms of the asterisms,\" i.e., the particular figures of the fixed stars : a knowledge arises ( in an ascetic ) about these ( when ) he performs restraint with regard to the Moon. As the lustre of the asterisms is destroyed by the light of the sun and consequently a knowledge cannot be obtained about them, this expedient is therefore separately stated."
          ]
        },
        {
          "verse number": 29,
          "verse title": "How a knowledge of the stars' motion arises",
          "verse": "ध्रुवे तद्गतिज्ञानम्",
          "translation": "dhruve tadgatijñānam",
          "meaning": "A knowledge of the motion of the stars ( arises in an ascetic by his performing restraint) with regard to the polar star ( Dhruva ).",
          "explanation": [
            "He states another Siddhi.",
            "An ascetic when he performs his restraint with regard to the fixed polar star, the principal of all constellations, knows the fixed time and fixed amount of the motion of every star. ( The true ) meaning of the Aphorism is this that the ascetic knows all this that such and such a ( heavenly body ) is a star and such and such a heavenly body is a planet. This star will reach such and such a sign of the Zodiac by such and such a fixed time. This ( sort of ) knowledge of time is the result of the restraint ( performed with regard to the polar star )."
          ]
        },
        {
          "verse number": 30,
          "verse title": "The circle of the navel",
          "verse": "नाभिचक्रे कायव्यूहज्ञानम्",
          "translation": "nābhicakre kāyavyūhajñānam",
          "meaning": "A knowledge of the particular structure of the body ( arises in an ascetic who performs his restraint) with regard to the circle of the navel.",
          "explanation": [
            "Having stated the external Siddhis, he (now) proceeds to explain the internal ones.",
            "The particular structure of the body ; that is, the constitution of the essential humour ( Rasa ), the excretion (Mala), the principle ( Dhatu ) and veins &c. of the body ; a knowledge about this structure arises in an ascetic by his performing restraint with regard to the circle of the navel situated in the body called Nabhi which is endowed with sixteen angles. The true meaning of this is that the circle of the navel being situated in the middle of the body is a root or origin of veins &c., which are extended throughout ( the body ), and consequently by per-forming restraint with regard to the circle of the navel, the whole constitution of the body becomes exactly known to the ascetic."
          ]
        },
        {
          "verse number": 31,
          "verse title": "",
          "verse": "कण्ठकूपे क्षुत्पिपासानिवृत्तिः",
          "translation": "kaṇṭhakūpe kṣutpipāsānivṛttiḥ",
          "meaning": "A cessation of hunger, thirst, &c. ( takes place in an ascetic by performing his restraint) with regard to the well of ( his) throat.",
          "explanation": [
            "He (now) states another Siddhi.",
            "There is a place like a pit below the tongue in the throat ( which is called ) the well of the throat ; a contact of the vital airs with this well causes the manifestation of hunger, thirst, &c. And these inclinations cease in an ascetic who performs restraint with regard to that ( well ), i.e., a superhuman faculty of this nature ( is invariably at the command of an ascetic ) on account of his brooding upon this stream ( i.e., the well of throat which is situated ) below the uvula."
          ]
        },
        {
          "verse number": 32,
          "verse title": "",
          "verse": "कूर्मनाड्यां स्थैर्यम्",
          "translation": "kūrmanāḍyāṃ sthairyam",
          "meaning": "A firmness ( of mind takes place when an ascetic performs his restraint) with regard to the vein  ( called) Kurma tortoise ).",
          "explanation": [
            "He (now) states another Siddhi.",
            "A firmness of mind is produced when the ascetic performs his restraint with regard to the vein called kurma which is situated below the well of the throat ; that is fickleness of mind does not take place when the ascetic ( by the efficacy of his meditation ) enters the spot ( i.e. the vein ) or firmness is produced in the body ( of the ascetic ) that is, it cannot be moved by anything."
          ]
        },
        {
          "verse number": 33,
          "verse title": "",
          "verse": "मूर्धज्योतिषि सिद्धदर्शनम्",
          "translation": "mūrdhajyotiṣi siddhadarśanam",
          "meaning": "(The ascetic) sees Siddhas, the divine personages or spirits ( when he performs his restraint) with regard to the light-Jyotis--of the head.",
          "explanation": [
            "He (now) states another Siddhi.",
            "An aperture called Brahmarandhra in the skull ( of everybody ) is a light ( Jyotis ) on account of its being a reservoir of light ; as the spreading light of a gem situated in the inside of a house collects in the keyhole of the door, so in the same manner the luminousness of Sattva of mind, being spread, collects in the aperture called Brahmarandhra of the skull. ( Therefore ) when the ascetic performs his restraint with regard to this aperture or light ( as just expounded ), he catches sight of the divine spirits who dwell in the (wide) ) space between the earth and sky and who cannot be seen by any other beings ( but the ascetic ) ; that is, he sees and converses with them."
          ]
        },
        {
          "verse number": 34,
          "verse title": "",
          "verse": "प्रातिभाद्वा सर्वम्",
          "translation": "prātibhādvā sarvam",
          "meaning": "Or ( the ascetic) disregarding all other instrumental causes ( knows) everything from (only) Pratibha ( a knowledge called Taraka ).",
          "explanation": [
            "He (now) states another expedient for omniscience.",
            "A right knowledge instantly produced from ( the operations of ) mind only is called Pratibha, and a restraint being performed with regard to this, Taraka ( i.e. preserver ) a knowledge antecedent to a discriminating faculty of mind Vivekakhyati, arises. As the twilight appears before sunrise, so Taraka, a knowledge concerning all things, manifests ( itself in the ascetic ) before the Vivekakhyati. That is, when this is the case, ( the ascetic ), having then no need of any other restraint, knows everything."
          ]
        },
        {
          "verse number": 35,
          "verse title": "",
          "verse": "हृदये चित्तसंवित्",
          "translation": "hṛdaye cittasaṃvit",
          "meaning": "A knowledge about mind-Chitta-( arises in an ascetic, when he performs his restraint) with regard to the internal organ-Hridaya.",
          "explanation": [
            "He (now) states another Siddhi.",
            "\"Hridaya\" a particular part of the body ; in this part, there is the site of the internal organ within a small inverted lotus, and when the ascetic performs his restraint with regard to that site, a knowledge of his own mind as well as that of others arises in him, that is he knows all fancies of his own mind as well as the passions &c., of the minds of others."
          ]
        },
        {
          "verse number": 36,
          "verse title": "The expedient for the knowledge of the person—Purusha",
          "verse": "सत्त्वपुरुषयोरत्यन्तासंकीर्णयोः प्रत्ययाविशेषो भोगः\nपरार्थत्वात्स्वार्थसंयमात्पुरुषज्ञानम्",
          "translation": "sattvapuruṣayoratyantāsaṃkīrṇayoḥ pratyayāviśeṣo bhogaḥ parārthatvātsvārthasaṃyamātpuruṣajñānam",
          "meaning": "From conceiving indifferently 'the knowledge of the person ( Soul) and Sattva (purity or the principle of understanding, Buddhitattva ) which are entirely different from each other, ( a knowledge of joy and affliction arises and) that is enjoyment ( Bhoga ). This enjoyment is another's object ( Parartha ), and an object different from this is the proper object ( Svartha-or the principle of understanding) and from performing restraint with regard to this proper object, a knowledge of the person ( arises in an ascetic ).",
          "explanation": [
            "He (now) states another Siddhi.",
            "\"Sattva,\" ( purity ) is a particular modification of nature which consists of illumination and joy ( and it is what is called the principle of understanding, Buddhitattva ). The person ( soul ) is an experiencer—in the form of the ruler. These are entirely unmixed. The meaning is that, these are quite different ( from each other) on account of their being severally experience and experiencer, conscious and unconscious. From Sattva's acting the part of the agent ( karta ), in consequence of conceiving 'identically the knowledge of these ( two, i.e., Sattva and soul, ) a knowledge ( Sanvit ) or a modification consisting of joy and pain ( arises ) and it is ( what is called ) Bhoga ( enjoyment ). By Sattva's not regarding this enjoyment as its own object, it is the object of another —Parartha—i.e. it is for the sake of soul, and an object different from this is Sattva's own object ( Svartha ). This object is clinging only to the nature of soul, the consciousness. That is, it is on object or reflection of consciousness ( Chichchhayasankranti ) in Sattva when it is free from egotism. When an ascetic performs his restraint with regard to that ( Svartha of soul ) a knowledge concerning the soul arises (in him), i.e.. the ascetic knows that the soul is conscious of only this sort of knowledge, the clinging to the consciousness which consists in the Sattva ; and it ( the soul ) being intelligent becomes not the object of knowledge inasmuch as there would arise a difficulty from its becoming knowable ( Jneya ) as there is a total contrariety of the intelligent and knowable."
          ]
        },
        {
          "verse number": 37,
          "verse title": "The fruit of the preceding superhuman faculty",
          "verse": "ततः प्रातिभश्रावणवेदनादर्शास्वादवार्ता जायन्ते",
          "translation": "tataḥ prātibhaśrāvaṇavedanādarśāsvādavārtā jāyante",
          "meaning": "From that, Pratibha, ( Taraka, a knowledge concerning all things,\" and the knowledge caused by the organs) hearing, touch, sight, taste, and smell arises ( in the ascetic ).",
          "explanation": [
            "He (now) states the fruit of the same restraint.",
            "\"From that\" (i.e.) from practising the restraint with regard to soul—Purusha—( the following knowledge ) arises in the ascetic ( when ) he is even Vyutthita, i.e., not devoted to meditation. in this case, from the manifestation of the aforesaid knowledge, Pratibha, he sees subtile objects, &c. He recognises the sound produced in heaven from the eminent practice, gained by the force of restraint, in the knowledge produced from the organ of hearing. A knowledge arises ( in him ) with regard to touch of the objects in heaven from Vedana, an appellation, technically used in Tantra ( science ) for a faculty of mind by which a knowledge produced from the organ of touch or tangibility is meant. A knowledge about the divine form arises (in an ascetic) from the excellent Adarsa—a faculty of mind by which the forms ( situated ) all around are seen and consequently ( it means ) the knowledge caused by the organ of sight. Asvada, a faculty of mind—by which ( a thing ) is tasted, and thus it means the knowledge caused by the organ of taste. It being excellent, a knowledge about the divine taste arises ( in the ascetic ). Varta, or Gandhasanvitti, is a knowledge caused by the organ of smell, because the organ of smell is called by the term Vritti in technical language of science (Tantra) as there is an object of smell in it ; and this faculty being excellent, a divine odour is experienced ( by the ascetic )."
          ]
        },
        {
          "verse number": 38,
          "verse title": "",
          "verse": "ते समाधावुपसर्गा व्युत्थाने सिद्धयः",
          "translation": "te samādhāvupasargā vyutthāne siddhayaḥ",
          "meaning": "These fruits are obstacles in the way of meditation and superhuman faculties ( in the state of) non-meditation ( Vyutthana ).",
          "explanation": [
            "He ( now ) states the respective provinces of these particular fruits.",
            "The aforesaid particular fruits become obstacles to the ascetic closely devoted to meditation, ( because his ) meditation becomes relaxed by reason of joy, wonder &c. but in the state of non-meditation Vyuthana—( that is ) in the state of action. these fruits become the superhuman faculties on account of their yielding the particular fruits."
          ]
        },
        {
          "verse number": 39,
          "verse title": "The position when the ascetic knows the mind of another person",
          "verse": "बन्धकारणशैथिल्यात्प्रचारसंवेदनाच्च\nचित्तस्य परशरीरावेशः",
          "translation": "bandhakāraṇaśaithilyātpracārasaṃvedanācca cittasya paraśarīrāveśaḥ",
          "meaning": "The mind of ( the ascetic) enters the body of others by reason of the laxity of the cause of Bandha—( bondage, and by the knowledge of the process — Prachara—of mind ).",
          "explanation": [
            "He (now) states another Siddhi.",
            "A knowledge of the pervading soul and internal organ, entered into ( a particular) body only by virtue of some fixed action, which arises in the form of their becoming experiencer and experienced is called a bondage to the body ( Sarirabandha ). When this knowledge, the cause of bondage, i.e., the action called virtue and vice becomes relaxed or diminished, then the ascetic enters &c. The vein ( called ) Chittavaha, by which the internal organ blows, is a knowledge ( Sanvedana ) of its course of the site of heart towards ( external ) objects by means of organs, and this vein is ( quite ) different from the veins through which the humour ( Rasa ) vital air &c., blow. Therefore, when the internal organ knows the course ( just expounded) of its own body and that of others, it enters a living or dead body of another person by means of that course. The organs (too) follow the internal organ entering the body of another (person ), as black bees follow the queen bee. After that, the ascetic who has (thus) entered the body of another person, deals with that body as if it were his own body, because, the internal organ and the soul are (at all times) pervading, (but a particular) action becomes the cause of the contraction of their enjoyment, and if it is destroyed by meditation, they then receive enjoyment everywhere in consequence of their being independent."
          ]
        },
        {
          "verse number": 40,
          "verse title": "",
          "verse": "उदानजयाज्जलपङ्ककण्टकादिष्वसङ्ग उत्क्रान्तिश्च",
          "translation": "udānajayājjalapaṅkakaṇṭakādiṣvasaṅga utkrāntiśca",
          "meaning": "A disunion (Asanga) with and a rising (Utkranti) from water, mud, thorns etc. (take place) by conquering the Udana, one of the vital airs.",
          "explanation": [
            "He (now) states another Siddhi.",
            "The state of the organs, arisen at once like a ﬂame of burning shaff, is called by the word Jivana and it is dominated Prana & c., from the different actions. Of these, one is called Prana from its conducting the air through the mouth and nose from the heart ; another Apana, from the region of the navel to the great toe ; another, Samana, from conducting air everywhere having surrounded the region of the navel with it ; another, Udana, from its conducting the air upwards from the back of the neck (KRIKATIKA) to the heart ; and another Vyana, from its conducting the air which pervades the whole body. (The ascetic) disjoins himself from water, ( i.e. ) with a large river &c. or a great ( quantity ) of mud or sharp thorns by the quality of going upwards ( obtained ) by hindrance of all the airs. ( effected ) by his conquering the air Udana by means of restraint. The meaning ( the disjunction with water is that the ascetic ) being very light like a quantity of cotton, even if immersed in ( deep) water, rises to the surface. ( He comes out even if placed under a large quantity of mud and cannot be pricked with sharp thorns, by reason of his subduing their Udana through the efficacy of his restraint. )"
          ]
        },
        {
          "verse number": 41,
          "verse title": "",
          "verse": "समानजयाज्ज्वलनम्",
          "translation": "samānajayājjvalanam",
          "meaning": "A blazing ( takes place) from conquering the air samana.",
          "explanation": [
            "He (now) states another Siddhi.",
            "The ascetic appears as if wonderfully blazing by light of the fire of the stomach (Jatharagni) being uncovered from conquering, i.e., from subduing with restraint, the air called Samana which exists (in the body) surrounding the fire of the stomach."
          ]
        },
        {
          "verse number": 42,
          "verse title": "",
          "verse": "श्रोत्राकाशयोः सम्बन्धसंयमाद्दिव्यं श्रोत्रम्",
          "translation": "śrotrākāśayoḥ sambandhasaṃyamāddivyaṃ śrotram",
          "meaning": "A divine organ of hearing ( is developed in the ascetic) by his performing restraint with regard to the connection between ( Srotra ) the organ of hearing and ( Akasa ) the ether.",
          "explanation": [
            "He (now) states another Siddhi.",
            "\"Srotra\" the organ caused by selfishness which apprehends sound and Akasa, ether, the object of which is the subtle rudiment of Sound (Sabda-tanmatra). \"The connection between these,\" the characteristic of this connection is becoming site and situated object, i.e., having place. Such is the meaning of the compound word Desadesibhavalakshana. ( Or Avachchedyavachchehedakalakshana, that is, the characteristic of which is being inclosed and encloser. The true meaning of this is that when sound takes place in the ether enclosed by the space of the ear, then only the organ of hearing catches the sound, otherwise not. Such is the connection between ether and the organ of hearing.) And, when the ascetic performs his restraint with regard to that connection, a divine organ of hearing is developed in him, an organ of hearing which is capable of catching simultaneously subtle, concealed and distant sound, such is the meaning."
          ]
        },
        {
          "verse number": 43,
          "verse title": "",
          "verse": "कायाकाशयोः सम्बन्धसंयमाल्लघुतूल-\nसमापत्तेश्चाकाशगमनम्",
          "translation": "kāyākāśayoḥ sambandhasaṃyamāllaghutūla- samāpatteścākāśagamanam",
          "meaning": "( A power) of walking through the air ( is developed in the ascetic) by his obtaining a state of lightness like a light piece of cotton, etc, from performing his restraint with regard to the connection which a ( man's) body has with air.",
          "explanation": [
            "He (now) states another Siddhi.",
            "The ascetic having performed restraint with regard to the connection of a body consisting of live elements with air by its yielding a space to the body, forms an identity with loose cotton &c., and thus having obtained a state of extreme lightness, he walks at will, on the earth at first, and subsequently being able to walk along the spider's threads, sports with the sun's rays and then walks through the air in any way he likes. He now ( states) another Siddhi."
          ]
        },
        {
          "verse number": 44,
          "verse title": "",
          "verse": "बहिरकल्पिता वृत्तिर्महाविदेहा ततः प्रकाशावरणक्षयः",
          "translation": "bahirakalpitā vṛttirmahāvidehā tataḥ prakāśāvaraṇakṣayaḥ",
          "meaning": "The external modification ( of the internal organ ) Akalpita, thoughtless, is ( called) the great incorporeal ( modification, Mahavideha ) : there from ( results) the destruction of the obscuration of the illumination ( of intellect ).",
          "explanation": [
            "The modification which arises outside the body without having dependence thereon, is, by means of the removal of the steadfastness of the selfishness with regard to the body, called, \"the great incorporeal\" ( modification, \"mahavideha\" ). \"There from\", from the asceticism performed with regard to it ; \"the destruction of the obscuration of the illumination\" that is, the annihilation of the obscuration, the afflictions, works &c., ( i.e. fructification ), of the light of intellect ( or thinking principle ) characterised by purity ( the quality, Sattva ), takes place ; the meaning is this : the external modification of the mind, which takes place while selfishness in regard to the body ( Sarirahankara ) exists, is called, Kalpita, or thoughtful, and when the modification of the mind arises independently, having laid aside the selfishness with regard to the body, then it is called \"Akalpita,\" or thoughtless ( modification) ; from the restraint performed with regard to this, ( Akalpita vrittih ) all the impurities of the mind of the ascetic are removed. \nIn order to exhibit various methods for the perfection of the meditations ( both ) with a germ ( Sabija ) and without a germ ( Nirbija ) which are conducive to the discernment of the truth, he states as follows."
          ]
        },
        {
          "verse number": 45,
          "verse title": "",
          "verse": "स्थूलस्वरूपसूक्ष्मान्वयार्थवत्त्वसंयमाद्भूतजयः",
          "translation": "sthūlasvarūpasūkṣmānvayārthavattvasaṃyamādbhūtajayaḥ",
          "meaning": "The conquering of the elements takes place from the asceticism (performed with regard to the five forms of the elements) gross ( sthula )—nature, ( swarupa ) subtile ( sukshma ), concomitant ( anvaya ) and possession of objects (arthavattva ).",
          "explanation": [
            "The ascetic attains victory ( over ) the elements, that is the elements become subject to him, from the restraint performer in regard to the five properties, grossness &c., ( i.e. grossness nature, subtility, concomitance and possession of objects ) of the elements earth &c. It should be borne in mind that each and all of the five elements possess these five properties, (forms) : \"gross\" ( or the 1st form ) is the phenomenal having appreciable form, of the elements ( including in it gross qualities, gross sound &c. ) ; the \"nature\" ( or second form ) of these, ( that is of the elements ) is characterised respectively by tenuity, viscidity, heat, impulsion and giving space ; the \"subtile\" ( or third form ) is, the subtile elements, odour, &c. ( gandhaditanmatra, that is, odour, flavour, colour, tangibility and sound ), which are determined to be the respective causes of the elements ; \"concomitants\" ( or the fourth form) are qualities, which are observed as everywhere co-existing, in the form or shape of light, action and rest, (or revealing, exertion and fixation) ; \"possession of objects\" ( or the fifth form ) means the power, existing in these qualities, ( or in the five elements, earth &c. ) called the power of procuring fruition, and emancipation, (bhogapavarga sampadanakhya saktihi ), ( and as this power exists in the qualities, and as the qualities exist in the subtile and other elements &c., everything is endowed with fruition and emancipation ).\nThus ( this being the case ) the ascetic performing the asceticism in regard to each of the five forms of the five elements differing by the ( five) shapes characterised by the ( particular ) states above described, conquers the elements. For example, the natures of the elements become obedient like cows following their calves, to his ( the ascetic's ) resolves, who has finished the performing of the restraint ( with regard to each of the five forms ), i.e., ( who has) first performed (restraint) with regard to gross form ( Sthula ), afterwards with regard to subtile form ( Sukshma ) and so forth in due order, (that is in regard to the remaining successive forms ).\nHe ( now) mentions the result of the conquering of the elements."
          ]
        },
        {
          "verse number": 46,
          "verse title": "",
          "verse": "ततोऽणिमादिप्रादुर्भावः कायसम्पत्तद्धर्मानभिघातश्च",
          "translation": "tato'ṇimādiprādurbhāvaḥ kāyasampattaddharmānabhighātaśca",
          "meaning": "There from spring up ( three perfections i.e. ) minute-etc., excellence of body, and non-destruction of the merits of it.",
          "explanation": [
            "\"Minuteness\" ( anima ) attainment of an atomic form—or the power of becoming as minute as an atom, ( by this power the ascetic can enter into a diamond &c. ) ; ( by the word 'Et catera' are meant the other seven perfections viz.) 'Magnitude' ( Mahima ) greatness, or the power of magnifying oneself ( by this power the ascetic can occupy as much space as he likes ) ; 'Gravity' ( Garima ) attainment of heaviness, or the power of becoming heavy ; 'Lightness' ( Laghima ) the power of becoming as light as a ball of cotton ; 'Reach' ( Prapti ) the power of touching the moon &c., with the tip of the finger &c. ; 'Irresistible will ( Prakamya ) means non-frustration of desires in the corporeal internal organ ; 'Dominion' ( Isitva ) means that all the elements obey ( or are unable to disobey ) his ( the ascetic's ) command. These, viz., 'Minuteness' and the other seven perfections, which are conducive to meditation, result from the conquest of the elements, and ( they ) are called the eight great perfections ( Mahasiddhi ) ; the \"Excellence of body\" which will be described hereafter ( in the next aphorism ) is attained the ascetic ( who has conquered the elements ) \"Merits of it\" mean the qualities of the body ( of the ascetic ), colour &c., their destruction, annihilation, cannot be effected by anything, for example, fire cannot burn nor can air dry up his ( the ascetic's ) colour ; such and other cases may be considered.\n( Next ) He mentions what the 'Excellence of body' is :"
          ]
        },
        {
          "verse number": 47,
          "verse title": "",
          "verse": "रूपलावण्यबलवज्रसंहननत्वानि कायसम्पत्",
          "translation": "rūpalāvaṇyabalavajrasaṃhananatvāni kāyasampat",
          "meaning": "The excellence of body consists of colour, loveliness, strength, and adamantine density.",
          "explanation": [
            "\"The excellence of body\" ( Laya-sampat'----which is one of the three perfections that arise from the conquest of the elements) consists of \"Colour\" ( \"rupa,' which means the virtue of becoming white &c. from black &c. and so on ) ; \"Loveliness\" ('Lavanya' excellent beauty, or the virtue of becoming exceedingly beautiful ) ; \"Strength\" ('Bala', or the power of becoming very strong) and \"adamantine density\" ('Vajrasanhananatva' ) i.e. hardness of the body like that of a diamond ( or the power of making the body as hard as a diamond ).\n(Having described the conquest of the elements ), he now mentions the conquest of the organs of sense"
          ]
        },
        {
          "verse number": 48,
          "verse title": "",
          "verse": "ग्रहणस्वरूपास्मितान्वयार्थवत्त्वसंयमादिन्द्रियजयः",
          "translation": "grahaṇasvarūpāsmitānvayārthavattvasaṃyamādindriyajayaḥ",
          "meaning": "The conquering of the organs of sense result from the restraint performed with regard to perception, nature, egotism, concomitance, and possession of objects.",
          "explanation": [
            "The ascetic attains victory over the organs of sense, having as aforesaid\" performed restraint with regard to the five states of the organs of sense viz. \"Perception\" (`Grahana' ) the function of the organs of sense directed towards their objects ; \"Nature\" ( Svarupa ) the state of revealing in general, or the eleven organs, viz., (the five organs of action and the five of sense and the mind ) ; \"Egotism\" ( Asmita) notion of selfishness ; \"Concomitance\" and \"Possession of objects\" are as before stated.\"\n( He (now) states the result of the conquering of the organs of sense : )"
          ]
        },
        {
          "verse number": 49,
          "verse title": "",
          "verse": "ततो मनोजवित्वं विकरणभावः प्रधानजयश्च",
          "translation": "tato manojavitvaṃ vikaraṇabhāvaḥ pradhānajayaśca",
          "meaning": "There from spring up velocity of mind, the state of modification, and the conquest of nature.",
          "explanation": [
            "\"Velocity of mind\" ( Manojavitva ) means attainment of rapid motion by the body like that of mind ; (that is, the ascetic can move his body from one place to another as quick as the mind ). \"The state of modification\" ( Vikaranabhava ) is, the attainment of functions in the organs of sense independent of body; ( that is, the modifications of the organs of sense take place independently of the body at any time, whenever the ascetic desires, with regard to any place or object ). \"The conquest of nature\" ( Pradhana-jaya, the chief or universal victory, ) controlling all things, ( that is altering anything from one state into another at will ). These perfections are attained by the ascetic who has conquered the organs of sense. And these are, here, in this system, called the honey-like (perfections, Madhupratika) because like an individual particle of honey each of them is tasteful.\nHe (now) mentions the conquering of the internal organ."
          ]
        },
        {
          "verse number": 50,
          "verse title": "",
          "verse": "सत्त्वपुरुषान्यताख्यातिमात्रस्य सर्वभावाधिष्ठातृत्वं सर्वज्ञातृत्वं च",
          "translation": "sattvapuruṣānyatākhyātimātrasya sarvabhāvādhiṣṭhātṛtvaṃ\nsarvajñātṛtvaṃ ca",
          "meaning": "Omniscience and supremacy over all existence arise merely ( in the ascetic) who has the discriminative knowledge of the element of purity and soul.",
          "explanation": [
            "( In the ascetic) who has practiced asceticism with regard to the clear modification of the pure clement ( i.e. with regard to internal organ, Antahkarana ) arises the knowledge of the difference between the quality of purity ( Sattva ) and soul ( Purusha ), in the shape of inertness of the notion in regard to the qualities existing as agents, ( or in other words, by which knowledge the conceit that, 'the qualities are agents' is rendered inert ). From the influence of this ( knowledge ) arises in the ascetic, situated in the selfsame position, meditation—or recognition, viz., \"Supremacy over all existence\" and \"Omniscience.\"\n\"Supremacy over all existence\" means, overcoming like a master all entitles, which are modifications of the qualities ( Guna ). \"Omniscience\" means, the distinctive knowledge of them ( i.e. of entitles ) as they are in themselves, which exist in the modes as subsided (Santa) ) emerged ( Udita ) and not yet named, ( Avyapadesya ), viz., the things past, present and future. In the state of perfect consciousness of having overcome (them) ) the perfection which in this system is ( technically ) called visoka, or free from sorrow, takes place.\nHe ( now) states another ground or position in order :"
          ]
        },
        {
          "verse number": 51,
          "verse title": "",
          "verse": "तद्वैराग्यादपि दोषबीजक्षये कैवल्यम्",
          "translation": "tadvairāgyādapi doṣabījakṣaye kaivalyam",
          "meaning": "From an indifference even to this ( perfection ) through the destruction of the germ of perniciousness, results isolation.",
          "explanation": [
            "When an indifference even to this perfection ( which is called ) visoka, or free from sorrow, results in the ascetic then through that ( indifference ) on the absolute destruction, eradication of ignorance which is the germ of the evils, or perniciousness, i.e. desire &c. ( desire and aversion &c.), isolation, absolute cessation of pain, that is permanence of soul in its own state, takes place in consequence of the conclusion of the supremacy of the qualities ( guna ).\n(Next) He states an expedient for firmness in this meditation."
          ]
        },
        {
          "verse number": 52,
          "verse title": "",
          "verse": "स्थान्युपनिमन्त्रणे सङ्गस्मयाकरणं पुनरनिष्टप्रसङ्गात्",
          "translation": "sthānyupanimantraṇe saṅgasmayākaraṇaṃ\npunaraniṣṭaprasaṅgāt",
          "meaning": "( The ascetic ought) not to form association and exhibit wonderment at the invitation of the tutelary deities, for evil would again ensue.",
          "explanation": [
            "There are four ( classes of) ascetics viz., (1) he who has performed the practice and in whom the light ( that consists of the pure element ) has just entered ; (2) he who possesses knowledge that holds to the truth ; (3) he who has conquered the elements and senses ; (4) he who has transcended the objects of meditation. This, the fourth one, in whom has sprung up the seven-fold perfect knowledge, up to the ground of the limit and is realising ( or has the immediate cognition of ) the last stage, which is technically called, madhumati or honeyed, is invited by tutelary deities ( Indra &c.) : that is, they allure him with celestial nymphs and elixir or ambrosia the like. He upon this invitation, should neither form association nor again into the enjoyment of objects ; and by wonderment thinking that he has accomplished his objects does not persevere in meditation. Therefore he should avoid association and wonderment.\nHe states another expedient in regard to this resultant discriminative knowledge :"
          ]
        },
        {
          "verse number": 53,
          "verse title": "",
          "verse": "क्षणतत्क्रमयोः संयमाद्विवेकजं ज्ञानम्",
          "translation": "kṣaṇatatkramayoḥ saṃyamādvivekajaṃ jñānam",
          "meaning": "Knowledge springing from discrimination results from asceticism performed with regard to the relation between moments and to their order.",
          "explanation": [
            "\"By moments\" is meant the ultimate division of time, which cannot be sub-divided into other periods. \"Order\" means modification of such moments of time as prior and posterior. From asceticism ( performed ) with regard thereto ( i.e. with regard to both, the moments and their order) the above-discriminative knowledge results. \nThe meaning is this, when perception even of an exceedingly subtile order of moments has taken place in the ascetic, who has performed asceticism in regard to the order that this moment is posterior to that, and that moment is prior to this ; then he perceives other subtile things also, i.e., the great principle, &c. \nWith the purpose of citing ( another) discrimination of this restraint he states :"
          ]
        },
        {
          "verse number": 54,
          "verse title": "",
          "verse": "जातिलक्षणदेशैरन्यतानवच्छेदात् तुल्ययोस्ततः प्रतिपत्तिः",
          "translation": "jātilakṣaṇadeśairanyatānavacchedāt tulyayostataḥ pratipattiḥ",
          "meaning": "There form results discernment of two similar things, as there is non-discrimination by class, characteristic and place.",
          "explanation": [
            "The cause of distinction of things are \"class\" ( Jati ) `characteristic\" (lakshana ) and \"position\" ( desa ). In some cases the cause of distinction is \"class\" for instance, This is an ox, and This is a buffalo. The cause of discrimination of two things of the same class, is \"characteristic\" for example. This (cow) is of variegated colour, and that is red. And the cause Of discrimination of two things not differentiated by class and possessing similar characteristics is the place seen, as in the case of two emblic myrobalans of equal size, situated in 'two different places.\nBut distinction cannot be made in such case as of two ten lie atoms existing in the same place. When ( in the ascetic who has practiced restraint for a discrimination in regard to such objects, knowledge of distinction arises, then form the practice of that, subtile principles are distinctively known. What is meant is this : where it is impossible to know difference by any other means, there, discernment of distinction certainly takes place by asceticism.\nIn order to explain the signification ( sanjna ) object ( vishaya ) and nature or characteristic ( swabhava ) of the above-described knowledge, springing from discrimination he states :"
          ]
        },
        {
          "verse number": 55,
          "verse title": "",
          "verse": "तारकं सर्वविषयं सर्वथाविषयम् अक्रमं\nचेति विवेकजं ज्ञानम्",
          "translation": "tārakaṃ sarvaviṣayaṃ sarvathāviṣayam akramaṃ\nceti vivekajaṃ jñānam",
          "meaning": "The knowledge springing from discrimination is ( called) saving ( knowledge ), has all things and the entire nature of all things for its objects, and is non-successive.",
          "explanation": [
            "The knowledge arisen in its final stage, from the efficacy of the asceticism described above is by ( its) significant name called saving ( knowledge ) for it delivers ascetics from the unfathomable sea of transmigratory existence. He states its object : It has all things for its object, that is, all principles ( tattva ) i.e., the great principle &c, are its obects. Its \"Nature\" ( svabhava ) is that it has all nature ( for all states ' of things for its object ; that is, all principles existing in any mode, i.e., in all different forms, gross, natural and subtile &c.. in all states, in all modifications, are its objects. He states another characteristic of it, that it is non-successive, that is, there is no order ( priority and posteriority) in perceiving without exception all entities modified in various states or forms : therefore it is called orderless ( akrama ). It contemplates simultaneously all nature as if it were an emblic myrobalan-fruit in the hand.\nWhat results from this saving ( knowledge's taraka )? To  this he replies :"
          ]
        },
        {
          "verse number": 56,
          "verse title": "",
          "verse": "सत्त्वपुरुषयोः शुद्धिसाम्ये कैवल्यमिति",
          "translation": "sattvapuruṣayoḥ śuddhisāmye kaivalyamiti",
          "meaning": "On equalization of clearness of the quality ( i.e. understanding ) and soul, isolation takes place.",
          "explanation": [
            "On the equality of clearness of the pure quality ( viz., the understanding—the modifications of the pure quality ) and soul, the characteristics of which have been described before, Isolation takes place. By \"clearness\" of the pure quality ( i.e., thinking principle, buddhisattva ) is meant its resolution into its cause, by removal of the conceit ( or notion) of being the agent of universe and the \"clearness\" of soul is non-existence of experience ( which is ) attributed to it. Thus, when \"clearness\" of these two ( i.e., of the principle of understanding and soul ) has equally taken place, then Isolation—perfect emancipation—ensuses."
          ]
        }
      ]
    },
    {
      "chapter 4": [
        {
          "verse number": 1,
          "verse title": "",
          "verse": "जन्मौषधिमन्त्रतपःसमाधिजाः सिद्धयः",
          "translation": "janmauṣadhimantratapaḥsamādhijāḥ siddhayaḥ",
          "meaning": "Perfections are produced by birth, herbs (of. Mysterious virtue ), incantations, penances and meditations.",
          "explanation": [
            "Some \"Perfections\" ( Siddhi, supernatural powers ) are caused by birth alone ; such as the motion of birds in the air and the like ; or the knowledge &c., of Kapila and other saints, (.or minuteness &c., of deities that were invested with them in their birth ). \"Perfections\" produced by herbs consist of elixirs and the like, that is, supernatural herbs in Patala—the regions under the earth, ( this perfection is obtained by persons who possess knowledge of these supernatural herbs or medicines ). \"Perfections\" produced by Incantations are well known ( that is this perfection may be obtained by any one, who knows and repeats incantations ). Perfections produced by \"Penances\" are those obtained by Visvamitra and others, ( mendicants and performers of penances ). \"Perfections\" caused by \"meditations\" are such as have been described before.\nThe ( real ) cause of perfections is meditation alone performed in the other births : Incantations and the rest are merely media or mediate causes ( or occasional causes ). But then ( it may be asked ) how the meditation of other ( former births can be the cause ( of perfection, for) in the case of Nandisvara and others the result is seen in this birth alone? To this he replies :"
          ]
        },
        {
          "verse number": 2,
          "verse title": "",
          "verse": "जात्यन्तरपरिणामः प्रकृत्यापूरात्",
          "translation": "jātyantarapariṇāmaḥ prakṛtyāpūrāt",
          "meaning": "The change into another class is from the supply of nature.",
          "explanation": [
            "The change of class &c., of Nandisvara and others in this present life, was from the \"Supply of Natures.\" That is, the natures of former births alone supply the modifications in this birth, viz., they ( the former natures ) cause changes of those ( modifications ) by changing them into different classes, &c. ( The meaning is this that the fact of change of class &c., as is seen in the case of Nandisvara &z., who was born a Brahman, and by worship of Siva was changed into a deity in, that very life, can be accounted for by Nature or modifications of Nature, i.e., in -the case of Nandisvara the body and organs of sense belonging to him as a man and a Brahman were modified into the body and organs of sense of a deity, by supply of constituent particles of the body and organs of sense belonging to a deity ).\nBut ( even ) then ( it may be objected ) merits and demerits are observed to be in process of being realised in this life ; how then can it be maintained that the supply of natures is the cause ? To this he replies :"
          ]
        },
        {
          "verse number": 3,
          "verse title": "",
          "verse": "निमित्तमप्रयोजकं प्रकृतीनां वरणभेदस्तु ततः क्षेत्रिकवत्",
          "translation": "nimittamaprayojakaṃ prakṛtīnāṃ varaṇabhedastu tataḥ kṣetrikavat",
          "meaning": "The occasional is the non-efficient cause of natures ; thereby there is removal of obscurations, in the case of a husbandman (who removes the impediments to the irrigation of his fields.)",
          "explanation": [
            "\"Occasional\", merit &c., is the non-efficient cause of the modifications of natures into other things, for a cause is not set in motion by an effect. Then where ( it may be asked ) is operation of the merits &c. ? To this he replies :\nThereby is the removal of obscurations \"as in the case of a husbandman.\" \"Thereby\" from the merits &c., which are realised, takes place \"Removal\" or destruction of whatever is obscurant, the obstacles, i.e., of works &c., because it is contradictory. On the removal of that obstacle, the natures themselves become efficient of the desired effect. He gives an example, like a husbandman, i.e., as a farmer or husbandman desiring to conduct water from one field to another merely removes the impediments or obstacles ( in the way) of the water which being removed the water itself assumes the modification of profluence, but there is no exertion made by him of advance of water. Similarly is it to be understood of merit and demerit.\nWhen an ascetic assumes numerous bodies simultaneously, then from whence are so many minds ( which are necessary for so many bodies ) produced ? To this he replies : "
          ]
        },
        {
          "verse number": 4,
          "verse title": "",
          "verse": "निर्माणचित्तान्यस्मितामात्रात्",
          "translation": "nirmāṇacittānyasmitāmātrāt",
          "meaning": "The minds in the productions ( ensue) from mere egotism",
          "explanation": [
            "The minds in the productions ( that is, in the bodies which he produce for himself) of an ascetic created by himself, ensue, as sparks arise simultaneously as modifications from fire at his will from egotism alone, which is the general and original cause (of mind ).\nBut ( it may be objected ) as there may be different purposes of so many, ( different) minds, how can they produce one effect ? To this he replies :"
          ]
        },
        {
          "verse number": 5,
          "verse title": "",
          "verse": "प्रवृत्तिभेदे प्रयोजकं चित्तमेकमनेकेषाम्",
          "translation": "pravṛttibhede prayojakaṃ cittamekamanekeṣām",
          "meaning": "In different activities of ( those) numerous (minds) one mind ( of the ascetic) is the moving cause.",
          "explanation": [
            "The \"Moving cause\", i.e., that which actuates the different activities, various operations of those ( different ) minds, as a ruler, is the one mind of the ascetic and not a different, element.\nThe meaning is that as the mind like a ruler directs at will the sight, the hand &c., ( i.e., other organs of sense and action) in his ( the ascetic's ) own body, so in like manner it does in regard to other bodies ( i.e., with regard to the internal and external organs of sense belonging to other bodies ).\nHe (now) states the distinction of the mind produced by meditation from the minds produced by birth &c., ( birth, medicine, incantations and penances )."
          ]
        },
        {
          "verse number": 6,
          "verse title": "",
          "verse": "तत्र ध्यानजमनाशयम्",
          "translation": "tatra dhyānajamanāśayam",
          "meaning": "Among these ( minds produced by birth etc. ), that which springs from meditations is without substratum.",
          "explanation": [
            "Among those five kinds of minds springing from birth &c., ( i.e., birth, medicines, incantations, penances and meditation ) that which springs from meditation or reflection is without substratum, i.e., destitute of the basis of mental deposits of works.\nHe (now) states that as the mind of the ascetic is free from afflictions and actions and is distinct, so his work also is likewise distinct ( from that of others). "
          ]
        },
        {
          "verse number": 7,
          "verse title": "",
          "verse": "कर्माशुक्लाकृष्णं योगिनस्त्रिविधमितरेषाम्",
          "translation": "karmāśuklākṛṣṇaṃ yoginastrividhamitareṣām",
          "meaning": "The work of an ascetic is neither pure nor dark, and that of others is of three kinds.",
          "explanation": [
            "( There are four kinds of works (1) pure, ( sukla ); (2) dark, ( krishna ) ; (3) pure and dark ( sukla-krishna ) ; (4) neither pure nor dark ( asukla-krishna ). Work such as sacrifice &c., which produces a good result, is pure ; that which produces an evil or a bad result, such as the murder of a Brahman &c., is dark, that which is the commixture of both is ( called ) pure dark.\nOf these the pure ( work ) is of those persons who give alms and perform penances and study the Veda ; dark work is that which belongs to infernal beings ; the pure dark work is of men. The work of ascetics is neither pure nor dark, for it does not produce any result, in consequence of the renunciation of results, their practice. He (now) states the result of this work :"
          ]
        },
        {
          "verse number": 8,
          "verse title": "",
          "verse": "ततस्तद्विपाकानुगुणानामेवाभिव्यक्तिर्वासनानाम्",
          "translation": "tatastadvipākānuguṇānāmevābhivyaktirvāsanānām",
          "meaning": "There from ( results) manifestation of those mental deposits alone which are conformable to its fructification.",
          "explanation": [
            "There are two kinds of mental deposits of works, (1) those which have their fruit in memory alone ; (2) those which have for their fruit, rank ( in the scale of being) longevity and enjoyment. Of these, ( two kinds ) those that have for their fruit, rank, longevity and enjoyment, have been described before.\nBut of those that have for their fruit, memory, manifestation merely of those mental deposits takes place, which are adequate and agreeable to the fructification of the work—that is those mental deposits of work become manifest, which are adequate and agreeable to this or that body ( whether of man, deity or animal &c., originating in this or that work ). The meaning is this, that by whatever work anybody such as ( of a deity &c., ) had previously originated ( in work ) after an interval of hundreds of years in commencing the same kind of body again, the mental deposits ( of works ) having for their fruit, memory alone, re-appear in regard to new things alone. The others which are not agreeable thereto remain in subsidence. In this case the mental deposits ( impressions produced by experience of hell &c., ) become manifest.\nHaving raised a doubt as to the possibility of the causal relation of these mental deposits or impressions ( of mind ), in order to show its possibility he states :"
          ]
        },
        {
          "verse number": 9,
          "verse title": "",
          "verse": "जातिदेशकालव्यवहितानामप्यानन्तर्यं\nस्मृतिसंस्कारयोरेकरूपत्वात्",
          "translation": "jātideśakālavyavahitānāmapyānantaryaṃ\nsmṛtisaṃskārayorekarūpatvāt",
          "meaning": "There is an immediacy among those ( impressions ) though intercepted by rank ( in 'i he scale of being ), place and time, because the recollection and the train of self-reproductive impression are identical ( that is they are not different ).",
          "explanation": [
            "Of the transmigrating souls wandering in various births, when any one, having experienced some particular birth, after an interval of thousands of births, enters upon the same birth again, then the impressions ( of mind, vasana), which, depending on the particular body &c., the cause of manifestation, were manifested in that fore-experienced birth, and which disappeared ( for some period ), for want of that particular kind of cause of manifestation, do appear again on finding the same kind of the body &c., the cause of ( their ) manifestation. Thus. even on an interval of rank (Jati ), place and time, there exists an immediacy, non-interval among these in accomplishing identical effects, viz., memory &c., because there is an identity ( that is, there is no difference ) between a memory and the train of self-reproductive thought. For example, from the work ( merit and demerit ) which is performed, the train of self-reproductive property in the shape of impression takes place in the intellectual principle. This is the germination of the fruit ( of works ) that, is of paradise and hell &c., or the existence of the works, sacrifice &c., in a state of power. The recollection of the agent takes place from the self-reproductive property of the power of experiencing this or that particular enjoyment ; and from the recollection there is the experience of pleasure and pain, and from that experience spring up again the self-reproductive impression and recollection, &c. For one whose doctrine, memory and self-reproductive impression are different (things) ) the relation of cause and effect is very difficult for want of an immediacy. But in our view, when the experience itself becomes the self-reproductive impression and the self-reproductive impression changes—into memory, then there is no difficulty of causal relation, because only one intellect or mind remains as a recollector.\nLet there exist an immediacy and the causal relation among the impressions ( of mind ) but when a perception takes place the first time, is it then caused by an impression or does it proceed without a cause ? To clear up this doubt he states as follows :"
          ]
        },
        {
          "verse number": 10,
          "verse title": "",
          "verse": "तासामनादित्वं चाशिषो नित्यत्वात्",
          "translation": "tāsāmanāditvaṃ cāśiṣo nityatvāt",
          "meaning": "They have eternity because the benediction is eternal.",
          "explanation": [
            "\"They\" impressions \"have\" eternity, state of a thing not having a beginning, hence it means that they are without a beginning because the benediction is eternal ; that is, the benediction in the shape of the intense desire, i.e., special resolution. \"May the causes of my pleasure exist always and may there never be separation of us from them\" which is the cause of impressions, is eternal, i.e., has no beginning.\nThe meaning is this,—that, when there is the proximity of the cause ( i.e., impression ) who can oppose the realization of the effects, that is of the perception and the self-continuant impressions ? What is meant is this,—the intellect, modified by ( various ) perception and self-reproductive impression &c., and having the attributes of contraction and expansion, on finding this or that cause of manifestation—i.e., the fructification ( of works ), is diversified by different effect.\nHaving raised the doubt, since they ( impressions) at k. infinite, how is it possible to get rid of them, he declares the means for their removal."
          ]
        },
        {
          "verse number": 11,
          "verse title": "",
          "verse": "हेतुफलाश्रयालम्बनैः संगृहीतत्वादेषामभावे तदभावः",
          "translation": "hetuphalāśrayālambanaiḥ saṃgṛhītatvādeṣāmabhāve tadabhāvaḥ",
          "meaning": "As ( they are) collected by cause, effect, substratum and support ( therefore) on non-existence of these, non-existence of the impressions takes place.",
          "explanation": [
            "The cause of impressions is internal perception, and of this i.e., of perception, desire &c. ( i.e. desire, aversion &c.) and of these (i.e., of desire &c. ) ignorance ; this is the immediate and mediate cause ; the \"effect\" is body &c., and memory &c. ; \"substratum\" is the intellectual principal ( or mind ) ; and the \"support\" of impressions is the same as that of perception ( i.e. the object—the object perceived, that is whatever object being present any impression is excited, that object is the support of that impression ).\nTherefore, as all the impressions are collected by the cause, effect, substratum and support, on non-existence of this cause &c., that is, while these are rendered useless like a burnt seed by knowledge and asceticism, the impressions, for want of a loot, do not spring up—i.e., do not produce ( their ) effect ; this is their non-existence.\nIt may be asked : Since it is observed that the intellect is in momentary transition, and a difference is proved, inasmuch as the impressions are called into being not simultaneously, according to the relation of cause and effect, how can there be unity in the intellect ? In answer to this he states : "
          ]
        },
        {
          "verse number": 12,
          "verse title": "",
          "verse": "अतीतानागतं स्वरूपतोऽस्त्यध्वभेदाद्धर्माणाम्",
          "translation": "atītānāgataṃ svarūpato'styadhvabhedāddharmāṇām",
          "meaning": "That which is past and that which is to come does exist in its proper nature, for the course of proper-ties is different.",
          "explanation": [
            "Production of things not existing is not reasonable, because their relation with existence is impossible, no relation of a hare's horn &c. ( that is of anything chimerical and impossible ) with existence has been anywhere observed. In the case of a non-entity, regarded as an effect, with what design do the causes proceed to act ? No one exercises activity having observed a non-existing object ; otherwise there would be a contradiction also among existences ( inasmuch as if the non-existent became existent, the existent might become non-existent ); there is no relation of a non-existence. Whatever has an existence of its own proper nature, how can that assume a state of non-entity. i.e., non-existence ? That is, can never assume the contrary shape. Therefore, as destruction of existences is impossible and production of non-existences is not possible, the subject of the attributes, though modified by different properties arranged according to their three-fold nature, their three-fold time, standing in their respective courses ( of past, present and future ) do not abandon their forms ; but while standing in the present course they acquire only their perceptibility. The difference of courses such as past and future &c., belongs exclusively to the properties. And the relation of cause and effect is stated in this series in the same manner only. Therefore it cannot be denied that one sole intellect continues as the subject of attributes until final emancipation. Of what kind are these subjects of attributes ? To this he replies : "
          ]
        },
        {
          "verse number": 13,
          "verse title": "",
          "verse": "ते व्यक्तसूक्ष्मा गुणात्मानः",
          "translation": "te vyaktasūkṣmā guṇātmānaḥ",
          "meaning": "Subtile ( objects) consist of qualities.",
          "explanation": [
            "These same subjects of attributes consist of, i.e., are of the nature of the qualities—that is, they are modified forms of the qualities, purity, passion and darkness, existing in the different forms of gross and subtile. For concomitance – attendance of all individuals or entitles differing as internal and external has been seen with purity, passion and darkness, full of pleasure, pain and indifference ; and what is seen as concomitant with anything, that is seen to be the modified form of that, just as jars &c., which are concomitant with earth, are modified forms of earth.\nIf these three qualities are the material causes of every-thing, how is the expression \"one subject of attributes\" to be employed ? Having raised this doubt he states :"
          ]
        },
        {
          "verse number": 14,
          "verse title": "",
          "verse": "परिणामैकत्वाद्वस्तुतत्त्वम्",
          "translation": "pariṇāmaikatvādvastutattvam",
          "meaning": "Unity of thing results from unity of modification",
          "explanation": [
            "Although there are three qualities, still unity, i.e. sameness of thing is spoken of, for there is unity of their ( 'the qualities' ) modification, characterized by the relation of secondary and primary, viz., in some cases purity is secondary, in others passion and in others darkness. For instance in the example, this is earth, this is air &c., ( earth is a modification of the quality of darkness and the air is a modification of that of passion ).It may be objected that the object may be called one or many if it differs from the cognition, but when the cognition itself, the influence of impressions, existing in the relation of cause and effect, appears in different shapes, how then can it be so called ? To this he replies :"
          ]
        },
        {
          "verse number": 15,
          "verse title": "",
          "verse": "वस्तुसाम्ये चित्तभेदात्तयोर्विभक्तः पन्थाः",
          "translation": "vastusāmye cittabhedāttayorvibhaktaḥ panthāḥ",
          "meaning": "The course of these two ( that is, the thing and the object) is distinct, for there is a diversity of thoughts regarding one thing.",
          "explanation": [
            "\"Of these two\", of the knowledge and thing, \"The course is distinct\", i.e. the path is different. Why? Inasmuch as there is a diversity of thoughts regarding one thing, i.e., even in regard to the same thing that is being perceived such as a woman &c,, difference of thoughts in the shape of pleasure, pain and indifference has been observed among various observers. For instance, on seeing a lovely and beautiful woman pleasure arises in an amorous person, aversion in her rival, and disgust in an ascetic ; and thus, since various thoughts take place even in regard to one thing, how can a thing be an effect of the principle of thought ? For were it the effect of one thought, the thing would appear uniformly.\nBesides, if a thing were an effect of mind, then if that mind were engrossed by another object, that thing would be nothing. If it be replied, \"Be it so,\" we deny thins ; for then how could this same thing be perceived by many others ? And as it is perceived, therefore it is not an effect of the thinking principle. If it be replied that that thing is created by many simultaneously, then there should be a difference between a thing that is created by many, and a thing which is created by one. And if the difference is not admitted then there being difference of causes and non-existence of difference of effect, the universe would become causeless or uniform.\nWhen is to be stated is this, that even the cause being different, if the effect is not different, the universe created by many causes may be of one and the same form ; or in consequence of its not following the difference of causes it would be independent and causeless. And if it is so ( it may be asked ) why does the same object which consists of three qualities not produce cognitions full of pleasure, pain and indifference in one percipient ? We reply that this is no valid objection. For as the object consists of three qualities, the mind likewise consists of three qualities, and the merits, demerits are its ( the mind's accessories in the production of an object ( in different shapes ) from the manifestation of these ( merits. demerits &c.) manifestation of mind takes place in such and such a form. Thus when the woman is in the presence of an amorous person, his mind auxiliary whereto is merit, undergoing modification through the predominance of purity, becomes full of pleasure. The mental state of the rival alone likewise through the predominance of passion subsidiary whereto are wealth and merit, becomes full of pain. The mental state of the irate rival through the predominance of darkness, accessory whereto is violent demerit, becomes full of dullness. Therefore the sensible object is different from the sensation. Therefore there is thus no identity between the sensation and its object. There is no relation of cause and effect, inasmuch as there is a contradiction. For ( were it not so ) it would be non-existence of difference of effect. Thus it is established that the object is distinct from the cognition.\nIf this, the cognition, being the illuminator is perceptive by nature, and the object being liable to be illuminated is naturally perceptible, why then does not perception and recollection of all objects take place simultaneously ? In order to obviate this difficulty he states:"
          ]
        },
        {
          "verse number": 16,
          "verse title": "",
          "verse": "तदुपरागापेक्षित्वाच्चित्तस्य वस्तु ज्ञाताज्ञातम्",
          "translation": "taduparāgāpekṣitvāccittasya vastu jñātājñātam",
          "meaning": "An object is known or unknown to the mind inasmuch as the tint of the object is required ( to it ).",
          "explanation": [
            "An external object is known and unknown from the tint of the object, i.e., from bestowing its shape upon the mind. The meaning is that everything when taking place requires an apparatus ( of conditions ). The cognition of blue &c., when taking place requires a tint from the object derived through the channel o: the organs of sense as its accessory cause ; for a different object could not be perceived because that has no relation ( with the knowledge ). Thence the same object which tinged the intellect with its colour—or bestowed its shape upon it. is brought by the cognition into use ( as known ); and the object that has not given its shape is not used as known. And recollection takes place in regard to that object alone, which has been previously perceived and regarding which an object by resemblance &c., exciting the self-reproductive thought becomes the accessory cause of it (recollection. ) Thus perception of all things does not take place simultaneously. Therefore there is no contradiction.\nlf, thus the percipient soul also does not perceive yellow at the same time when it perceives blue, then incidentalness, i.e. liability of becoming modified in perceiving the shape ( of the object ) becomes necessary to the soul inasmuch as it is a percipient. To remove this doubt he states :"
          ]
        },
        {
          "verse number": 17,
          "verse title": "",
          "verse": "सदा ज्ञाताश्चित्तवृत्तयस्तत्प्रभोः पुरुषस्यापरिणामित्वात्",
          "translation": "sadā jñātāścittavṛttayastatprabhoḥ puruṣasyāpariṇāmitvāt",
          "meaning": "The modifications of the mental states are always known, because the presiding spirit is not modified.",
          "explanation": [
            "These modifications of the thinking principle in the shape of changes and misconceptions are always—at all times known to the governing principle—the soul conscious of the mental state, because the soul whose essence is consciousness is not modified—does not undergo a modification. For if the soul also be modified then the modifications ( or the mental states ) being occasional cannot possibly be known at all times. What is meant is this—what is knowable in the interior to the Soul existing always as a ruling principle in the form of consciousness is the clear Pure element, which also is constantly permanent, and by whatever object it is tinged, that object it reflected in the intelligence. And when the shadowing of consciousness takes place, it is proved that the soul is always percipient. Thus there cannot be doubt that the soul is modifiable. But it may be objected that if the mind itself from the prevalence of the Pure element is illuminant, and illumination being illuminant of itself and of other objects illuminates itself as well as the objects, then the business ( or the process ) is accomplished by that alone, what need is there of another percipient ? To remove this doubt he states :"
          ]
        },
        {
          "verse number": 18,
          "verse title": "",
          "verse": "न तत्स्वाभासं दृश्यत्वात्",
          "translation": "na tatsvābhāsaṃ dṛśyatvāt",
          "meaning": "It is not self-illuminative inasmuch as it is cognisable.",
          "explanation": [
            "If mind is not sell-illuminative—the illuminator of objects, in other words, it is perceptible by the soul. If it be asked why : we reply that it is so because it is perceptible, and that which is perceptible is cognisable by the percipient as a jar &c. And the mind ( or thinking principle ) is perceptible, therefore it is not self-illuminative.\nBut it may be objected that this argument is not attended by that which is to be proved, for it is not established that the perception is cognisable. Moreover, it is by means of the consciousness of knowledge that activities of souls in acquiring good and avoiding* evils are observed. For instance, \"I am angry\", \"I am afraid\" and \"I have a desire in regard to this object\" &c., do not take place without being known to the understanding. To refute this, he states :"
          ]
        },
        {
          "verse number": 19,
          "verse title": "",
          "verse": "एकसमये चोभयानवधारणम्",
          "translation": "ekasamaye cobhayānavadhāraṇam",
          "meaning": "Attention to two ( objects) cannot take place simultaneously.",
          "explanation": [
            "The cognition of an object is that which makes it, capable of being regarded as such and such ; viz., that such and such an object is cause of pain or pleasure ; and the perception of understanding is the making possible the notion of \"ego,\" in the form of pain and pleasure, i.e. painful or happy. These two kinds of process cannot take place simultaneously at the time of the perception of an object, for there is contradiction ; two contradictory processes being simultaneously impossible. Hence it is stated that as it is impossible to perceive both its own shape and an object at the same time, the understanding is not self-illuminative. Moreover as the two results of these two processes are not perceived, being directed towards the external object and not existing in itself, the perception of understanding (cognition) does not take place ; consequently the result existing in the object takes place but not that which exists in itself ( the soul ). But it may be said, Let the cognition not be self-perceptive, still it may be perceived by another cognition. He rejects this : "
          ]
        },
        {
          "verse number": 20,
          "verse title": "",
          "verse": "चित्तान्तरदृश्ये बुद्धिबुद्धेरतिप्रसङ्गः स्मृतिसङ्करश्च",
          "translation": "cittāntaradṛśye buddhibuddheratiprasaṅgaḥ smṛtisaṅkaraśca",
          "meaning": "If one perception be cognisable by another then there would be the further necessity of cognition, and a confusion of recollection also would take place.",
          "explanation": [
            "If one notion be perceived by another ( and not by itself ) then this notion also being unable to illuminate another notion, another cognition must be assumed for the perception of this, and another for the perception of that, and so on. Thus there would be a regress ad infinitum ( of notions ), and an object would not be perceived even in the whole life of a man. And while the knowledge is uncertain the object cannot be known. And confusion of recollections also would take place. On a notion taking place regarding a colour or taste, endless other notions would take place in order to perceive this. And when by the train of self-reproductive thought or mental impressions many recollections may be produced simultaneously, then as the notion of the object is not terminated, the perceptions and recollection taking place simultaneously, and it being impossible to know regarding what object the recollection' took place, confusion of recollection would take place. And thus it would not be known that this recollection is conversant about colour, and this conversant about taste. Having raised the doubt that if the notion is not self-illuminative, and it is not perceived by another notion, how then is it that the processes in the form of \"knowledge of an object\" are spoken of ? He states his own opinion : "
          ]
        },
        {
          "verse number": 21,
          "verse title": "",
          "verse": "चितेरप्रतिसंक्रमायास्तदाकारापत्तौ स्वबुद्धिसंवेदनम्",
          "translation": "citerapratisaṃkramāyāstadākārāpattau svabuddhisaṃvedanam",
          "meaning": "The self-knowledge of cognition takes place when the intelligence ( soul) which is non-transeunt acquires the shape of understanding.",
          "explanation": [
            "The soul as being the thinking principle is intelligence, which is non-transeunt, that is, it has no transition or passing into another place ; that is to say, it is not confounded with any other thing. The qualities ( Purity. Passion and Darkness) in the modification characterised by the relation of secondary and primary pass over into the primary quality, i.e., they assume its proper nature as it were, or as the atoms in a state of transition give form to an object in the external world ; not so the power of intellection, for that always remains uniform, inasmuch as it exists in itself. Hence when understanding in the vicinity of it ( the soul ) acquires the nature of intelligence, then it becomes like intelligence. And when the power of intelligence reflected upon the modification of understanding becomes undistinguishable from it, i.e., from the modification of the understanding, then the self-knowledge of understanding takes place.\nHe now proceeds to state that the self-knowing understanding by its power of perceiving all objects is sufficient to accomplish all purposes :"
          ]
        },
        {
          "verse number": 22,
          "verse title": "",
          "verse": "द्रष्टृदृश्योपरक्तं चित्तं सर्वार्थम्",
          "translation": "draṣṭṛdṛśyoparaktaṃ cittaṃ sarvārtham",
          "meaning": "The thinking principce ( i.e. Intellect) tinged by the knower and the knowledge is the totality of objects.",
          "explanation": [
            "The \"knower\" is the soul, tinged by it, means when the understanding has assumed its ( the soul's ) proper nature in contiguity with it. \"Tinged by the knowable\" or the object, means, when it ( the mind ) has assumed the modification in the shape of an object. Then that ( the mind ) itself becomes competent to perceive all objects. As only pure crystals, mirrors and the like are capable of receiving a reflection, so also the \"quality of purity\" not overpowered by \"Passion\" and \"Darkness,\" being pure is capable to receive the reflection of the intelligence ( soul ) ; not so Passion and Darkness, for they are impure. Then the pure quality of purity, wherein the shapes of Passion and Darkness are subsided, being primary or not associated. exists always modifying in one form like a fixed apex of the lamp-flame, by its efficacy of receiving the reflection of intelligence ( soul ) until the attainment of liberation. As motion in iron is produced in the vicinity of a loadstone, in the same manner the manifestable intelligence of the quality of purity k understanding ) is manifested in the proximity of the soul in the shape of intelligence.\nHence in this system of philosophy there are two powers of .................. ......................................The intelligence, (1) the ever-rising, and (2) the manifestable. The ever-rising power of intelligence is the soul. And the manifestable power of intelligence is the \"quality of Purity\" ( understanding ) i.e. the intelligence manifestable in the contiguity of the soul—or ever-rising power. Therefore the understanding alone, tinged by the knower and knowable—appearing as object and subject—i.e. assuming the shape or nature of both intelligent and unintelligent, is called the totality of objects. But it may be asked : The adumbration of a clear object of finite extension has been seen in a pure thing, like the shadow of the face in a looking glass : how does the adumbration of perfectly pure and infinite soul take place in the impure quality of Purity—understanding ? To this it may be replied thus : You say this not knowing the nature of adumbration. The manifestation that takes place in the vicinity of the soul, of the manifestable power of intelligence residing in the \"quality of Purity\" is called adumbration ; and of whatever kind the power of intelligence residing in the soul is, reflection of the same takes place upon it. As for what has been said : How is the perfectly pure soul reflected upon the impure \"quality of Purity ?\"—this also is inconsistent. For the sun &c. is seen to be reflected in water &c. which is deficient in purity. And as for what has been said that reflection of an infinite does not take place, this too is inconsistent. For a reflection even of ether which is infinite is seen in a mirror, &c Thus there is no contradiction in the observation of such reflection. But then it may be objected that it has been stated that the power of intelligence which is manifestable in contiguity with the soul in the understanding, i.e. the modification of the \"quality of Purity,\" reflected in the form of an external object is called the soul's experience in the shape of pleasure or pain. This also is unreasonable. For how is that understanding possible when nature is not modified, and to what purpose would such modification take place ? To this we may reply : \"Nature\" has to provide fruition for the soul, therefore inasmuch as she must afford the aim of the soul, her modification is necessary. This is not right. For it is not possible that she should compass the end of the soul. For Nature's determination to effect the end of the soul is called the provision of the aim of the soul. How is such a resolution compatible with an unintelligent \"nature,\" and if there is a resolution in nature. how then is she unintelligent'? To this it is replied : There are two innate powers in the two modifications characterised by successiveness and regressiveness, the same are called the fulfillment of the end of the soul ; and these modifications are easy for unintelligent nature also. Its ( the nature's ) successive modification is from understanding &c., up .to the gross elements, she being then directed outwards ; again by means of subsiding into the respective courses. the modification which is called regressive modification recedes into egotism. Hence the experience of the soul being completed, and in consequence of the cessation of the two innate powers, nature having realised her end undergoes no farther modiﬁcation.\nThe necessity of providing the end of the soul being as afore-stated, there is no contradiction involved in the unintelligence of nature. But it may be asked that if such a power does naturally exist in nature, why do those seekers of it make efforts to attain emancipation, and if the liberation is not aimed at,—then the system also which lays down precepts for it must be declared useless. This is replied to thus: The eternal relation of the soul and nature characterised as the relation of experiencer and experienced being admitted, the fact of the intelligence of nature follows, and there being an experience of pain in consequence.  of her supposing herself an agent, the resolution : How shah absolute cessation of pain take place in me ? It takes place; hence the system that lays down precepts for the means of removing pain is required by nature. Such an understanding ( the modiﬁed state of the quality of purity) in the shape of active soul is the object of the instruction by this system. In other philosophical systems also such a habit of nature has been made the subject (that is, has been described ). And this endeavouring to attain emancipation, having found such an auxiliary as the precepts of the system, realises the effect or result called emancipation. All effects take their form (i.e. are produced) on receiving their whole apparatus : The apparatus of this effect called emancipation, which is producible merely by regressive modiﬁcation, has been proved to be the same (as stated ), for it cannot be produced in another way. Therefore how can it take place without that ? Consequently it is established that the \"quality of purity\" in the understanding tinged by the object and in which the shadowing of the intelligence ( soul) has taken place, carries on all processes of the universe. Certain erroneous thinkers who suppose their own mind self-conscious. and maintain that the whole universe is pure mind, are hereby informed that the nature of the mind is such as we have described it'.\nBut it may be questioned. If all purp0ses are accomplished by the mind thus described, why then \"should an experiencer be acknowledged ? With reference to this doubt he declares as follows :"
          ]
        },
        {
          "verse number": 23,
          "verse title": "",
          "verse": "तदसंख्येयवासनाभिश्चित्रमपि परार्थं संहत्यकारित्वात्",
          "translation": "tadasaṃkhyeyavāsanābhiścitramapi parārthaṃ\nsaṃhatyakāritvāt",
          "meaning": "'Though variegated by innumerable impressions (mental deposits) it exists for the sake of another because it operates in association.",
          "explanation": [
            "If, the mind, or understanding, though variegated— assuming various forms by innumerable mental impressions, exists for the sake of another—that is. it accomplishes the aim of another i.e., of the governing principle, which- aim is characterised as experiencer, experience and emancipation. If we be asked why, we reply that it is because it operates in performing the aim in association—conjointly i.e., together with another; whatever performs operations in association with another is observed to exist for the sake of another as a seat, or bed; and the qualities of purity. Passion and Darkness assuming modiﬁcation in the shape of understanding operate in association; hence they exist: for the sake of another. And that other is the soul.\nHe now proceeds to ascertain what isolation i.e., the aim of the system, is, by the ten following aphorisms :"
          ]
        },
        {
          "verse number": 24,
          "verse title": "",
          "verse": "विशेषदर्शिन आत्मभावभावनाविनिवृत्तिः",
          "translation": "viśeṣadarśina ātmabhāvabhāvanāvinivṛttiḥ",
          "meaning": "The cessation of the (false) notion regarding the soul takes place in him who knows the difference.",
          "explanation": [
            "Thus the difference between soul and mind being proved. whoever observes their peculiarity. that the one is different from the other, the idea of such a one knowing the proper nature of the mind, as to the understanding being the soul, ceases. That is to say. the false notion that the mind itself is the knower and experiencer is removed. What happens when this has taken place? To this he replies :"
          ]
        },
        {
          "verse number": 25,
          "verse title": "",
          "verse": "तदा विवेकनिम्नं कैवल्यप्राग्भारं चित्तम्",
          "translation": "tadā vivekanimnaṃ kaivalyaprāgbhāraṃ cittam",
          "meaning": "Then the mind becomes deflected towards discrimination bowed down towards (or by) isolation.",
          "explanation": [
            "The mind of the ascetic which was inclined towards ignorance, and directed towards, i.e.. bowed down towards, objects, and had the experience of objects for its fruit, is now turned towards discrimination, i.e. comes into the right path and is directed inwards; and becomes bowed down towards \"Isolation\" i.e., has Isolation for its result, or is possessed of, the germ of Isolation.\nNow by describing the causes of the impediments, which occur to the mind ﬂowing in (the path of) discrimination, he mentions the means of abandoning those (obstacles)."
          ]
        },
        {
          "verse number": 26,
          "verse title": "",
          "verse": "तच्छिद्रेषु प्रत्ययान्तराणि संस्कारेभ्यः",
          "translation": "tacchidreṣu pratyayāntarāṇi saṃskārebhyaḥ",
          "meaning": "In the intervals thereof other thoughts arise from the self-continuant impressions.",
          "explanation": [
            "Different thoughts characterised by non-abstraction, which arise in the intervals in the vacuities, in the mind of the ascetic abiding in meditation, spring up in the shape of \"I\", \"mine\" &c. from the former impressions of the mind produced by the perceptions of non-abstraction, though now extenuated.\nTherefore such thoughts must be abandoned by extirpating their causes. This is what is to be stated.\nHe now states that the methods of abandoning these as they have been described before."
          ]
        },
        {
          "verse number": 27,
          "verse title": "",
          "verse": "हानमेषां क्लेशवदुक्तम्",
          "translation": "hānameṣāṃ kleśavaduktam",
          "meaning": "The means of the avoidance of these are explained to be as in the case of the afflictions.",
          "explanation": [
            "The abandonment of the train of the self-reproductive thoughts must be made in the same manner as the methods described before for the avoidance of afflictions, ignorance &c. That is, as they ( the afflictions ) being consumed in the fire of knowledge do not acquire germination again in the soil of the mind, like burnt seeds, so also the train of the self-reproductive thoughts ( does not continue ).\nHe mentions the method of that kind by which, when meditation has been consolidated by the non-production of other thoughts, any particular kind of ascetic attains excellence in meditation."
          ]
        },
        {
          "verse number": 28,
          "verse title": "",
          "verse": "प्रसंख्यानेऽप्यकुसीदस्य सर्वथा विवेकख्यातेर्धर्ममेघः समाधिः",
          "translation": "prasaṃkhyāne'pyakusīdasya sarvathā vivekakhyāterdharmameghaḥ samādhiḥ",
          "meaning": "If the ascetic is not desirous of fruit ( or is not inert) even when the perfect knowledge has been attained, ( then) the meditation, ( technically called) Dharmamegha, cloud of virtue, takes place from the entire discriminative knowledge.",
          "explanation": [
            "\"Perfect knowledge\" means, knowing the nature, differing from each other of all elements in whatever order they exist even, when this knowledge has taken place if the ascetic has not he desire for the fruit, or is not inactive, then, by means of the discriminative knowledge being entirely consolidated on non-production of other thoughts, the meditation, that is called \"Dharma-Megha\", cloud of virtue, is attained. It is called the cloud of virtue because it irrigates or waters the highest virtue which is called \"asukla-krishna\" neither white nor black, and is the provider of the chief aim of the soul.\nWhat results from that ? To this he replies :"
          ]
        },
        {
          "verse number": 29,
          "verse title": "",
          "verse": "ततः क्लेशकर्मनिवृत्तिः",
          "translation": "tataḥ kleśakarmanivṛttiḥ",
          "meaning": "There from takes place removal of the affliction and works.",
          "explanation": [
            "\"There from\" from the meditation called \"Dharma Megha\", springs up the removal of the afflictions, from Ignorance up to the tenacity ( of mundane existence ) and of the works of three kinds, differing as white &c., ( i.e., white, black, and neither white nor black ) by means of the extirpation of their respective antecedent causes from the arising of the knowledge.\nWhat takes place after these have been removed ? To this it is replied :"
          ]
        },
        {
          "verse number": 30,
          "verse title": "",
          "verse": "तदा सर्वावरणमलापेतस्य ज्ञानस्यानन्त्याज्ज्ञेयमल्पम्",
          "translation": "tadā sarvāvaraṇamalāpetasya jñānasyānantyājjñeyamalpam",
          "meaning": "Then from infiniteness of the knowledge free from the impurity of all its obscurations, the knowable appears small.",
          "explanation": [
            "\"Then\" after the removal of the afflictions and works the knowable becomes small, i.e., the object of little estimation or calculation, because knowledge, freed from these, that is void of the obscurations, i.e., afflictions ( Ignorance &c. ) which obscure the mind, becomes infinite, unlimited, like the sky when the clouds have departed. That is the ascetic knows all that is knowable without any trouble.\nHe states what takes place after this :"
          ]
        },
        {
          "verse number": 31,
          "verse title": "",
          "verse": "ततः कृतार्थानां परिणामक्रमसमाप्तिर्गुणानाम्",
          "translation": "tataḥ kṛtārthānāṃ pariṇāmakramasamāptirguṇānām",
          "meaning": "Thereupon takes place the termination of the succession of the modification of the qualities which have done what was to be done ( or which have realised their end ).",
          "explanation": [
            "\"Thereupon\" after this takes place the termination, i.e., complete cessation, i.e., non-production of the succession, to be described hereafter, of modification, in succession and regression up to the attainment of the aim of the soul, characterised by their relation of existing ( qualities ) as primary and secondary, of the qualities, i.e., \"Passion\" and \"Uaucness\" which have done what was to be done, i.e., which have effected the soul s aim, characterised as experience and emancipation.\nHe now deﬁnes the order above mentioned :"
          ]
        },
        {
          "verse number": 32,
          "verse title": "",
          "verse": "क्षणप्रतियोगी परिणामापरान्तनिर्ग्राह्यः क्रमः",
          "translation": "kṣaṇapratiyogī pariṇāmāparāntanirgrāhyaḥ kramaḥ",
          "meaning": "The order is counterpart on the moment, perceptible in the latter end of the modification.",
          "explanation": [
            "\"Moment\" is a very small portion of time: the counter-part of that. means, perceptible in the latter end of the modiﬁcation (of time, or moment) differing from one (preceding) moment That is whatever is perceived by calculated cognition after the moments have been perceived, the same thing is called the order of moments. It cannot be perceived if the moments are not perceived.\nHe now states the general nature of \"Isolation\" and the result:"
          ]
        },
        {
          "verse number": 33,
          "verse title": "",
          "verse": "पुरुषार्थशून्यानां गुणानां प्रतिप्रसवः कैवल्यं स्वरूपप्रतिष्ठा वा चितिशक्तिरिति",
          "translation": "puruṣārthaśūnyānāṃ guṇānāṃ pratiprasavaḥ kaivalyaṃ svarūpapratiṣṭhā vā citiśaktiriti",
          "meaning": "The re-absorption of those (qualities) void of the aim of the soul, on the abiding of the powers of intelligence in its own nature, is isolation.",
          "explanation": [
            "The re-absorption is the regressive modiﬁcation of the qualities which have consummated the ends of the soul characterised as fruition and emancipation. 0n the consummation: thereof, there is non-production of modiﬁcation; in other words, the state of the intellectual faculty, on the cessation of identity (with objects,) abiding in its own proper nature, is called \"Isolation.\""
          ]
        }
      ]
    }
  ]
}